//convert pas to utf8 by ¥

unit SelectAreaFrame;

interface

uses
  System.SysUtils, System.Types, System.UITypes, System.Classes, System.Variants,
  FMX.Types, FMX.Graphics, FMX.Controls, FMX.Forms, FMX.Dialogs, FMX.StdCtrls,
  uBaseList,
  uTimerTask,
  System.StrUtils,
  uRestInterfaceCall,
  WaitingFrame,
  MessageBoxFrame,
  uSkinMaterial, uSkinScrollControlType, uSkinCustomListType,
  uSkinVirtualListType, uSkinListBoxType, uSkinFireMonkeyScrollControl,
  uSkinFireMonkeyCustomList, uSkinFireMonkeyVirtualList, uSkinFireMonkeyListBox,
  uSkinFireMonkeyButton, uSkinFireMonkeyControl, uSkinFireMonkeyPanel,
  uSkinItems, uSkinFireMonkeyLabel,


  XSuperObject,
  XSuperJson,


  uUIFunction, uSkinButtonType,
  uSkinPanelType, uBaseSkinControl, FMX.Controls.Presentation, FMX.ScrollBox,
  FMX.Memo, uTimerTaskEvent, uDrawCanvas, FMX.Memo.Types;

const
  MaxCount=40;
type
  TAreaStringArray=array[0..MaxCount-1] of string;

const
  //包含多少个省
  Const_Provinces='北京市,上海市,天津市,重庆市,河北省,山西省,内蒙古自治区,辽宁省,吉林省,黑龙江省,江苏省,浙江省,安徽省,福建省,江西省,山东省,河南省,湖北省,湖南省,'
                  +'广东省,广西壮族自治区,海南省,四川省,贵州省,云南省,西藏自治区,陕西省,甘肃省,青海省,宁夏回族自治区,新疆维吾尔自治区,台湾省,香港,澳门,,,,,,,';

  //每个省包含多少个市
  Const_City_Array:array[0..33] of string =
    ('北京市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '上海市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '天津市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '重庆市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '石家庄市,唐山市,秦皇岛市,邯郸市,邢台市,保定市,张家口市,承德市,沧州市,廊坊市,衡水市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '太原市,大同市,阳泉市,长治市,晋城市,朔州市,晋中市,运城市,忻州市,临汾市,吕梁市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '呼和浩特市,包头市,乌海市,赤峰市,通辽市,鄂尔多斯市,呼伦贝尔市,巴彦淖尔市,乌兰察布市,兴安盟,锡林郭勒盟,阿拉善盟,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '沈阳市,大连市,鞍山市,抚顺市,本溪市,丹东市,锦州市,营口市,阜新市,辽阳市,盘锦市,铁岭市,朝阳市,葫芦岛市,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '长春市,吉林市,四平市,辽源市,通化市,白山市,松原市,白城市,延边朝鲜族自治州,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '哈尔滨市,齐齐哈尔市,鸡西市,鹤岗市,双鸭山市,大庆市,伊春市,佳木斯市,七台河市,牡丹江市,黑河市,绥化市,大兴安岭地区,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '南京市,无锡市,徐州市,常州市,苏州市,南通市,连云港市,淮安市,盐城市,扬州市,镇江市,泰州市,宿迁市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '杭州市,宁波市,温州市,嘉兴市,湖州市,绍兴市,金华市,衢州市,舟山市,台州市,丽水市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '合肥市,芜湖市,蚌埠市,淮南市,马鞍山市,淮北市,铜陵市,安庆市,黄山市,滁州市,阜阳市,宿州市,巢湖市,六安市,亳州市,池州市,宣城市,,,,,,,,,,,,,,,,,,,,,,,,',
    '福州市,厦门市,莆田市,三明市,泉州市,漳州市,南平市,龙岩市,宁德市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '南昌市,景德镇市,萍乡市,九江市,新余市,鹰潭市,赣州市,吉安市,宜春市,抚州市,上饶市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '济南市,青岛市,淄博市,枣庄市,东营市,烟台市,潍坊市,济宁市,泰安市,威海市,日照市,莱芜市,临沂市,德州市,聊城市,滨州市,荷泽市,,,,,,,,,,,,,,,,,,,,,,,,',
    '郑州市,开封市,洛阳市,平顶山市,安阳市,鹤壁市,新乡市,焦作市,濮阳市,许昌市,漯河市,三门峡市,南阳市,商丘市,信阳市,周口市,驻马店市,,,,,,,,,,,,,,,,,,,,,,,,',
    '武汉市,黄石市,十堰市,宜昌市,襄樊市,鄂州市,荆门市,孝感市,荆州市,黄冈市,咸宁市,随州市,恩施土家族苗族自治州,省直辖行政单位,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '长沙市,株洲市,湘潭市,衡阳市,邵阳市,岳阳市,常德市,张家界市,益阳市,郴州市,永州市,怀化市,娄底市,湘西土家族苗族自治州,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '广州市,韶关市,深圳市,珠海市,汕头市,佛山市,江门市,湛江市,茂名市,肇庆市,惠州市,梅州市,汕尾市,河源市,阳江市,清远市,东莞市,中山市,潮州市,揭阳市,云浮市,,,,,,,,,,,,,,,,,,,,',
    '南宁市,柳州市,桂林市,梧州市,北海市,防城港市,钦州市,贵港市,玉林市,百色市,贺州市,河池市,来宾市,崇左市,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '海口市,三亚市,省直辖县级行政单位,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '成都市,自贡市,攀枝花市,泸州市,德阳市,绵阳市,广元市,遂宁市,内江市,乐山市,南充市,眉山市,宜宾市,广安市,达州市,雅安市,巴中市,资阳市,阿坝藏族羌族自治州,甘孜藏族自治州,凉山彝族自治州,,,,,,,,,,,,,,,,,,,,',
    '贵阳市,六盘水市,遵义市,安顺市,铜仁地区,黔西南布依族苗族自治州,毕节地区,黔东南苗族侗族自治州,黔南布依族苗族自治州,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '昆明市,曲靖市,玉溪市,保山市,昭通市,丽江市,思茅市,临沧市,楚雄彝族自治州,红河哈尼族彝族自治州,文山壮族苗族自治州,西双版纳傣族自治州,大理白族自治州,德宏傣族景颇族自治州,怒江傈僳族自治州,迪庆藏族自治州,,,,,,,,,,,,,,,,,,,,,,,,,',
    '拉萨市,昌都地区,山南地区,日喀则地区,那曲地区,阿里地区,林芝地区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '西安市,铜川市,宝鸡市,咸阳市,渭南市,延安市,汉中市,榆林市,安康市,商洛市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '兰州市,嘉峪关市,金昌市,白银市,天水市,武威市,张掖市,平凉市,酒泉市,庆阳市,定西市,陇南市,临夏回族自治州,甘南藏族自治州,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '西宁市,海东地区,海北藏族自治州,黄南藏族自治州,海南藏族自治州,果洛藏族自治州,玉树藏族自治州,海西蒙古族藏族自治州,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '银川市,石嘴山市,吴忠市,固原市,中卫市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '乌鲁木齐市,克拉玛依市,吐鲁番地区,哈密地区,昌吉回族自治州,博尔塔拉蒙古自治州,巴音郭楞蒙古自治州,阿克苏地区,克孜勒苏柯尔克孜自治州,喀什地区,和田地区,伊犁哈萨克自治州,塔城地区,阿勒泰地区,省直辖行政单位,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '台湾省,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '香港,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',
    '澳门,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,'
    );

const
  //每个市包含有多少区
  Const_Area_Array:array[0..33] of TAreaStringArray =
  (
    (//北京市
    '东城区,西城区,崇文区,宣武区,朝阳区,丰台区,石景山区,海淀区,门头沟区,房山区,通州区,顺义区,昌平区,大兴区,平谷区,怀柔区,密云县,延庆县,,,,,,,,,,,,,,,,,,,,,,',//北京市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//上海市
    '黄浦区,卢湾区,徐汇区,长宁区,静安区,普陀区,闸北区,虹口区,杨浦区,宝山区,闵行区,嘉定区,松江区,金山区,青浦区,南汇区,奉贤区,浦东新区,崇明县,,,,,,,,,,,,,,,,,,,,,',//上海市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//天津市
    '和平区,河东区,河西区,南开区,河北区,红桥区,塘沽区,汉沽区,大港区,东丽区,西青区,津南区,北辰区,武清区,宝坻区,宁河县,静海县,蓟  县,,,,,,,,,,,,,,,,,,,,,,',//天津市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//重庆市
    '万州区,涪陵区,渝中区,大渡口区,江北区,沙坪坝区,九龙坡区,南岸区,北碚区,万盛区,双桥区,渝北区,巴南区,黔江区,长寿区,綦江县,潼南县,铜梁县,大足县,荣昌县,璧山县,梁平县,城口县,丰都县,垫江县,武隆县,忠县,开县,云阳县,奉节县,巫山县,巫溪县,石柱土家族自治县,秀山土家族苗族自治县,酉阳土家族苗族自治县,彭水苗族土家族自治县,江津市,合川市,永川市,南川市,',//重庆市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//河北省
    '长安区,桥东区,桥西区,新华区,井陉矿区,裕华区,井陉县,正定县,栾城县,行唐县,灵寿县,高邑县,深泽县,赞皇县,无极县,平山县,元氏县,赵县,辛集市,藁城市,晋州市,新乐市,鹿泉市,,,,,,,,,,,,,,,,,',//石家庄市
    '路南区,路北区,古冶区,开平区,丰南区,丰润区,滦县,滦南县,乐亭县,迁西县,玉田县,唐海县,遵化市,迁安市,,,,,,,,,,,,,,,,,,,,,,,,,,',//唐山市
    '海港区,山海关区,北戴河区,青龙满族自治县,昌黎县,抚宁县,卢龙县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//秦皇岛市
    '邯山区,丛台区,复兴区,峰峰矿区,邯郸县,临漳县,成安县,大名县,涉县,磁县,肥乡县,永年县,邱县,鸡泽县,广平县,馆陶县,魏县,曲周县,武安市,,,,,,,,,,,,,,,,,,,,,',//邯郸市
    '桥东区,桥西区,邢台县,临城县,内丘县,柏乡县,隆尧县,任县,南和县,宁晋县,巨鹿县,新河县,广宗县,平乡县,威县,清河县,临西县,南宫市,沙河市,,,,,,,,,,,,,,,,,,,,,',//邢台市
    '新市区,北市区,南市区,满城县,清苑县,涞水县,阜平县,徐水县,定兴县,唐县,高阳县,容城县,涞源县,望都县,安新县,易县,曲阳县,蠡县,顺平县,博野县,雄县,涿州市,定州市,安国市,高碑店市,,,,,,,,,,,,,,,',//保定市
    '桥东区,桥西区,宣化区,下花园区,宣化县,张北县,康保县,沽源县,尚义县,蔚县,阳原县,怀安县,万全县,怀来县,涿鹿县,赤城县,崇礼县,,,,,,,,,,,,,,,,,,,,,,,',//张家口市
    '双桥区,双滦区,鹰手营子矿区,承德县,兴隆县,平泉县,滦平县,隆化县,丰宁满族自治县,宽城满族自治县,围场满族蒙古族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//承德市
    '新华区,运河区,沧县,青县,东光县,海兴县,盐山县,肃宁县,南皮县,吴桥县,献县,孟村回族自治县,泊头市,任丘市,黄骅市,河间市,,,,,,,,,,,,,,,,,,,,,,,,',//沧州市
    '安次区,广阳区,固安县,永清县,香河县,大城县,文安县,大厂回族自治县,霸州市,三河市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//廊坊市
    '桃城区,枣强县,武邑县,武强县,饶阳县,安平县,故城县,景县,阜城县,冀州市,深州市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//衡水市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//山西省
    '小店区,迎泽区,杏花岭区,尖草坪区,万柏林区,晋源区,清徐县,阳曲县,娄烦县,古交市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//太原市
    '城区,矿区,南郊区,新荣区,阳高县,天镇县,广灵县,灵丘县,浑源县,左云县,大同县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//大同市
    '城区,矿区,郊区,平定县,盂县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//阳泉市
    '城区,郊区,长治县,襄垣县,屯留县,平顺县,黎城县,壶关县,长子县,武乡县,沁县,沁源县,潞城市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//长治市
    '城区,沁水县,阳城县,陵川县,泽州县,高平市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//晋城市
    '朔城区,平鲁区,山阴县,应县,右玉县,怀仁县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//朔州市
    '榆次区,榆社县,左权县,和顺县,昔阳县,寿阳县,太谷县,祁县,平遥县,灵石县,介休市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//晋中市
    '盐湖区,临猗县,万荣县,闻喜县,稷山县,新绛县,绛县,垣曲县,夏县,平陆县,芮城县,永济市,河津市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//运城市
    '忻府区,定襄县,五台县,代县,繁峙县,宁武县,静乐县,神池县,五寨县,岢岚县,河曲县,保德县,偏关县,原平市,,,,,,,,,,,,,,,,,,,,,,,,,,',//忻州市
    '尧都区,曲沃县,翼城县,襄汾县,洪洞县,古县,安泽县,浮山县,吉县,乡宁县,大宁县,隰县,永和县,蒲县,汾西县,侯马市,霍州市,,,,,,,,,,,,,,,,,,,,,,,',//临汾市
    '离石区,文水县,交城县,兴县,临县,柳林县,石楼县,岚县,方山县,中阳县,交口县,孝义市,汾阳市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//吕梁市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//内蒙古自治区
    '新城区,回民区,玉泉区,赛罕区,土默特左旗,托克托县,和林格尔县,清水河县,武川县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//呼和浩特市
    '东河区,昆都仑区,青山区,石拐区,白云矿区,九原区,土默特右旗,固阳县,达尔罕茂明安联合旗,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//包头市
    '海勃湾区,海南区,乌达区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//乌海市
    '红山区,元宝山区,松山区,阿鲁科尔沁旗,巴林左旗,巴林右旗,林西县,克什克腾旗,翁牛特旗,喀喇沁旗,宁城县,敖汉旗,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//赤峰市
    '科尔沁区,科尔沁左翼中旗,科尔沁左翼后旗,开鲁县,库伦旗,奈曼旗,扎鲁特旗,霍林郭勒市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//通辽市
    '东胜区,达拉特旗,准格尔旗,鄂托克前旗,鄂托克旗,杭锦旗,乌审旗,伊金霍洛旗,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//鄂尔多斯市
    '海拉尔区,阿荣旗,莫力达瓦达斡尔族自治旗,鄂伦春自治旗,鄂温克族自治旗,陈巴尔虎旗,新巴尔虎左旗,新巴尔虎右旗,满洲里市,牙克石市,扎兰屯市,额尔古纳市,根河市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//呼伦贝尔市
    '临河区,五原县,磴口县,乌拉特前旗,乌拉特中旗,乌拉特后旗,杭锦后旗,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//巴彦淖尔市
    '集宁区,卓资县,化德县,商都县,兴和县,凉城县,察哈尔右翼前旗,察哈尔右翼中旗,察哈尔右翼后旗,四子王旗,丰镇市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//乌兰察布市
    '乌兰浩特市,阿尔山市,科尔沁右翼前旗,科尔沁右翼中旗,扎赉特旗,突泉县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//兴安盟
    '二连浩特市,锡林浩特市,阿巴嘎旗,苏尼特左旗,苏尼特右旗,东乌珠穆沁旗,西乌珠穆沁旗,太仆寺旗,镶黄旗,正镶白旗,正蓝旗,多伦县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//锡林郭勒盟
    '阿拉善左旗,阿拉善右旗,额济纳旗,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//阿拉善盟
    '','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//辽宁省
    '和平区,沈河区,大东区,皇姑区,铁西区,苏家屯区,东陵区,新城子区,于洪区,辽中县,康平县,法库县,新民市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//沈阳市
    '中山区,西岗区,沙河口区,甘井子区,旅顺口区,金州区,长海县,瓦房店市,普兰店市,庄河市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//大连市
    '铁东区,铁西区,立山区,千山区,台安县,岫岩满族自治县,海城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//鞍山市
    '新抚区,东洲区,望花区,顺城区,抚顺县,新宾满族自治县,清原满族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//抚顺市
    '平山区,溪湖区,明山区,南芬区,本溪满族自治县,桓仁满族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//本溪市
    '元宝区,振兴区,振安区,宽甸满族自治县,东港市,凤城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//丹东市
    '古塔区,凌河区,太和区,黑山县,义县,凌海市,北宁市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//锦州市
    '站前区,西市区,鲅鱼圈区,老边区,盖州市,大石桥市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//营口市
    '海州区,新邱区,太平区,清河门区,细河区,阜新蒙古族自治县,彰武县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//阜新市
    '白塔区,文圣区,宏伟区,弓长岭区,太子河区,辽阳县,灯塔市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//辽阳市
    '双台子区,兴隆台区,大洼县,盘山县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//盘锦市
    '银州区,清河区,铁岭县,西丰县,昌图县,调兵山市,开原市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//铁岭市
    '双塔区,龙城区,朝阳县,建平县,喀喇沁左翼蒙古族自治县,北票市,凌源市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//朝阳市
    '连山区,龙港区,南票区,绥中县,建昌县,兴城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//葫芦岛市
    '','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//吉林省
    '南关区,宽城区,朝阳区,二道区,绿园区,双阳区,农安县,九台市,榆树市,德惠市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//长春市
    '昌邑区,龙潭区,船营区,丰满区,永吉县,蛟河市,桦甸市,舒兰市,磐石市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//吉林市
    '铁西区,铁东区,梨树县,伊通满族自治县,公主岭市,双辽市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//四平市
    '龙山区,西安区,东丰县,东辽县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//辽源市
    '东昌区,二道江区,通化县,辉南县,柳河县,梅河口市,集安市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//通化市
    '八道江区,抚松县,靖宇县,长白朝鲜族自治县,江源县,临江市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//白山市
    '宁江区,前郭尔罗斯蒙古族自治县,长岭县,乾安县,扶余县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//松原市
    '洮北区,镇赉县,通榆县,洮南市,大安市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//白城市
    '延吉市,图们市,敦化市,珲春市,龙井市,和龙市,汪清县,安图县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//延边朝鲜族自治州
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//黑龙江省
    '道里区,南岗区,道外区,香坊区,动力区,平房区,松北区,呼兰区,依兰县,方正县,宾县,巴彦县,木兰县,通河县,延寿县,阿城市,双城市,尚志市,五常市,,,,,,,,,,,,,,,,,,,,,',//哈尔滨市
    '龙沙区,建华区,铁锋区,昂昂溪区,富拉尔基区,碾子山区,梅里斯达斡尔族区,龙江县,依安县,泰来县,甘南县,富裕县,克山县,克东县,拜泉县,讷河市,,,,,,,,,,,,,,,,,,,,,,,,',//齐齐哈尔市
    '鸡冠区,恒山区,滴道区,梨树区,城子河区,麻山区,鸡东县,虎林市,密山市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//鸡西市
    '向阳区,工农区,南山区,兴安区,东山区,兴山区,萝北县,绥滨县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//鹤岗市
    '尖山区,岭东区,四方台区,宝山区,集贤县,友谊县,宝清县,饶河县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//双鸭山市
    '萨尔图区,龙凤区,让胡路区,红岗区,大同区,肇州县,肇源县,林甸县,杜尔伯特蒙古族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//大庆市
    '伊春区,南岔区,友好区,西林区,翠峦区,新青区,美溪区,金山屯区,五营区,乌马河区,汤旺河区,带岭区,乌伊岭区,红星区,上甘岭区,嘉荫县,铁力市,,,,,,,,,,,,,,,,,,,,,,,',//伊春市
    '永红区,向阳区,前进区,东风区,郊区,桦南县,桦川县,汤原县,抚远县,同江市,富锦市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//佳木斯市
    '新兴区,桃山区,茄子河区,勃利县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//七台河市
    '东安区,阳明区,爱民区,西安区,东宁县,林口县,绥芬河市,海林市,宁安市,穆棱市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//牡丹江市
    '爱辉区,嫩江县,逊克县,孙吴县,北安市,五大连池市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//黑河市
    '北林区,望奎县,兰西县,青冈县,庆安县,明水县,绥棱县,安达市,肇东市,海伦市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//绥化市
    '呼玛县,塔河县,漠河县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//大兴安岭地区
    '','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//江苏省
    '玄武区,白下区,秦淮区,建邺区,鼓楼区,下关区,浦口区,栖霞区,雨花台区,江宁区,六合区,溧水县,高淳县,,,,,,,,,,,,,,,,,,,,,,,,,,,',//南京市
    '崇安区,南长区,北塘区,锡山区,惠山区,滨湖区,江阴市,宜兴市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//无锡市
    '鼓楼区,云龙区,九里区,贾汪区,泉山区,丰县,沛县,铜山县,睢宁县,新沂市,邳州市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//徐州市
    '天宁区,钟楼区,戚墅堰区,新北区,武进区,溧阳市,金坛市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//常州市
    '沧浪区,平江区,金阊区,虎丘区,吴中区,相城区,常熟市,张家港市,昆山市,吴江市,太仓市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//苏州市
    '崇川区,港闸区,海安县,如东县,启东市,如皋市,通州市,海门市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//南通市
    '连云区,新浦区,海州区,赣榆县,东海县,灌云县,灌南县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//连云港市
    '清河区,楚州区,淮阴区,清浦区,涟水县,洪泽县,盱眙县,金湖县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//淮安市
    '亭湖区,盐都区,响水县,滨海县,阜宁县,射阳县,建湖县,东台市,大丰市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//盐城市
    '广陵区,邗江区,郊区,宝应县,仪征市,高邮市,江都市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//扬州市
    '京口区,润州区,丹徒区,丹阳市,扬中市,句容市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//镇江市
    '海陵区,高港区,兴化市,靖江市,泰兴市,姜堰市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//泰州市
    '宿城区,宿豫区,沭阳县,泗阳县,泗洪县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//宿迁市
    '','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//浙江省
    '上城区,下城区,江干区,拱墅区,西湖区,滨江区,萧山区,余杭区,桐庐县,淳安县,建德市,富阳市,临安市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//杭州市
    '海曙区,江东区,江北区,北仑区,镇海区,鄞州区,象山县,宁海县,余姚市,慈溪市,奉化市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//宁波市
    '鹿城区,龙湾区,瓯海区,洞头县,永嘉县,平阳县,苍南县,文成县,泰顺县,瑞安市,乐清市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//温州市
    '秀城区,秀洲区,嘉善县,海盐县,海宁市,平湖市,桐乡市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//嘉兴市
    '吴兴区,南浔区,德清县,长兴县,安吉县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//湖州市
    '越城区,柯桥区,新昌县,诸暨市,上虞市,嵊州市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//绍兴市  绍兴县
    '婺城区,金东区,武义县,浦江县,磐安县,兰溪市,义乌市,东阳市,永康市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//金华市
    '柯城区,衢江区,常山县,开化县,龙游县,江山市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//衢州市
    '定海区,普陀区,岱山县,嵊泗县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//舟山市
    '椒江区,黄岩区,路桥区,玉环县,三门县,天台县,仙居县,温岭市,临海市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//台州市
    '莲都区,青田县,缙云县,遂昌县,松阳县,云和县,庆元县,景宁畲族自治县,龙泉市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//丽水市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//安徽省
    '瑶海区,庐阳区,蜀山区,包河区,长丰县,肥东县,肥西县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//合肥市
    '镜湖区,马塘区,新芜区,鸠江区,芜湖县,繁昌县,南陵县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//芜湖市
    '龙子湖区,蚌山区,禹会区,淮上区,怀远县,五河县,固镇县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//蚌埠市
    '大通区,田家庵区,谢家集区,八公山区,潘集区,凤台县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//淮南市
    '金家庄区,花山区,雨山区,当涂县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//马鞍山市
    '杜集区,相山区,烈山区,濉溪县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//淮北市
    '铜官山区,狮子山区,郊区,铜陵县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//铜陵市
    '迎江区,大观区,郊区,怀宁县,枞阳县,潜山县,太湖县,宿松县,望江县,岳西县,桐城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//安庆市
    '屯溪区,黄山区,徽州区,歙县,休宁县,黟县,祁门县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//黄山市
    '琅琊区,南谯区,来安县,全椒县,定远县,凤阳县,天长市,明光市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//滁州市
    '颍州区,颍东区,颍泉区,临泉县,太和县,阜南县,颍上县,界首市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//阜阳市
    '墉桥区,砀山县,萧县,灵璧县,泗县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//宿州市
    '居巢区,庐江县,无为县,含山县,和县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//巢湖市
    '金安区,裕安区,寿县,霍邱县,舒城县,金寨县,霍山县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//六安市
    '谯城区,涡阳县,蒙城县,利辛县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//亳州市
    '贵池区,东至县,石台县,青阳县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//池州市
    '宣州区,郎溪县,广德县,泾县,绩溪县,旌德县,宁国市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//宣城市
    '','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//福建省
    '鼓楼区,台江区,仓山区,马尾区,晋安区,闽侯县,连江县,罗源县,闽清县,永泰县,平潭县,福清市,长乐市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//福州市
    '思明区,海沧区,湖里区,集美区,同安区,翔安区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//厦门市
    '城厢区,涵江区,荔城区,秀屿区,仙游县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//莆田市
    '梅列区,三元区,明溪县,清流县,宁化县,大田县,尤溪县,沙县,将乐县,泰宁县,建宁县,永安市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//三明市
    '鲤城区,丰泽区,洛江区,泉港区,惠安县,安溪县,永春县,德化县,金门县,石狮市,晋江市,南安市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//泉州市
    '芗城区,龙文区,云霄县,漳浦县,诏安县,长泰县,东山县,南靖县,平和县,华安县,龙海市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//漳州市
    '延平区,顺昌县,浦城县,光泽县,松溪县,政和县,邵武市,武夷山市,建瓯市,建阳市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//南平市
    '新罗区,长汀县,永定县,上杭县,武平县,连城县,漳平市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//龙岩市
    '蕉城区,霞浦县,古田县,屏南县,寿宁县,周宁县,柘荣县,福安市,福鼎市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//宁德市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//江西省
    '东湖区,西湖区,青云谱区,湾里区,青山湖区,南昌县,新建县,安义县,进贤县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//南昌市
    '昌江区,珠山区,浮梁县,乐平市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//景德镇市
    '安源区,湘东区,莲花县,上栗县,芦溪县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//萍乡市
    '庐山区,浔阳区,九江县,武宁县,修水县,永修县,德安县,星子县,都昌县,湖口县,彭泽县,瑞昌市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//九江市
    '渝水区,分宜县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//新余市
    '月湖区,余江县,贵溪市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//鹰潭市
    '章贡区,赣县,信丰县,大余县,上犹县,崇义县,安远县,龙南县,定南县,全南县,宁都县,于都县,兴国县,会昌县,寻乌县,石城县,瑞金市,南康市,,,,,,,,,,,,,,,,,,,,,,',//赣州市
    '吉州区,青原区,吉安县,吉水县,峡江县,新干县,永丰县,泰和县,遂川县,万安县,安福县,永新县,井冈山市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//吉安市
    '袁州区,奉新县,万载县,上高县,宜丰县,靖安县,铜鼓县,丰城市,樟树市,高安市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//宜春市
    '临川区,南城县,黎川县,南丰县,崇仁县,乐安县,宜黄县,金溪县,资溪县,东乡县,广昌县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//抚州市
    '信州区,上饶县,广丰县,玉山县,铅山县,横峰县,弋阳县,余干县,鄱阳县,万年县,婺源县,德兴市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//上饶市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//山东省
    '历下区,市中区,槐荫区,天桥区,历城区,长清区,平阴县,济阳县,商河县,章丘市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//济南市
    '市南区,市北区,四方区,黄岛区,崂山区,李沧区,城阳区,胶州市,即墨市,平度市,胶南市,莱西市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//青岛市
    '淄川区,张店区,博山区,临淄区,周村区,桓台县,高青县,沂源县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//淄博市
    '市中区,薛城区,峄城区,台儿庄区,山亭区,滕州市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//枣庄市
    '东营区,河口区,垦利县,利津县,广饶县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//东营市
    '芝罘区,福山区,牟平区,莱山区,长岛县,龙口市,莱阳市,莱州市,蓬莱市,招远市,栖霞市,海阳市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//烟台市
    '潍城区,寒亭区,坊子区,奎文区,临朐县,昌乐县,青州市,诸城市,寿光市,安丘市,高密市,昌邑市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//潍坊市
    '市中区,任城区,微山县,鱼台县,金乡县,嘉祥县,汶上县,泗水县,梁山县,曲阜市,兖州市,邹城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//济宁市
    '泰山区,岱岳区,宁阳县,东平县,新泰市,肥城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//泰安市
    '环翠区,文登市,荣成市,乳山市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//威海市
    '东港区,岚山区,五莲县,莒县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//日照市
    '莱城区,钢城区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//莱芜市
    '兰山区,罗庄区,河东区,沂南县,郯城县,沂水县,苍山县,费县,平邑县,莒南县,蒙阴县,临沭县,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//临沂市
    '德城区,陵县,宁津县,庆云县,临邑县,齐河县,平原县,夏津县,武城县,乐陵市,禹城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//德州市
    '东昌府区,阳谷县,莘县,茌平县,东阿县,冠县,高唐县,临清市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//聊城市
    '滨城区,惠民县,阳信县,无棣县,沾化县,博兴县,邹平县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//滨州市
    '牡丹区,曹县,单县,成武县,巨野县,郓城县,鄄城县,定陶县,东明县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//荷泽市
    '','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//河南省
    '中原区,二七区,管城回族区,金水区,上街区,邙山区,中牟县,巩义市,荥阳市,新密市,新郑市,登封市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//郑州市
    '龙亭区,顺河回族区,鼓楼区,南关区,郊区,杞县,通许县,尉氏县,开封县,兰考县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//开封市
    '老城区,西工区,廛河回族区,涧西区,吉利区,洛龙区,孟津县,新安县,栾川县,嵩县,汝阳县,宜阳县,洛宁县,伊川县,偃师市,,,,,,,,,,,,,,,,,,,,,,,,,',//洛阳市
    '新华区,卫东区,石龙区,湛河区,宝丰县,叶县,鲁山县,郏县,舞钢市,汝州市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//平顶山市
    '文峰区,北关区,殷都区,龙安区,安阳县,汤阴县,滑县,内黄县,林州市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//安阳市
    '鹤山区,山城区,淇滨区,浚县,淇县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//鹤壁市
    '红旗区,卫滨区,凤泉区,牧野区,新乡县,获嘉县,原阳县,延津县,封丘县,长垣县,卫辉市,辉县市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//新乡市
    '解放区,中站区,马村区,山阳区,修武县,博爱县,武陟县,温县,济源市,沁阳市,孟州市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//焦作市
    '华龙区,清丰县,南乐县,范县,台前县,濮阳县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//濮阳市
    '魏都区,许昌县,鄢陵县,襄城县,禹州市,长葛市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//许昌市
    '源汇区,郾城区,召陵区,舞阳县,临颍县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//漯河市
    '湖滨区,渑池县,陕县,卢氏县,义马市,灵宝市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//三门峡市
    '宛城区,卧龙区,南召县,方城县,西峡县,镇平县,内乡县,淅川县,社旗县,唐河县,新野县,桐柏县,邓州市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//南阳市
    '梁园区,睢阳区,民权县,睢县,宁陵县,柘城县,虞城县,夏邑县,永城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//商丘市
    '师河区,平桥区,罗山县,光山县,新县,商城县,固始县,潢川县,淮滨县,息县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//信阳市
    '川汇区,扶沟县,西华县,商水县,沈丘县,郸城县,淮阳县,太康县,鹿邑县,项城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//周口市
    '驿城区,西平县,上蔡县,平舆县,正阳县,确山县,泌阳县,汝南县,遂平县,新蔡县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//驻马店市
    '','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//湖北省
    '江岸区,江汉区,乔口区,汉阳区,武昌区,青山区,洪山区,东西湖区,汉南区,蔡甸区,江夏区,黄陂区,新洲区,,,,,,,,,,,,,,,,,,,,,,,,,,,',//武汉市
    '黄石港区,西塞山区,下陆区,铁山区,阳新县,大冶市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//黄石市
    '茅箭区,张湾区,郧县,郧西县,竹山县,竹溪县,房县,丹江口市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//十堰市
    '西陵区,伍家岗区,点军区,猇亭区,夷陵区,远安县,兴山县,秭归县,长阳土家族自治县,五峰土家族自治县,宜都市,当阳市,枝江市,,,,,,,,,,,,,,,,,,,,,,,,,,,',//宜昌市
    '襄城区,樊城区,襄阳区,南漳县,谷城县,保康县,老河口市,枣阳市,宜城市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//襄樊市
    '梁子湖区,华容区,鄂城区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//鄂州市
    '东宝区,掇刀区,京山县,沙洋县,钟祥市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//荆门市
    '孝南区,孝昌县,大悟县,云梦县,应城市,安陆市,汉川市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//孝感市
    '沙市区,荆州区,公安县,监利县,江陵县,石首市,洪湖市,松滋市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//荆州市
    '黄州区,团风县,红安县,罗田县,英山县,浠水县,蕲春县,黄梅县,麻城市,武穴市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//黄冈市
    '咸安区,嘉鱼县,通城县,崇阳县,通山县,赤壁市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//咸宁市
    '曾都区,广水市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//随州市
    '恩施市,利川市,建始县,巴东县,宣恩县,咸丰县,来凤县,鹤峰县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//恩施土家族苗族自治州
    '仙桃市,潜江市,天门市,神农架林区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//省直辖行政单位
    '','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//湖南省
    '芙蓉区,天心区,岳麓区,开福区,雨花区,长沙县,望城县,宁乡县,浏阳市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//长沙市
    '荷塘区,芦淞区,石峰区,天元区,株洲县,攸县,茶陵县,炎陵县,醴陵市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//株洲市
    '雨湖区,岳塘区,湘潭县,湘乡市,韶山市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//湘潭市
    '珠晖区,雁峰区,石鼓区,蒸湘区,南岳区,衡阳县,衡南县,衡山县,衡东县,祁东县,耒阳市,常宁市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//衡阳市
    '双清区,大祥区,北塔区,邵东县,新邵县,邵阳县,隆回县,洞口县,绥宁县,新宁县,城步苗族自治县,武冈市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//邵阳市
    '岳阳楼区,云溪区,君山区,岳阳县,华容县,湘阴县,平江县,汨罗市,临湘市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//岳阳市
    '武陵区,鼎城区,安乡县,汉寿县,澧县,临澧县,桃源县,石门县,津市市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//常德市
    '永定区,武陵源区,慈利县,桑植县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//张家界市
    '资阳区,赫山区,南县,桃江县,安化县,沅江市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//益阳市
    '北湖区,苏仙区,桂阳县,宜章县,永兴县,嘉禾县,临武县,汝城县,桂东县,安仁县,资兴市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//郴州市
    '芝山区,冷水滩区,祁阳县,东安县,双牌县,道县,江永县,宁远县,蓝山县,新田县,江华瑶族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//永州市
    '鹤城区,中方县,沅陵县,辰溪县,溆浦县,会同县,麻阳苗族自治县,新晃侗族自治县,芷江侗族自治县,靖州苗族侗族自治县,通道侗族自治县,洪江市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//怀化市
    '娄星区,双峰县,新化县,冷水江市,涟源市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//娄底市
    '吉首市,泸溪县,凤凰县,花垣县,保靖县,古丈县,永顺县,龙山县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//湘西土家族苗族自治州
    '','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//广东省
    '东山区,荔湾区,越秀区,海珠区,天河区,芳村区,白云区,黄埔区,番禺区,花都区,增城市,从化市,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//广州市
    '武江区,浈江区,曲江区,始兴县,仁化县,翁源县,乳源瑶族自治县,新丰县,乐昌市,南雄市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//韶关市
    '罗湖区,福田区,南山区,宝安区,龙岗区,盐田区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//深圳市
    '香洲区,斗门区,金湾区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//珠海市
    '龙湖区,金平区,濠江区,潮阳区,潮南区,澄海区,南澳县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//汕头市
    '禅城区,南海区,顺德区,三水区,高明区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//佛山市
    '蓬江区,江海区,新会区,台山市,开平市,鹤山市,恩平市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//江门市
    '赤坎区,霞山区,坡头区,麻章区,遂溪县,徐闻县,廉江市,雷州市,吴川市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//湛江市
    '茂南区,茂港区,电白县,高州市,化州市,信宜市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//茂名市
    '端州区,鼎湖区,广宁县,怀集县,封开县,德庆县,高要市,四会市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//肇庆市
    '惠城区,惠阳区,博罗县,惠东县,龙门县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//惠州市
    '梅江区,梅县,大埔县,丰顺县,五华县,平远县,蕉岭县,兴宁市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//梅州市
    '城区,海丰县,陆河县,陆丰市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//汕尾市
    '源城区,紫金县,龙川县,连平县,和平县,东源县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//河源市
    '江城区,阳西县,阳东县,阳春市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//阳江市
    '清城区,佛冈县,阳山县,连山壮族瑶族自治县,连南瑶族自治县,清新县,英德市,连州市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//清远市
    ',,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//东莞市
    ',,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//中山市
    '湘桥区,潮安县,饶平县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//潮州市
    '榕城区,揭东县,揭西县,惠来县,普宁市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//揭阳市
    '云城区,新兴县,郁南县,云安县,罗定市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//云浮市
    '','','','','','','','','','','','','','','','','','',''
    ),
    (//广西壮族自治区
    '兴宁区,青秀区,江南区,西乡塘区,良庆区,邕宁区,武鸣县,隆安县,马山县,上林县,宾阳县,横县,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//南宁市
    '城中区,鱼峰区,柳南区,柳北区,柳江县,柳城县,鹿寨县,融安县,融水苗族自治县,三江侗族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//柳州市
    '秀峰区,叠彩区,象山区,七星区,雁山区,阳朔县,临桂县,灵川县,全州县,兴安县,永福县,灌阳县,龙胜各族自治县,资源县,平乐县,荔蒲县,恭城瑶族自治县,,,,,,,,,,,,,,,,,,,,,,,',//桂林市
    '万秀区,蝶山区,长洲区,苍梧县,藤县,蒙山县,岑溪市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//梧州市
    '海城区,银海区,铁山港区,合浦县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//北海市
    '港口区,防城区,上思县,东兴市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//防城港市
    '钦南区,钦北区,灵山县,浦北县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//钦州市
    '港北区,港南区,覃塘区,平南县,桂平市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//贵港市
    '玉州区,容县,陆川县,博白县,兴业县,北流市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//玉林市
    '右江区,田阳县,田东县,平果县,德保县,靖西县,那坡县,凌云县,乐业县,田林县,西林县,隆林各族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//百色市
    '八步区,昭平县,钟山县,富川瑶族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//贺州市
    '金城江区,南丹县,天峨县,凤山县,东兰县,罗城仫佬族自治县,环江毛南族自治县,巴马瑶族自治县,都安瑶族自治县,大化瑶族自治县,宜州市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//河池市
    '兴宾区,忻城县,象州县,武宣县,金秀瑶族自治县,合山市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//来宾市
    '江洲区,扶绥县,宁明县,龙州县,大新县,天等县,凭祥市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//崇左市
    '','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//海南省
    '秀英区,龙华区,琼山区,美兰区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//海口市
    ',,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//三亚市
    '五指山市,琼海市,儋州市,文昌市,万宁市,东方市,定安县,屯昌县,澄迈县,临高县,白沙黎族自治县,昌江黎族自治县,乐东黎族自治县,陵水黎族自治县,保亭黎族苗族自治县,琼中黎族苗族自治县,西沙群岛,南沙群岛,中沙群岛的岛礁及其海域,,,,,,,,,,,,,,,,,,,,,,',//省直辖县级行政单位
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//四川省
    '锦江区,青羊区,金牛区,武侯区,成华区,龙泉驿区,青白江区,新都区,温江区,金堂县,双流县,郫县,大邑县,蒲江县,新津县,都江堰市,彭州市,邛崃市,崇州市,,,,,,,,,,,,,,,,,,,,,',//成都市
    '自流井区,贡井区,大安区,沿滩区,荣县,富顺县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//自贡市
    '东区,西区,仁和区,米易县,盐边县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//攀枝花市
    '江阳区,纳溪区,龙马潭区,泸县,合江县,叙永县,古蔺县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//泸州市
    '旌阳区,中江县,罗江县,广汉市,什邡市,绵竹市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//德阳市
    '涪城区,游仙区,三台县,盐亭县,安县,梓潼县,北川羌族自治县,平武县,江油市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//绵阳市
    '市中区,元坝区,朝天区,旺苍县,青川县,剑阁县,苍溪县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//广元市
    '船山区,安居区,蓬溪县,射洪县,大英县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//遂宁市
    '市中区,东兴区,威远县,资中县,隆昌县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//内江市
    '市中区,沙湾区,五通桥区,金口河区,犍为县,井研县,夹江县,沐川县,峨边彝族自治县,马边彝族自治县,峨眉山市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//乐山市
    '顺庆区,高坪区,嘉陵区,南部县,营山县,蓬安县,仪陇县,西充县,阆中市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//南充市
    '东坡区,仁寿县,彭山县,洪雅县,丹棱县,青神县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//眉山市
    '翠屏区,宜宾县,南溪县,江安县,长宁县,高县,珙县,筠连县,兴文县,屏山县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//宜宾市
    '广安区,岳池县,武胜县,邻水县,华莹市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//广安市
    '通川区,达县,宣汉县,开江县,大竹县,渠县,万源市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//达州市
    '雨城区,名山县,荥经县,汉源县,石棉县,天全县,芦山县,宝兴县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//雅安市
    '巴州区,通江县,南江县,平昌县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//巴中市
    '雁江区,安岳县,乐至县,简阳市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//资阳市
    '汶川县,理县,茂县,松潘县,九寨沟县,金川县,小金县,黑水县,马尔康县,壤塘县,阿坝县,若尔盖县,红原县,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//阿坝藏族羌族自治州
    '康定县,泸定县,丹巴县,九龙县,雅江县,道孚县,炉霍县,甘孜县,新龙县,德格县,白玉县,石渠县,色达县,理塘县,巴塘县,乡城县,稻城县,得荣县,,,,,,,,,,,,,,,,,,,,,,,',//甘孜藏族自治州
    '西昌市,木里藏族自治县,盐源县,德昌县,会理县,会东县,宁南县,普格县,布拖县,金阳县,昭觉县,喜德县,冕宁县,越西县,甘洛县,美姑县,雷波县,,,,,,,,,,,,,,,,,,,,,,,,',//凉山彝族自治州
    '','','','','','','','','','','','','','','','','','',''
    ),
    (//贵州省
    '南明区,云岩区,花溪区,乌当区,白云区,小河区,开阳县,息烽县,修文县,清镇市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//贵阳市
    '钟山区,六枝特区,水城县,盘县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//六盘水市
    '红花岗区,汇川区,遵义县,桐梓县,绥阳县,正安县,道真仡佬族苗族自治县,务川仡佬族苗族自治县,凤冈县,湄潭县,余庆县,习水县,赤水市,仁怀市,,,,,,,,,,,,,,,,,,,,,,,,,,',//遵义市
    '西秀区,平坝县,普定县,镇宁布依族苗族自治县,关岭布依族苗族自治县,紫云苗族布依族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//安顺市
    '铜仁市,江口县,玉屏侗族自治县,石阡县,思南县,印江土家族苗族自治县,德江县,沿河土家族自治县,松桃苗族自治县,万山特区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//铜仁地区
    '兴义市,兴仁县,普安县,晴隆县,贞丰县,望谟县,册亨县,安龙县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//黔西南布依族苗族自治州
    '毕节市,大方县,黔西县,金沙县,织金县,纳雍县,威宁彝族回族苗族自治县,赫章县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//毕节地区
    '凯里市,黄平县,施秉县,三穗县,镇远县,岑巩县,天柱县,锦屏县,剑河县,台江县,黎平县,榕江县,从江县,雷山县,麻江县,丹寨县,,,,,,,,,,,,,,,,,,,,,,,,,',//黔东南苗族侗族自治州
    '都匀市,福泉市,荔波县,贵定县,瓮安县,独山县,平塘县,罗甸县,长顺县,龙里县,惠水县,三都水族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//黔南布依族苗族自治州
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//云南省
    '五华区,盘龙区,官渡区,西山区,东川区,呈贡县,晋宁县,富民县,宜良县,石林彝族自治县,嵩明县,禄劝彝族苗族自治县,寻甸回族彝族自治县,安宁市,,,,,,,,,,,,,,,,,,,,,,,,,,',//昆明市
    '麒麟区,马龙县,陆良县,师宗县,罗平县,富源县,会泽县,沾益县,宣威市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//曲靖市
    '红塔区,江川县,澄江县,通海县,华宁县,易门县,峨山彝族自治县,新平彝族傣族自治县,元江哈尼族彝族傣族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//玉溪市
    '隆阳区,施甸县,腾冲县,龙陵县,昌宁县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//保山市
    '昭阳区,鲁甸县,巧家县,盐津县,大关县,永善县,绥江县,镇雄县,彝良县,威信县,水富县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//昭通市
    '古城区,玉龙纳西族自治县,永胜县,华坪县,宁蒗彝族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//丽江市
    '翠云区,普洱哈尼族彝族自治县,墨江哈尼族自治县,景东彝族自治县,景谷傣族彝族自治县,镇沅彝族哈尼族拉祜族自治县,江城哈尼族彝族自治县,孟连傣族拉祜族佤族自治县,澜沧拉祜族自治县,西盟佤族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//思茅市
    '临翔区,凤庆县,云县,永德县,镇康县,双江拉祜族佤族布朗族傣族自治县,耿马傣族佤族自治县,沧源佤族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//临沧市
    '楚雄市,双柏县,牟定县,南华县,姚安县,大姚县,永仁县,元谋县,武定县,禄丰县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//楚雄彝族自治州
    '个旧市,开远市,蒙自县,屏边苗族自治县,建水县,石屏县,弥勒县,泸西县,元阳县,红河县,金平苗族瑶族傣族自治县,绿春县,河口瑶族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//红河哈尼族彝族自治州
    '文山县,砚山县,西畴县,麻栗坡县,马关县,丘北县,广南县,富宁县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//文山壮族苗族自治州
    '景洪市,勐海县,勐腊县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//西双版纳傣族自治州
    '大理市,漾濞彝族自治县,祥云县,宾川县,弥渡县,南涧彝族自治县,巍山彝族回族自治县,永平县,云龙县,洱源县,剑川县,鹤庆县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//大理白族自治州
    '瑞丽市,潞西市,梁河县,盈江县,陇川县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//德宏傣族景颇族自治州
    '泸水县,福贡县,贡山独龙族怒族自治县,兰坪白族普米族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//怒江傈僳族自治州
    '香格里拉县,德钦县,维西傈僳族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//迪庆藏族自治州
    '','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//西藏自治区
    '城关区,林周县,当雄县,尼木县,曲水县,堆龙德庆县,达孜县,墨竹工卡县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//拉萨市
    '昌都县,江达县,贡觉县,类乌齐县,丁青县,察雅县,八宿县,左贡县,芒康县,洛隆县,边坝县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//昌都地区
    '乃东县,扎囊县,贡嘎县,桑日县,琼结县,曲松县,措美县,洛扎县,加查县,隆子县,错那县,浪卡子县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//山南地区
    '日喀则市,南木林县,江孜县,定日县,萨迦县,拉孜县,昂仁县,谢通门县,白朗县,仁布县,康马县,定结县,仲巴县,亚东县,吉隆县,聂拉木县,萨嘎县,岗巴县,,,,,,,,,,,,,,,,,,,,,,,',//日喀则地区
    '那曲县,嘉黎县,比如县,聂荣县,安多县,申扎县,索县,班戈县,巴青县,尼玛县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//那曲地区
    '普兰县,札达县,噶尔县,日土县,革吉县,改则县,措勤县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//阿里地区
    '林芝县,工布江达县,米林县,墨脱县,波密县,察隅县,朗县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//林芝地区
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//陕西省
    '新城区,碑林区,莲湖区,灞桥区,未央区,雁塔区,阎良区,临潼区,长安区,蓝田县,周至县,户县,高陵县,,,,,,,,,,,,,,,,,,,,,,,,,,,',//西安市
    '王益区,印台区,耀州区,宜君县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//铜川市
    '渭滨区,金台区,陈仓区,凤翔县,岐山县,扶风县,眉县,陇县,千阳县,麟游县,凤县,太白县,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//宝鸡市
    '秦都区,杨凌区,渭城区,三原县,泾阳县,乾县,礼泉县,永寿县,彬县,长武县,旬邑县,淳化县,武功县,兴平市,,,,,,,,,,,,,,,,,,,,,,,,,,',//咸阳市
    '临渭区,华县,潼关县,大荔县,合阳县,澄城县,蒲城县,白水县,富平县,韩城市,华阴市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//渭南市
    '宝塔区,延长县,延川县,子长县,安塞县,志丹县,吴旗县,甘泉县,富县,洛川县,宜川县,黄龙县,黄陵县,,,,,,,,,,,,,,,,,,,,,,,,,,,',//延安市
    '汉台区,南郑县,城固县,洋县,西乡县,勉县,宁强县,略阳县,镇巴县,留坝县,佛坪县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//汉中市
    '榆阳区,神木县,府谷县,横山县,靖边县,定边县,绥德县,米脂县,佳县,吴堡县,清涧县,子洲县,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//榆林市
    '汉滨区,汉阴县,石泉县,宁陕县,紫阳县,岚皋县,平利县,镇坪县,旬阳县,白河县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//安康市
    '商州区,洛南县,丹凤县,商南县,山阳县,镇安县,柞水县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//商洛市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//甘肃省
    '城关区,七里河区,西固区,安宁区,红古区,永登县,皋兰县,榆中县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//兰州市
    ',,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//嘉峪关市
    '金川区,永昌县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//金昌市
    '白银区,平川区,靖远县,会宁县,景泰县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//白银市
    '秦城区,北道区,清水县,秦安县,甘谷县,武山县,张家川回族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//天水市
    '凉州区,民勤县,古浪县,天祝藏族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//武威市
    '甘州区,肃南裕固族自治县,民乐县,临泽县,高台县,山丹县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//张掖市
    '崆峒区,泾川县,灵台县,崇信县,华亭县,庄浪县,静宁县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//平凉市
    '肃州区,金塔县,安西县,肃北蒙古族自治县,阿克塞哈萨克族自治县,玉门市,敦煌市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//酒泉市
    '西峰区,庆城县,环县,华池县,合水县,正宁县,宁县,镇原县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//庆阳市
    '安定区,通渭县,陇西县,渭源县,临洮县,漳县,岷县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//定西市
    '武都区,成县,文县,宕昌县,康县,西和县,礼县,徽县,两当县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//陇南市
    '临夏市,临夏县,康乐县,永靖县,广河县,和政县,东乡族自治县,积石山保安族东乡族撒拉族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//临夏回族自治州
    '合作市,临潭县,卓尼县,舟曲县,迭部县,玛曲县,碌曲县,夏河县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//甘南藏族自治州
    '','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//青海省
    '城东区,城中区,城西区,城北区,大通回族土族自治县,湟中县,湟源县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//西宁市
    '平安县,民和回族土族自治县,乐都县,互助土族自治县,化隆回族自治县,循化撒拉族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//海东地区
    '门源回族自治县,祁连县,海晏县,刚察县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//海北藏族自治州
    '同仁县,尖扎县,泽库县,河南蒙古族自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//黄南藏族自治州
    '共和县,同德县,贵德县,兴海县,贵南县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//海南藏族自治州
    '玛沁县,班玛县,甘德县,达日县,久治县,玛多县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//果洛藏族自治州
    '玉树县,杂多县,称多县,治多县,囊谦县,曲麻莱县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//玉树藏族自治州
    '格尔木市,德令哈市,乌兰县,都兰县,天峻县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//海西蒙古族藏族自治州
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//宁夏回族自治区
    '兴庆区,西夏区,金凤区,永宁县,贺兰县,灵武市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//银川市
    '大武口区,惠农区,平罗县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//石嘴山市
    '利通区,盐池县,同心县,青铜峡市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//吴忠市
    '原州区,西吉县,隆德县,泾源县,彭阳县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//固原市
    '沙坡头区,中宁县,海原县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//中卫市
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//新疆维吾尔自治区
    '天山区,沙依巴克区,新市区,水磨沟区,头屯河区,达坂城区,东山区,乌鲁木齐县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//乌鲁木齐市
    '独山子区,克拉玛依区,白碱滩区,乌尔禾区,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//克拉玛依市
    '吐鲁番市,鄯善县,托克逊县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//吐鲁番地区
    '哈密市,巴里坤哈萨克自治县,伊吾县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//哈密地区
    '昌吉市,阜康市,米泉市,呼图壁县,玛纳斯县,奇台县,吉木萨尔县,木垒哈萨克自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//昌吉回族自治州
    '博乐市,精河县,温泉县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//博尔塔拉蒙古自治州
    '库尔勒市,轮台县,尉犁县,若羌县,且末县,焉耆回族自治县,和静县,和硕县,博湖县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//巴音郭楞蒙古自治州
    '阿克苏市,温宿县,库车县,沙雅县,新和县,拜城县,乌什县,阿瓦提县,柯坪县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//阿克苏地区
    '阿图什市,阿克陶县,阿合奇县,乌恰县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//克孜勒苏柯尔克孜自治州
    '喀什市,疏附县,疏勒县,英吉沙县,泽普县,莎车县,叶城县,麦盖提县,岳普湖县,伽师县,巴楚县,塔什库尔干塔吉克自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//喀什地区
    '和田市,和田县,墨玉县,皮山县,洛浦县,策勒县,于田县,民丰县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//和田地区
    '伊宁市,奎屯市,伊宁县,察布查尔锡伯自治县,霍城县,巩留县,新源县,昭苏县,特克斯县,尼勒克县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//伊犁哈萨克自治州
    '塔城市,乌苏市,额敏县,沙湾县,托里县,裕民县,和布克赛尔蒙古自治县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//塔城地区
    '阿勒泰市,布尔津县,富蕴县,福海县,哈巴河县,青河县,吉木乃县,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//阿勒泰地区
    '石河子市,阿拉尔市,图木舒克市,五家渠市,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//省直辖行政单位
    '','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//台湾省
    '台北市,高雄市,台北县,桃园县,新竹县,苗栗县,台中县,彰化县,南投县,云林县,嘉义县,台南县,高雄县,屏东县,宜兰县,花莲县,台东县,澎湖县,基隆市,新竹市,台中市,嘉义市,台南市,,,,,,,,,,,,,,,,,',//台湾省
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//香港
    '中西区,湾仔区,东区,南区,深水埗区,油尖旺区,九龙城区,黄大仙区,观塘区,北区,大埔区,沙田区,西贡区,元朗区,屯门区,荃湾区,葵青区,离岛区,,,,,,,,,,,,,,,,,,,,,,',//香港
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    ),
    (//澳门
    '花地玛堂区,圣安多尼堂区,大堂区,望德堂区,风顺堂区,嘉模堂区,圣方济各堂区,路凼,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,',//澳门
    '','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''
    )
  );


type
  //国家
  TState=class
  public
    fid:Integer;
    name_zh:String;
    name_en:String;
    orderno:Double;
    ProvinceList:TBaseList;

  public
    constructor Create;
    destructor Destroy;override;
  public
    function ParseProvinceListFromWeb(ASuperObject:ISuperObject):Boolean;
    function ParseProvinceListFromJson(ASuperArray: ISuperArray):Boolean;
    function ParseProvinceListFromCommaText(ACommaText:String;
                                            ACityArray:Array of String;
                                            AAreaArray:Array of TAreaStringArray):Boolean;
    function SaveAsCommaText:String;
  end;

  //省份
  TProvince=class
    fid:Integer;
    state_fid:Integer;
    name_zh:String;
    name_en:String;
    orderno:String;
    CityList:TBaseList;
  public
    constructor Create;
    destructor Destroy;override;
  public
    function ParseCityListFromJson(ASuperArray: ISuperArray):Boolean;
    function ParseCityListFromCommaText(ACommaText:String;
                                        AAreaArray:Array of String):Boolean;
    function SaveAsCommaText:String;
  end;

  //城市
  TCity=class
    fid:Integer;
    state_fid:Integer;
    province_fid:Integer;
    name_zh:String;
    name_en:String;
    orderno:String;
    AreaList:TBaseList;
  public
    constructor Create;
    destructor Destroy;override;
  public
    function ParseAreaListFromJson(ASuperArray: ISuperArray):Boolean;
    function ParseAreaListFromCommaText(ACommaText:String):Boolean;
    function SaveAsCommaText:String;
  end;

  //区域
  TArea=class
    fid:Integer;
    state_fid:Integer;
    province_fid:Integer;
    city_fid:Integer;
    name_zh:String;
    name_en:String;
    orderno:String;
  end;


  TFrameSelectArea = class(TFrame)
    pnlToolBar: TSkinFMXPanel;
    btnOK: TSkinFMXButton;
    btnReturn: TSkinFMXButton;
    lbCity_Material:TSkinListBoxDefaultMaterial;
    tteGetArea: TTimerTaskEvent;
    SkinFMXPanel1: TSkinFMXPanel;
    lbProvience: TSkinFMXListBox;
    lbCity: TSkinFMXListBox;
    lbCounty: TSkinFMXListBox;
    Memo1: TMemo;
    pnlDevide2: TSkinFMXPanel;
    btnPosition: TSkinFMXButton;
    procedure lbProvienceSelectedItem(Sender: TObject; AItem: TSkinItem);
    procedure lbCitySelectedItem(Sender: TObject; AItem: TSkinItem);
    procedure btnOKClick(Sender: TObject);
    procedure btnReturnClick(Sender: TObject);
    procedure FrameResize(Sender: TObject);
    procedure tteGetAreaExecute(Sender: TTimerTask);
    procedure tteGetAreaExecuteEnd(Sender: TTimerTask);
    procedure btnPositionClick(Sender: TObject);
 private
    { Private declarations }
    FState:TState;
    FRestStateNameEn:String;
    FRestUrl:String;
    FIsDataLoaded:Boolean;
    FProvienceIndex,FCityIndex,FAreaIndex:Integer;

    FIsEnglish:Boolean;

    FIsNeedArea:Boolean;

    //延迟定位
    FDelayLoadProvinceName:String;
    FDelayLoadCityName:String;
    FDelayLoadAreaName:String;
  public
    //点击GPS地址就确定了
    FIsClickGPSAddrThenOK:Boolean;
    FGPSProvince:String;
    FGPSCity:String;
    FGPSArea:String;
    procedure SetGPSLocation(AProvince:String;ACity:String;AArea:String);
  public
    //第一步
    procedure LoadData();
    procedure LoadDataFromWeb(ARestUrl:String;AStateNameEn:String='China');
  public
    procedure GetAllProvience();
    procedure GetAllCity();
    procedure GetAllCounty();

    //第二步
    procedure Init(AProvinceName,ACityName,AAreaName:String;
                    AIsLoadDataFromConst:Boolean=True;
                    AIsEnglish:Boolean=False;
                    AIsNeedArea:Boolean=True);
    //显示选中的选项
    procedure ShowDefaultData();

  public
//    FrameHistroy:TFrameHistroy;
    FSelectedProvince,FSelectedCity,FSelectedArea:String;

    constructor Create(AOwner:TComponent);override;
    destructor Destroy;override;
    { Public declarations }
  end;

var
  GlobalSelectAreaFrame:TFrameSelectArea;


implementation


{$R *.fmx}


var
  //国家是否包含城市选择
  GlobalIsStateHasCity:Boolean;
  //国家是否包含区域选择
  GlobalIsStateHasArea:Boolean;




// 数据源
constructor TFrameSelectArea.Create(AOwner: TComponent);
//var
//  I: Integer;
//  AProvince:TProvince;
//  ACity:TCity;
//  J: Integer;
//  K: Integer;
//  AStr:String;
begin
  inherited;

  FIsNeedArea:=True;

  FState:=TState.Create;

  Self.pnlToolBar.SelfOwnMaterial.BackColor.FillColor.Color:=SkinThemeColor;
  Self.lbCity_Material.DrawCenterItemRectParam.BorderColor.Color:=SkinThemeColor;


  Self.lbProvience.Prop.Items.Clear();
  Self.lbCity.Prop.Items.Clear();
  Self.lbCounty.Prop.Items.Clear();


  Memo1.Visible:=False;


  FIsClickGPSAddrThenOK:=True;

  //输出数组
//  Memo1.Visible:=True;
//  Memo1.Lines.Add(Self.FState.SaveAsCommaText);
//
//  for I := 0 to Self.FState.ProvinceList.Count-1 do
//  begin
//    AProvince:=TProvince(Self.FState.ProvinceList[I]);
//
//    Memo1.Lines.Add('('+'//'+AProvince.name_zh);
//    for J := 0 to AProvince.CityList.Count-1 do
//    begin
//      ACity:=TCity(AProvince.CityList[J]);
//      Memo1.Lines.Add(ACity.SaveAsCommaText+'//'+ACity.name_zh);
//    end;
//
//    //补齐
//    AStr:='';
//    for K := 0 to MaxCount-AProvince.CityList.Count-1 do
//    begin
//
//      if K=MaxCount-AProvince.CityList.Count-1 then
//      begin
//        AStr:=AStr+'''''';
//      end
//      else
//      begin
//        AStr:=AStr+''''',';
//      end;
//
//    end;
//    Memo1.Lines.Add(AStr);
//
//    Memo1.Lines.Add('),');
//  end;


  RecordSubControlsLang(Self);
  TranslateSubControlsLang(Self);
end;

procedure TFrameSelectArea.LoadData;
//var
//  jsonData:String;
//  dataObject:ISuperObject;
begin
  {$REGION 'JSON'}
//  jsonData:=
//'{' +
//'   "data":[' +
//'        {' +
//'            "name":"北京市","cities":[' +
//'                {' +
//'                    "name":"北京市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name": "东城区"},{' +
//'                            "name": "西城区"},{' +
//'                            "name": "崇文区"},{' +
//'                            "name": "宣武区"},{' +
//'                            "name": "朝阳区"},{' +
//'                            "name": "丰台区"},{' +
//'                            "name": "石景山区"},{' +
//'                            "name": "海淀区"},{' +
//'                            "name": "门头沟区"},{' +
//'                            "name": "房山区"},{' +
//'                            "name": "通州区"},{' +
//'                            "name": "顺义区"},{' +
//'                            "name": "昌平区"},{' +
//'                            "name": "大兴区"},{' +
//'                            "name": "平谷区"},{' +
//'                            "name": "怀柔区"},{' +
//'                            "name": "密云县"},{' +
//'                            "name": "延庆县"}]}]},{' +
//'            "name":"上海市","cities":[' +
//'                {' +
//'                    "name":"上海市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"黄浦区"},{' +
//'                            "name":"卢湾区"},{' +
//'                            "name":"徐汇区"},{' +
//'                            "name":"长宁区"},{' +
//'                            "name":"静安区"},{' +
//'                            "name":"普陀区"},{' +
//'                            "name":"闸北区"},{' +
//'                            "name":"虹口区"},{' +
//'                            "name":"杨浦区"},{' +
//'                            "name":"宝山区"},{' +
//'                            "name":"闵行区"},{' +
//'                            "name":"嘉定区"},{' +
//'                            "name":"松江区"},{' +
//'                            "name":"金山区"},{' +
//'                            "name":"青浦区"},{' +
//'                            "name":"南汇区"},{' +
//'                            "name":"奉贤区"},{' +
//'                            "name":"浦东新区"},{' +
//'                            "name":"崇明县"}]}]},{' +
//'            "name":"天津市","cities":[' +
//'                {' +
//'                    "name":"天津市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"和平区"},{' +
//'                            "name":"河东区"},{' +
//'                            "name":"河西区"},{' +
//'                            "name":"南开区"},{' +
//'                            "name":"河北区"},{' +
//'                            "name":"红桥区"},{' +
//'                            "name":"塘沽区"},{' +
//'                            "name":"汉沽区"},{' +
//'                            "name":"大港区"},{' +
//'                            "name":"东丽区"},{' +
//'                            "name":"西青区"},{' +
//'                            "name":"津南区"},{' +
//'                            "name":"北辰区"},{' +
//'                            "name":"武清区"},{' +
//'                            "name":"宝坻区"},{' +
//'                            "name":"宁河县"},{' +
//'                            "name":"静海县"},{' +
//'                            "name":"蓟  县"}]}]},{' +
//'            "name":"重庆市","cities":[' +
//'                {' +
//'                    "name":"重庆市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"万州区"},{' +
//'                            "name":"涪陵区"},{' +
//'                            "name":"渝中区"},{' +
//'                            "name":"大渡口区"},{' +
//'                            "name":"江北区"},{' +
//'                            "name":"沙坪坝区"},{' +
//'                            "name":"九龙坡区"},{' +
//'                            "name":"南岸区"},{' +
//'                            "name":"北碚区"},{' +
//'                            "name":"万盛区"},{' +
//'                            "name":"双桥区"},{' +
//'                            "name":"渝北区"},{' +
//'                            "name":"巴南区"},{' +
//'                            "name":"黔江区"},{' +
//'                            "name":"长寿区"},{' +
//'                            "name":"綦江县"},{' +
//'                            "name":"潼南县"},{' +
//'                            "name":"铜梁县"},{' +
//'                            "name":"大足县"},{' +
//'                            "name":"荣昌县"},{' +
//'                            "name":"璧山县"},{' +
//'                            "name":"梁平县"},{' +
//'                            "name":"城口县"},{' +
//'                            "name":"丰都县"},{' +
//'                            "name":"垫江县"},{' +
//'                            "name":"武隆县"},{' +
//'                            "name":"忠县"},{' +
//'                            "name":"开县"},{' +
//'                            "name":"云阳县"},{' +
//'                            "name":"奉节县"},{' +
//'                            "name":"巫山县"},{' +
//'                            "name":"巫溪县"},{' +
//'                            "name":"石柱土家族自治县"},{' +
//'                            "name":"秀山土家族苗族自治县"},{' +
//'                            "name":"酉阳土家族苗族自治县"},{' +
//'                            "name":"彭水苗族土家族自治县"},{' +
//'                            "name":"江津市"},{' +
//'                            "name":"合川市"},{' +
//'                            "name":"永川市"},{' +
//'                            "name":"南川市"}]}]},{' +
//'            "name":"河北省","cities":[' +
//'                {' +
//'                    "name":"石家庄市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"长安区"},{' +
//'                            "name":"桥东区"},{' +
//'                            "name":"桥西区"},{' +
//'                            "name":"新华区"},{' +
//'                            "name":"井陉矿区"},{' +
//'                            "name":"裕华区"},{' +
//'                            "name":"井陉县"},{' +
//'                            "name":"正定县"},{' +
//'                            "name":"栾城县"},{' +
//'                            "name":"行唐县"},{' +
//'                            "name":"灵寿县"},{' +
//'                            "name":"高邑县"},{' +
//'                            "name":"深泽县"},{' +
//'                            "name":"赞皇县"},{' +
//'                            "name":"无极县"},{' +
//'                            "name":"平山县"},{' +
//'                            "name":"元氏县"},{' +
//'                            "name":"赵县"},{' +
//'                            "name":"辛集市"},{' +
//'                            "name":"藁城市"},{' +
//'                            "name":"晋州市"},{' +
//'                            "name":"新乐市"},{' +
//'                            "name":"鹿泉市"}]},{' +
//'                    "name":"唐山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"路南区"},{' +
//'                            "name":"路北区"},{' +
//'                            "name":"古冶区"},{' +
//'                            "name":"开平区"},{' +
//'                            "name":"丰南区"},{' +
//'                            "name":"丰润区"},{' +
//'                            "name":"滦县"},{' +
//'                            "name":"滦南县"},{' +
//'                            "name":"乐亭县"},{' +
//'                            "name":"迁西县"},{' +
//'                            "name":"玉田县"},{' +
//'                            "name":"唐海县"},{' +
//'                            "name":"遵化市"},{' +
//'                            "name":"迁安市"}]},{' +
//'                    "name":"秦皇岛市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"海港区"},{' +
//'                            "name":"山海关区"},{' +
//'                            "name":"北戴河区"},{' +
//'                            "name":"青龙满族自治县"},{' +
//'                            "name":"昌黎县"},{' +
//'                            "name":"抚宁县"},{' +
//'                            "name":"卢龙县"}]},{' +
//'                    "name":"邯郸市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"邯山区"},{' +
//'                            "name":"丛台区"},{' +
//'                            "name":"复兴区"},{' +
//'                            "name":"峰峰矿区"},{' +
//'                            "name":"邯郸县"},{' +
//'                            "name":"临漳县"},{' +
//'                            "name":"成安县"},{' +
//'                            "name":"大名县"},{' +
//'                            "name":"涉县"},{' +
//'                            "name":"磁县"},{' +
//'                            "name":"肥乡县"},{' +
//'                            "name":"永年县"},{' +
//'                            "name":"邱县"},{' +
//'                            "name":"鸡泽县"},{' +
//'                            "name":"广平县"},{' +
//'                            "name":"馆陶县"},{' +
//'                            "name":"魏县"},{' +
//'                            "name":"曲周县"},{' +
//'                            "name":"武安市"}]},{' +
//'                    "name":"邢台市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"桥东区"},{' +
//'                            "name":"桥西区"},{' +
//'                            "name":"邢台县"},{' +
//'                            "name":"临城县"},{' +
//'                            "name":"内丘县"},{' +
//'                            "name":"柏乡县"},{' +
//'                            "name":"隆尧县"},{' +
//'                            "name":"任县"},{' +
//'                            "name":"南和县"},{' +
//'                            "name":"宁晋县"},{' +
//'                            "name":"巨鹿县"},{' +
//'                            "name":"新河县"},{' +
//'                            "name":"广宗县"},{' +
//'                            "name":"平乡县"},{' +
//'                            "name":"威县"},{' +
//'                            "name":"清河县"},{' +
//'                            "name":"临西县"},{' +
//'                            "name":"南宫市"},{' +
//'                            "name":"沙河市"}]},{' +
//'                    "name":"保定市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"新市区"},{' +
//'                            "name":"北市区"},{' +
//'                            "name":"南市区"},{' +
//'                            "name":"满城县"},{' +
//'                            "name":"清苑县"},{' +
//'                            "name":"涞水县"},{' +
//'                            "name":"阜平县"},{' +
//'                            "name":"徐水县"},{' +
//'                            "name":"定兴县"},{' +
//'                            "name":"唐县"},{' +
//'                            "name":"高阳县"},{' +
//'                            "name":"容城县"},{' +
//'                            "name":"涞源县"},{' +
//'                            "name":"望都县"},{' +
//'                            "name":"安新县"},{' +
//'                            "name":"易县"},{' +
//'                            "name":"曲阳县"},{' +
//'                            "name":"蠡县"},{' +
//'                            "name":"顺平县"},{' +
//'                            "name":"博野县"},{' +
//'                            "name":"雄县"},{' +
//'                            "name":"涿州市"},{' +
//'                            "name":"定州市"},{' +
//'                            "name":"安国市"},{' +
//'                            "name":"高碑店市"}]},{' +
//'                    "name":"张家口市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"桥东区"},{' +
//'                            "name":"桥西区"},{' +
//'                            "name":"宣化区"},{' +
//'                            "name":"下花园区"},{' +
//'                            "name":"宣化县"},{' +
//'                            "name":"张北县"},{' +
//'                            "name":"康保县"},{' +
//'                            "name":"沽源县"},{' +
//'                            "name":"尚义县"},{' +
//'                            "name":"蔚县"},{' +
//'                            "name":"阳原县"},{' +
//'                            "name":"怀安县"},{' +
//'                            "name":"万全县"},{' +
//'                            "name":"怀来县"},{' +
//'                            "name":"涿鹿县"},{' +
//'                            "name":"赤城县"},{' +
//'                            "name":"崇礼县"}]},{' +
//'                    "name":"承德市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"双桥区"},{' +
//'                            "name":"双滦区"},{' +
//'                            "name":"鹰手营子矿区"},{' +
//'                            "name":"承德县"},{' +
//'                            "name":"兴隆县"},{' +
//'                            "name":"平泉县"},{' +
//'                            "name":"滦平县"},{' +
//'                            "name":"隆化县"},{' +
//'                            "name":"丰宁满族自治县"},{' +
//'                            "name":"宽城满族自治县"},{' +
//'                            "name":"围场满族蒙古族自治县"}]},{' +
//'                    "name":"沧州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"新华区"},{' +
//'                            "name":"运河区"},{' +
//'                            "name":"沧县"},{' +
//'                            "name":"青县"},{' +
//'                            "name":"东光县"},{' +
//'                            "name":"海兴县"},{' +
//'                            "name":"盐山县"},{' +
//'                            "name":"肃宁县"},{' +
//'                            "name":"南皮县"},{' +
//'                            "name":"吴桥县"},{' +
//'                            "name":"献县"},{' +
//'                            "name":"孟村回族自治县"},{' +
//'                            "name":"泊头市"},{' +
//'                            "name":"任丘市"},{' +
//'                            "name":"黄骅市"},{' +
//'                            "name":"河间市"}]},{' +
//'                    "name":"廊坊市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"安次区"},{' +
//'                            "name":"广阳区"},{' +
//'                            "name":"固安县"},{' +
//'                            "name":"永清县"},{' +
//'                            "name":"香河县"},{' +
//'                            "name":"大城县"},{' +
//'                            "name":"文安县"},{' +
//'                            "name":"大厂回族自治县"},{' +
//'                            "name":"霸州市"},{' +
//'                            "name":"三河市"}]},{' +
//'                    "name":"衡水市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"桃城区"},{' +
//'                            "name":"枣强县"},{' +
//'                            "name":"武邑县"},{' +
//'                            "name":"武强县"},{' +
//'                            "name":"饶阳县"},{' +
//'                            "name":"安平县"},{' +
//'                            "name":"故城县"},{' +
//'                            "name":"景县"},{' +
//'                            "name":"阜城县"},{' +
//'                            "name":"冀州市"},{' +
//'                            "name":"深州市"}]}]},{' +
//'            "name":"山西省","cities":[' +
//'                {' +
//'                    "name":"太原市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"小店区"},{' +
//'                            "name":"迎泽区"},{' +
//'                            "name":"杏花岭区"},{' +
//'                            "name":"尖草坪区"},{' +
//'                            "name":"万柏林区"},{' +
//'                            "name":"晋源区"},{' +
//'                            "name":"清徐县"},{' +
//'                            "name":"阳曲县"},{' +
//'                            "name":"娄烦县"},{' +
//'                            "name":"古交市"}]},{' +
//'                    "name":"大同市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城区"},{' +
//'                            "name":"矿区"},{' +
//'                            "name":"南郊区"},{' +
//'                            "name":"新荣区"},{' +
//'                            "name":"阳高县"},{' +
//'                            "name":"天镇县"},{' +
//'                            "name":"广灵县"},{' +
//'                            "name":"灵丘县"},{' +
//'                            "name":"浑源县"},{' +
//'                            "name":"左云县"},{' +
//'                            "name":"大同县"}]},{' +
//'                    "name":"阳泉市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城区"},{' +
//'                            "name":"矿区"},{' +
//'                            "name":"郊区"},{' +
//'                            "name":"平定县"},{' +
//'                            "name":"盂县"}]},{' +
//'                    "name":"长治市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城区"},{' +
//'                            "name":"郊区"},{' +
//'                            "name":"长治县"},{' +
//'                            "name":"襄垣县"},{' +
//'                            "name":"屯留县"},{' +
//'                            "name":"平顺县"},{' +
//'                            "name":"黎城县"},{' +
//'                            "name":"壶关县"},{' +
//'                            "name":"长子县"},{' +
//'                            "name":"武乡县"},{' +
//'                            "name":"沁县"},{' +
//'                            "name":"沁源县"},{' +
//'                            "name":"潞城市"}]},{' +
//'                    "name":"晋城市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城区"},{' +
//'                            "name":"沁水县"},{' +
//'                            "name":"阳城县"},{' +
//'                            "name":"陵川县"},{' +
//'                            "name":"泽州县"},{' +
//'                            "name":"高平市"}]},{' +
//'                    "name":"朔州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"朔城区"},{' +
//'                            "name":"平鲁区"},{' +
//'                            "name":"山阴县"},{' +
//'                            "name":"应县"},{' +
//'                            "name":"右玉县"},{' +
//'                            "name":"怀仁县"}]},{' +
//'                    "name":"晋中市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"榆次区"},{' +
//'                            "name":"榆社县"},{' +
//'                            "name":"左权县"},{' +
//'                            "name":"和顺县"},{' +
//'                            "name":"昔阳县"},{' +
//'                            "name":"寿阳县"},{' +
//'                            "name":"太谷县"},{' +
//'                            "name":"祁县"},{' +
//'                            "name":"平遥县"},{' +
//'                            "name":"灵石县"},{' +
//'                            "name":"介休市"}]},{' +
//'                    "name":"运城市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"盐湖区"},{' +
//'                            "name":"临猗县"},{' +
//'                            "name":"万荣县"},{' +
//'                            "name":"闻喜县"},{' +
//'                            "name":"稷山县"},{' +
//'                            "name":"新绛县"},{' +
//'                            "name":"绛县"},{' +
//'                            "name":"垣曲县"},{' +
//'                            "name":"夏县"},{' +
//'                            "name":"平陆县"},{' +
//'                            "name":"芮城县"},{' +
//'                            "name":"永济市"},{' +
//'                            "name":"河津市"}]},{' +
//'                    "name":"忻州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"忻府区"},{' +
//'                            "name":"定襄县"},{' +
//'                            "name":"五台县"},{' +
//'                            "name":"代县"},{' +
//'                            "name":"繁峙县"},{' +
//'                            "name":"宁武县"},{' +
//'                            "name":"静乐县"},{' +
//'                            "name":"神池县"},{' +
//'                            "name":"五寨县"},{' +
//'                            "name":"岢岚县"},{' +
//'                            "name":"河曲县"},{' +
//'                            "name":"保德县"},{' +
//'                            "name":"偏关县"},{' +
//'                            "name":"原平市"}]},{' +
//'                    "name":"临汾市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"尧都区"},{' +
//'                            "name":"曲沃县"},{' +
//'                            "name":"翼城县"},{' +
//'                            "name":"襄汾县"},{' +
//'                            "name":"洪洞县"},{' +
//'                            "name":"古县"},{' +
//'                            "name":"安泽县"},{' +
//'                            "name":"浮山县"},{' +
//'                            "name":"吉县"},{' +
//'                            "name":"乡宁县"},{' +
//'                            "name":"大宁县"},{' +
//'                            "name":"隰县"},{' +
//'                            "name":"永和县"},{' +
//'                            "name":"蒲县"},{' +
//'                            "name":"汾西县"},{' +
//'                            "name":"侯马市"},{' +
//'                            "name":"霍州市"}]},{' +
//'                    "name":"吕梁市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"离石区"},{' +
//'                            "name":"文水县"},{' +
//'                            "name":"交城县"},{' +
//'                            "name":"兴县"},{' +
//'                            "name":"临县"},{' +
//'                            "name":"柳林县"},{' +
//'                            "name":"石楼县"},{' +
//'                            "name":"岚县"},{' +
//'                            "name":"方山县"},{' +
//'                            "name":"中阳县"},{' +
//'                            "name":"交口县"},{' +
//'                            "name":"孝义市"},{' +
//'                            "name":"汾阳市"}]}]},{' +
//'            "name":"内蒙古自治区","cities":[' +
//'                {' +
//'                    "name":"呼和浩特市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"新城区"},{' +
//'                            "name":"回民区"},{' +
//'                            "name":"玉泉区"},{' +
//'                            "name":"赛罕区"},{' +
//'                            "name":"土默特左旗"},{' +
//'                            "name":"托克托县"},{' +
//'                            "name":"和林格尔县"},{' +
//'                            "name":"清水河县"},{' +
//'                            "name":"武川县"}]},{' +
//'                    "name":"包头市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东河区"},{' +
//'                            "name":"昆都仑区"},{' +
//'                            "name":"青山区"},{' +
//'                            "name":"石拐区"},{' +
//'                            "name":"白云矿区"},{' +
//'                            "name":"九原区"},{' +
//'                            "name":"土默特右旗"},{' +
//'                            "name":"固阳县"},{' +
//'                            "name":"达尔罕茂明安联合旗"}]},{' +
//'                    "name":"乌海市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"海勃湾区"},{' +
//'                            "name":"海南区"},{' +
//'                            "name":"乌达区"}]},{' +
//'                    "name":"赤峰市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"红山区"},{' +
//'                            "name":"元宝山区"},{' +
//'                            "name":"松山区"},{' +
//'                            "name":"阿鲁科尔沁旗"},{' +
//'                            "name":"巴林左旗"},{' +
//'                            "name":"巴林右旗"},{' +
//'                            "name":"林西县"},{' +
//'                            "name":"克什克腾旗"},{' +
//'                            "name":"翁牛特旗"},{' +
//'                            "name":"喀喇沁旗"},{' +
//'                            "name":"宁城县"},{' +
//'                            "name":"敖汉旗"}]},{' +
//'                    "name":"通辽市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"科尔沁区"},{' +
//'                            "name":"科尔沁左翼中旗"},{' +
//'                            "name":"科尔沁左翼后旗"},{' +
//'                            "name":"开鲁县"},{' +
//'                            "name":"库伦旗"},{' +
//'                            "name":"奈曼旗"},{' +
//'                            "name":"扎鲁特旗"},{' +
//'                            "name":"霍林郭勒市"}]},{' +
//'                    "name":"鄂尔多斯市","counties":[' +
//'                        {' +
//'                            "name":"东胜区"},{' +
//'                            "name":"达拉特旗"},{' +
//'                            "name":"准格尔旗"},{' +
//'                            "name":"鄂托克前旗"},{' +
//'                            "name":"鄂托克旗"},{' +
//'                            "name":"杭锦旗"},{' +
//'                            "name":"乌审旗"},{' +
//'                            "name":"伊金霍洛旗"}]},{' +
//'                    "name":"呼伦贝尔市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"海拉尔区"},{' +
//'                            "name":"阿荣旗"},{' +
//'                            "name":"莫力达瓦达斡尔族自治旗"},{' +
//'                            "name":"鄂伦春自治旗"},{' +
//'                            "name":"鄂温克族自治旗"},{' +
//'                            "name":"陈巴尔虎旗"},{' +
//'                            "name":"新巴尔虎左旗"},{' +
//'                            "name":"新巴尔虎右旗"},{' +
//'                            "name":"满洲里市"},{' +
//'                            "name":"牙克石市"},{' +
//'                            "name":"扎兰屯市"},{' +
//'                            "name":"额尔古纳市"},{' +
//'                            "name":"根河市"}]},{' +
//'                    "name":"巴彦淖尔市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"临河区"},{' +
//'                            "name":"五原县"},{' +
//'                            "name":"磴口县"},{' +
//'                            "name":"乌拉特前旗"},{' +
//'                            "name":"乌拉特中旗"},{' +
//'                            "name":"乌拉特后旗"},{' +
//'                            "name":"杭锦后旗"}]},{' +
//'                    "name":"乌兰察布市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"集宁区"},{' +
//'                            "name":"卓资县"},{' +
//'                            "name":"化德县"},{' +
//'                            "name":"商都县"},{' +
//'                            "name":"兴和县"},{' +
//'                            "name":"凉城县"},{' +
//'                            "name":"察哈尔右翼前旗"},{' +
//'                            "name":"察哈尔右翼中旗"},{' +
//'                            "name":"察哈尔右翼后旗"},{' +
//'                            "name":"四子王旗"},{' +
//'                            "name":"丰镇市"}]},{' +
//'                    "name":"兴安盟","counties":[' +
//'                        {' +
//'                            "name":"乌兰浩特市"},{' +
//'                            "name":"阿尔山市"},{' +
//'                            "name":"科尔沁右翼前旗"},{' +
//'                            "name":"科尔沁右翼中旗"},{' +
//'                            "name":"扎赉特旗"},{' +
//'                            "name":"突泉县"}]},{' +
//'                    "name":"锡林郭勒盟","counties":[' +
//'                        {' +
//'                            "name":"二连浩特市"},{' +
//'                            "name":"锡林浩特市"},{' +
//'                            "name":"阿巴嘎旗"},{' +
//'                            "name":"苏尼特左旗"},{' +
//'                            "name":"苏尼特右旗"},{' +
//'                            "name":"东乌珠穆沁旗"},{' +
//'                            "name":"西乌珠穆沁旗"},{' +
//'                            "name":"太仆寺旗"},{' +
//'                            "name":"镶黄旗"},{' +
//'                            "name":"正镶白旗"},{' +
//'                            "name":"正蓝旗"},{' +
//'                            "name":"多伦县"}]},{' +
//'                    "name":"阿拉善盟","counties":[' +
//'                        {' +
//'                            "name":"阿拉善左旗"},{' +
//'                            "name":"阿拉善右旗"},{' +
//'                            "name":"额济纳旗"}]}]},{' +
//'            "name":"辽宁省","cities":[' +
//'                {' +
//'                    "name":"沈阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"和平区"},{' +
//'                            "name":"沈河区"},{' +
//'                            "name":"大东区"},{' +
//'                            "name":"皇姑区"},{' +
//'                            "name":"铁西区"},{' +
//'                            "name":"苏家屯区"},{' +
//'                            "name":"东陵区"},{' +
//'                            "name":"新城子区"},{' +
//'                            "name":"于洪区"},{' +
//'                            "name":"辽中县"},{' +
//'                            "name":"康平县"},{' +
//'                            "name":"法库县"},{' +
//'                            "name":"新民市"}]},{' +
//'                    "name":"大连市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"中山区"},{' +
//'                            "name":"西岗区"},{' +
//'                            "name":"沙河口区"},{' +
//'                            "name":"甘井子区"},{' +
//'                            "name":"旅顺口区"},{' +
//'                            "name":"金州区"},{' +
//'                            "name":"长海县"},{' +
//'                            "name":"瓦房店市"},{' +
//'                            "name":"普兰店市"},{' +
//'                            "name":"庄河市"}]},{' +
//'                    "name":"鞍山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"铁东区"},{' +
//'                            "name":"铁西区"},{' +
//'                            "name":"立山区"},{' +
//'                            "name":"千山区"},{' +
//'                            "name":"台安县"},{' +
//'                            "name":"岫岩满族自治县"},{' +
//'                            "name":"海城市"}]},{' +
//'                    "name":"抚顺市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"新抚区"},{' +
//'                            "name":"东洲区"},{' +
//'                            "name":"望花区"},{' +
//'                            "name":"顺城区"},{' +
//'                            "name":"抚顺县"},{' +
//'                            "name":"新宾满族自治县"},{' +
//'                            "name":"清原满族自治县"}]},{' +
//'                    "name":"本溪市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"平山区"},{' +
//'                            "name":"溪湖区"},{' +
//'                            "name":"明山区"},{' +
//'                            "name":"南芬区"},{' +
//'                            "name":"本溪满族自治县"},{' +
//'                            "name":"桓仁满族自治县"}]},{' +
//'                    "name":"丹东市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"元宝区"},{' +
//'                            "name":"振兴区"},{' +
//'                            "name":"振安区"},{' +
//'                            "name":"宽甸满族自治县"},{' +
//'                            "name":"东港市"},{' +
//'                            "name":"凤城市"}]},{' +
//'                    "name":"锦州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"古塔区"},{' +
//'                            "name":"凌河区"},{' +
//'                            "name":"太和区"},{' +
//'                            "name":"黑山县"},{' +
//'                            "name":"义县"},{' +
//'                            "name":"凌海市"},{' +
//'                            "name":"北宁市"}]},{' +
//'                    "name":"营口市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"站前区"},{' +
//'                            "name":"西市区"},{' +
//'                            "name":"鲅鱼圈区"},{' +
//'                            "name":"老边区"},{' +
//'                            "name":"盖州市"},{' +
//'                            "name":"大石桥市"}]},{' +
//'                    "name":"阜新市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"海州区"},{' +
//'                            "name":"新邱区"},{' +
//'                            "name":"太平区"},{' +
//'                            "name":"清河门区"},{' +
//'                            "name":"细河区"},{' +
//'                            "name":"阜新蒙古族自治县"},{' +
//'                            "name":"彰武县"}]},{' +
//'                    "name":"辽阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"白塔区"},{' +
//'                            "name":"文圣区"},{' +
//'                            "name":"宏伟区"},{' +
//'                            "name":"弓长岭区"},{' +
//'                            "name":"太子河区"},{' +
//'                            "name":"辽阳县"},{' +
//'                            "name":"灯塔市"}]},{' +
//'                    "name":"盘锦市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"双台子区"},{' +
//'                            "name":"兴隆台区"},{' +
//'                            "name":"大洼县"},{' +
//'                            "name":"盘山县"}]},{' +
//'                    "name":"铁岭市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"银州区"},{' +
//'                            "name":"清河区"},{' +
//'                            "name":"铁岭县"},{' +
//'                            "name":"西丰县"},{' +
//'                            "name":"昌图县"},{' +
//'                            "name":"调兵山市"},{' +
//'                            "name":"开原市"}]},{' +
//'                    "name":"朝阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"双塔区"},{' +
//'                            "name":"龙城区"},{' +
//'                            "name":"朝阳县"},{' +
//'                            "name":"建平县"},{' +
//'                            "name":"喀喇沁左翼蒙古族自治县"},{' +
//'                            "name":"北票市"},{' +
//'                            "name":"凌源市"}]},{' +
//'                    "name":"葫芦岛市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"连山区"},{' +
//'                            "name":"龙港区"},{' +
//'                            "name":"南票区"},{' +
//'                            "name":"绥中县"},{' +
//'                            "name":"建昌县"},{' +
//'                            "name":"兴城市"}]}]},{' +
//'            "name":"吉林省","cities":[' +
//'                {' +
//'                    "name":"长春市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"南关区"},{' +
//'                            "name":"宽城区"},{' +
//'                            "name":"朝阳区"},{' +
//'                            "name":"二道区"},{' +
//'                            "name":"绿园区"},{' +
//'                            "name":"双阳区"},{' +
//'                            "name":"农安县"},{' +
//'                            "name":"九台市"},{' +
//'                            "name":"榆树市"},{' +
//'                            "name":"德惠市"}]},{' +
//'                    "name":"吉林市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"昌邑区"},{' +
//'                            "name":"龙潭区"},{' +
//'                            "name":"船营区"},{' +
//'                            "name":"丰满区"},{' +
//'                            "name":"永吉县"},{' +
//'                            "name":"蛟河市"},{' +
//'                            "name":"桦甸市"},{' +
//'                            "name":"舒兰市"},{' +
//'                            "name":"磐石市"}]},{' +
//'                    "name":"四平市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"铁西区"},{' +
//'                            "name":"铁东区"},{' +
//'                            "name":"梨树县"},{' +
//'                            "name":"伊通满族自治县"},{' +
//'                            "name":"公主岭市"},{' +
//'                            "name":"双辽市"}]},{' +
//'                    "name":"辽源市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"龙山区"},{' +
//'                            "name":"西安区"},{' +
//'                            "name":"东丰县"},{' +
//'                            "name":"东辽县"}]},{' +
//'                    "name":"通化市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东昌区"},{' +
//'                            "name":"二道江区"},{' +
//'                            "name":"通化县"},{' +
//'                            "name":"辉南县"},{' +
//'                            "name":"柳河县"},{' +
//'                            "name":"梅河口市"},{' +
//'                            "name":"集安市"}]},{' +
//'                    "name":"白山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"八道江区"},{' +
//'                            "name":"抚松县"},{' +
//'                            "name":"靖宇县"},{' +
//'                            "name":"长白朝鲜族自治县"},{' +
//'                            "name":"江源县"},{' +
//'                            "name":"临江市"}]},{' +
//'                    "name":"松原市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"宁江区"},{' +
//'                            "name":"前郭尔罗斯蒙古族自治县"},{' +
//'                            "name":"长岭县"},{' +
//'                            "name":"乾安县"},{' +
//'                            "name":"扶余县"}]},{' +
//'                    "name":"白城市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"洮北区"},{' +
//'                            "name":"镇赉县"},{' +
//'                            "name":"通榆县"},{' +
//'                            "name":"洮南市"},{' +
//'                            "name":"大安市"}]},{' +
//'                    "name":"延边朝鲜族自治州","counties":[' +
//'                        {' +
//'                            "name":"延吉市"},{' +
//'                            "name":"图们市"},{' +
//'                            "name":"敦化市"},{' +
//'                            "name":"珲春市"},{' +
//'                            "name":"龙井市"},{' +
//'                            "name":"和龙市"},{' +
//'                            "name":"汪清县"},{' +
//'                            "name":"安图县"}]}]},{' +
//'            "name":"黑龙江省","cities":[' +
//'                {' +
//'                    "name":"哈尔滨市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"道里区"},{' +
//'                            "name":"南岗区"},{' +
//'                            "name":"道外区"},{' +
//'                            "name":"香坊区"},{' +
//'                            "name":"动力区"},{' +
//'                            "name":"平房区"},{' +
//'                            "name":"松北区"},{' +
//'                            "name":"呼兰区"},{' +
//'                            "name":"依兰县"},{' +
//'                            "name":"方正县"},{' +
//'                            "name":"宾县"},{' +
//'                            "name":"巴彦县"},{' +
//'                            "name":"木兰县"},{' +
//'                            "name":"通河县"},{' +
//'                            "name":"延寿县"},{' +
//'                            "name":"阿城市"},{' +
//'                            "name":"双城市"},{' +
//'                            "name":"尚志市"},{' +
//'                            "name":"五常市"}]},{' +
//'                    "name":"齐齐哈尔市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"龙沙区"},{' +
//'                            "name":"建华区"},{' +
//'                            "name":"铁锋区"},{' +
//'                            "name":"昂昂溪区"},{' +
//'                            "name":"富拉尔基区"},{' +
//'                            "name":"碾子山区"},{' +
//'                            "name":"梅里斯达斡尔族区"},{' +
//'                            "name":"龙江县"},{' +
//'                            "name":"依安县"},{' +
//'                            "name":"泰来县"},{' +
//'                            "name":"甘南县"},{' +
//'                            "name":"富裕县"},{' +
//'                            "name":"克山县"},{' +
//'                            "name":"克东县"},{' +
//'                            "name":"拜泉县"},{' +
//'                            "name":"讷河市"}]},{' +
//'                    "name":"鸡西市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"鸡冠区"},{' +
//'                            "name":"恒山区"},{' +
//'                            "name":"滴道区"},{' +
//'                            "name":"梨树区"},{' +
//'                            "name":"城子河区"},{' +
//'                            "name":"麻山区"},{' +
//'                            "name":"鸡东县"},{' +
//'                            "name":"虎林市"},{' +
//'                            "name":"密山市"}]},{' +
//'                    "name":"鹤岗市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"向阳区"},{' +
//'                            "name":"工农区"},{' +
//'                            "name":"南山区"},{' +
//'                            "name":"兴安区"},{' +
//'                            "name":"东山区"},{' +
//'                            "name":"兴山区"},{' +
//'                            "name":"萝北县"},{' +
//'                            "name":"绥滨县"}]},{' +
//'                    "name":"双鸭山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"尖山区"},{' +
//'                            "name":"岭东区"},{' +
//'                            "name":"四方台区"},{' +
//'                            "name":"宝山区"},{' +
//'                            "name":"集贤县"},{' +
//'                            "name":"友谊县"},{' +
//'                            "name":"宝清县"},{' +
//'                            "name":"饶河县"}]},{' +
//'                    "name":"大庆市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"萨尔图区"},{' +
//'                            "name":"龙凤区"},{' +
//'                            "name":"让胡路区"},{' +
//'                            "name":"红岗区"},{' +
//'                            "name":"大同区"},{' +
//'                            "name":"肇州县"},{' +
//'                            "name":"肇源县"},{' +
//'                            "name":"林甸县"},{' +
//'                            "name":"杜尔伯特蒙古族自治县"}]},{' +
//'                    "name":"伊春市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"伊春区"},{' +
//'                            "name":"南岔区"},{' +
//'                            "name":"友好区"},{' +
//'                            "name":"西林区"},{' +
//'                            "name":"翠峦区"},{' +
//'                            "name":"新青区"},{' +
//'                            "name":"美溪区"},{' +
//'                            "name":"金山屯区"},{' +
//'                            "name":"五营区"},{' +
//'                            "name":"乌马河区"},{' +
//'                            "name":"汤旺河区"},{' +
//'                            "name":"带岭区"},{' +
//'                            "name":"乌伊岭区"},{' +
//'                            "name":"红星区"},{' +
//'                            "name":"上甘岭区"},{' +
//'                            "name":"嘉荫县"},{' +
//'                            "name":"铁力市"}]},{' +
//'                    "name":"佳木斯市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"永红区"},{' +
//'                            "name":"向阳区"},{' +
//'                            "name":"前进区"},{' +
//'                            "name":"东风区"},{' +
//'                            "name":"郊区"},{' +
//'                            "name":"桦南县"},{' +
//'                            "name":"桦川县"},{' +
//'                            "name":"汤原县"},{' +
//'                            "name":"抚远县"},{' +
//'                            "name":"同江市"},{' +
//'                            "name":"富锦市"}]},{' +
//'                    "name":"七台河市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"新兴区"},{' +
//'                            "name":"桃山区"},{' +
//'                            "name":"茄子河区"},{' +
//'                            "name":"勃利县"}]},{' +
//'                    "name":"牡丹江市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东安区"},{' +
//'                            "name":"阳明区"},{' +
//'                            "name":"爱民区"},{' +
//'                            "name":"西安区"},{' +
//'                            "name":"东宁县"},{' +
//'                            "name":"林口县"},{' +
//'                            "name":"绥芬河市"},{' +
//'                            "name":"海林市"},{' +
//'                            "name":"宁安市"},{' +
//'                            "name":"穆棱市"}]},{' +
//'                    "name":"黑河市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"爱辉区"},{' +
//'                            "name":"嫩江县"},{' +
//'                            "name":"逊克县"},{' +
//'                            "name":"孙吴县"},{' +
//'                            "name":"北安市"},{' +
//'                            "name":"五大连池市"}]},{' +
//'                    "name":"绥化市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"北林区"},{' +
//'                            "name":"望奎县"},{' +
//'                            "name":"兰西县"},{' +
//'                            "name":"青冈县"},{' +
//'                            "name":"庆安县"},{' +
//'                            "name":"明水县"},{' +
//'                            "name":"绥棱县"},{' +
//'                            "name":"安达市"},{' +
//'                            "name":"肇东市"},{' +
//'                            "name":"海伦市"}]},{' +
//'                    "name":"大兴安岭地区","counties":[' +
//'                        {' +
//'                            "name":"呼玛县"},{' +
//'                            "name":"塔河县"},{' +
//'                            "name":"漠河县"}]}]},{' +
//'            "name":"江苏省","cities":[' +
//'                {' +
//'                    "name":"南京市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"玄武区"},{' +
//'                            "name":"白下区"},{' +
//'                            "name":"秦淮区"},{' +
//'                            "name":"建邺区"},{' +
//'                            "name":"鼓楼区"},{' +
//'                            "name":"下关区"},{' +
//'                            "name":"浦口区"},{' +
//'                            "name":"栖霞区"},{' +
//'                            "name":"雨花台区"},{' +
//'                            "name":"江宁区"},{' +
//'                            "name":"六合区"},{' +
//'                            "name":"溧水县"},{' +
//'                            "name":"高淳县"}]},{' +
//'                    "name":"无锡市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"崇安区"},{' +
//'                            "name":"南长区"},{' +
//'                            "name":"北塘区"},{' +
//'                            "name":"锡山区"},{' +
//'                            "name":"惠山区"},{' +
//'                            "name":"滨湖区"},{' +
//'                            "name":"江阴市"},{' +
//'                            "name":"宜兴市"}]},{' +
//'                    "name":"徐州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"鼓楼区"},{' +
//'                            "name":"云龙区"},{' +
//'                            "name":"九里区"},{' +
//'                            "name":"贾汪区"},{' +
//'                            "name":"泉山区"},{' +
//'                            "name":"丰县"},{' +
//'                            "name":"沛县"},{' +
//'                            "name":"铜山县"},{' +
//'                            "name":"睢宁县"},{' +
//'                            "name":"新沂市"},{' +
//'                            "name":"邳州市"}]},{' +
//'                    "name":"常州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"天宁区"},{' +
//'                            "name":"钟楼区"},{' +
//'                            "name":"戚墅堰区"},{' +
//'                            "name":"新北区"},{' +
//'                            "name":"武进区"},{' +
//'                            "name":"溧阳市"},{' +
//'                            "name":"金坛市"}]},{' +
//'                    "name":"苏州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"沧浪区"},{' +
//'                            "name":"平江区"},{' +
//'                            "name":"金阊区"},{' +
//'                            "name":"虎丘区"},{' +
//'                            "name":"吴中区"},{' +
//'                            "name":"相城区"},{' +
//'                            "name":"常熟市"},{' +
//'                            "name":"张家港市"},{' +
//'                            "name":"昆山市"},{' +
//'                            "name":"吴江市"},{' +
//'                            "name":"太仓市"}]},{' +
//'                    "name":"南通市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"崇川区"},{' +
//'                            "name":"港闸区"},{' +
//'                            "name":"海安县"},{' +
//'                            "name":"如东县"},{' +
//'                            "name":"启东市"},{' +
//'                            "name":"如皋市"},{' +
//'                            "name":"通州市"},{' +
//'                            "name":"海门市"}]},{' +
//'                    "name":"连云港市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"连云区"},{' +
//'                            "name":"新浦区"},{' +
//'                            "name":"海州区"},{' +
//'                            "name":"赣榆县"},{' +
//'                            "name":"东海县"},{' +
//'                            "name":"灌云县"},{' +
//'                            "name":"灌南县"}]},{' +
//'                    "name":"淮安市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"清河区"},{' +
//'                            "name":"楚州区"},{' +
//'                            "name":"淮阴区"},{' +
//'                            "name":"清浦区"},{' +
//'                            "name":"涟水县"},{' +
//'                            "name":"洪泽县"},{' +
//'                            "name":"盱眙县"},{' +
//'                            "name":"金湖县"}]},{' +
//'                    "name":"盐城市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"亭湖区"},{' +
//'                            "name":"盐都区"},{' +
//'                            "name":"响水县"},{' +
//'                            "name":"滨海县"},{' +
//'                            "name":"阜宁县"},{' +
//'                            "name":"射阳县"},{' +
//'                            "name":"建湖县"},{' +
//'                            "name":"东台市"},{' +
//'                            "name":"大丰市"}]},{' +
//'                    "name":"扬州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"广陵区"},{' +
//'                            "name":"邗江区"},{' +
//'                            "name":"郊区"},{' +
//'                            "name":"宝应县"},{' +
//'                            "name":"仪征市"},{' +
//'                            "name":"高邮市"},{' +
//'                            "name":"江都市"}]},{' +
//'                    "name":"镇江市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"京口区"},{' +
//'                            "name":"润州区"},{' +
//'                            "name":"丹徒区"},{' +
//'                            "name":"丹阳市"},{' +
//'                            "name":"扬中市"},{' +
//'                            "name":"句容市"}]},{' +
//'                    "name":"泰州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"海陵区"},{' +
//'                            "name":"高港区"},{' +
//'                            "name":"兴化市"},{' +
//'                            "name":"靖江市"},{' +
//'                            "name":"泰兴市"},{' +
//'                            "name":"姜堰市"}]},{' +
//'                    "name":"宿迁市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"宿城区"},{' +
//'                            "name":"宿豫区"},{' +
//'                            "name":"沭阳县"},{' +
//'                            "name":"泗阳县"},{' +
//'                            "name":"泗洪县"}]}]},{' +
//'            "name":"浙江省","cities":[' +
//'                {' +
//'                    "name":"杭州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"上城区"},{' +
//'                            "name":"下城区"},{' +
//'                            "name":"江干区"},{' +
//'                            "name":"拱墅区"},{' +
//'                            "name":"西湖区"},{' +
//'                            "name":"滨江区"},{' +
//'                            "name":"萧山区"},{' +
//'                            "name":"余杭区"},{' +
//'                            "name":"桐庐县"},{' +
//'                            "name":"淳安县"},{' +
//'                            "name":"建德市"},{' +
//'                            "name":"富阳市"},{' +
//'                            "name":"临安市"}]},{' +
//'                    "name":"宁波市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"海曙区"},{' +
//'                            "name":"江东区"},{' +
//'                            "name":"江北区"},{' +
//'                            "name":"北仑区"},{' +
//'                            "name":"镇海区"},{' +
//'                            "name":"鄞州区"},{' +
//'                            "name":"象山县"},{' +
//'                            "name":"宁海县"},{' +
//'                            "name":"余姚市"},{' +
//'                            "name":"慈溪市"},{' +
//'                            "name":"奉化市"}]},{' +
//'                    "name":"温州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"鹿城区"},{' +
//'                            "name":"龙湾区"},{' +
//'                            "name":"瓯海区"},{' +
//'                            "name":"洞头县"},{' +
//'                            "name":"永嘉县"},{' +
//'                            "name":"平阳县"},{' +
//'                            "name":"苍南县"},{' +
//'                            "name":"文成县"},{' +
//'                            "name":"泰顺县"},{' +
//'                            "name":"瑞安市"},{' +
//'                            "name":"乐清市"}]},{' +
//'                    "name":"嘉兴市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"秀城区"},{' +
//'                            "name":"秀洲区"},{' +
//'                            "name":"嘉善县"},{' +
//'                            "name":"海盐县"},{' +
//'                            "name":"海宁市"},{' +
//'                            "name":"平湖市"},{' +
//'                            "name":"桐乡市"}]},{' +
//'                    "name":"湖州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"吴兴区"},{' +
//'                            "name":"南浔区"},{' +
//'                            "name":"德清县"},{' +
//'                            "name":"长兴县"},{' +
//'                            "name":"安吉县"}]},{' +
//'                    "name":"绍兴市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"越城区"},{' +
//'                            "name":"绍兴县"},{' +
//'                            "name":"新昌县"},{' +
//'                            "name":"诸暨市"},{' +
//'                            "name":"上虞市"},{' +
//'                            "name":"嵊州市"}]},{' +
//'                    "name":"金华市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"婺城区"},{' +
//'                            "name":"金东区"},{' +
//'                            "name":"武义县"},{' +
//'                            "name":"浦江县"},{' +
//'                            "name":"磐安县"},{' +
//'                            "name":"兰溪市"},{' +
//'                            "name":"义乌市"},{' +
//'                            "name":"东阳市"},{' +
//'                            "name":"永康市"}]},{' +
//'                    "name":"衢州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"柯城区"},{' +
//'                            "name":"衢江区"},{' +
//'                            "name":"常山县"},{' +
//'                            "name":"开化县"},{' +
//'                            "name":"龙游县"},{' +
//'                            "name":"江山市"}]},{' +
//'                    "name":"舟山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"定海区"},{' +
//'                            "name":"普陀区"},{' +
//'                            "name":"岱山县"},{' +
//'                            "name":"嵊泗县"}]},{' +
//'                    "name":"台州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"椒江区"},{' +
//'                            "name":"黄岩区"},{' +
//'                            "name":"路桥区"},{' +
//'                            "name":"玉环县"},{' +
//'                            "name":"三门县"},{' +
//'                            "name":"天台县"},{' +
//'                            "name":"仙居县"},{' +
//'                            "name":"温岭市"},{' +
//'                            "name":"临海市"}]},{' +
//'                    "name":"丽水市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"莲都区"},{' +
//'                            "name":"青田县"},{' +
//'                            "name":"缙云县"},{' +
//'                            "name":"遂昌县"},{' +
//'                            "name":"松阳县"},{' +
//'                            "name":"云和县"},{' +
//'                            "name":"庆元县"},{' +
//'                            "name":"景宁畲族自治县"},{' +
//'                            "name":"龙泉市"}]}]},{' +
//'            "name":"安徽省","cities":[' +
//'                {' +
//'                    "name":"合肥市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"瑶海区"},{' +
//'                            "name":"庐阳区"},{' +
//'                            "name":"蜀山区"},{' +
//'                            "name":"包河区"},{' +
//'                            "name":"长丰县"},{' +
//'                            "name":"肥东县"},{' +
//'                            "name":"肥西县"}]},{' +
//'                    "name":"芜湖市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"镜湖区"},{' +
//'                            "name":"马塘区"},{' +
//'                            "name":"新芜区"},{' +
//'                            "name":"鸠江区"},{' +
//'                            "name":"芜湖县"},{' +
//'                            "name":"繁昌县"},{' +
//'                            "name":"南陵县"}]},{' +
//'                    "name":"蚌埠市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"龙子湖区"},{' +
//'                            "name":"蚌山区"},{' +
//'                            "name":"禹会区"},{' +
//'                            "name":"淮上区"},{' +
//'                            "name":"怀远县"},{' +
//'                            "name":"五河县"},{' +
//'                            "name":"固镇县"}]},{' +
//'                    "name":"淮南市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"大通区"},{' +
//'                            "name":"田家庵区"},{' +
//'                            "name":"谢家集区"},{' +
//'                            "name":"八公山区"},{' +
//'                            "name":"潘集区"},{' +
//'                            "name":"凤台县"}]},{' +
//'                    "name":"马鞍山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"金家庄区"},{' +
//'                            "name":"花山区"},{' +
//'                            "name":"雨山区"},{' +
//'                            "name":"当涂县"}]},{' +
//'                    "name":"淮北市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"杜集区"},{' +
//'                            "name":"相山区"},{' +
//'                            "name":"烈山区"},{' +
//'                            "name":"濉溪县"}]},{' +
//'                    "name":"铜陵市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"铜官山区"},{' +
//'                            "name":"狮子山区"},{' +
//'                            "name":"郊区"},{' +
//'                            "name":"铜陵县"}]},{' +
//'                    "name":"安庆市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"迎江区"},{' +
//'                            "name":"大观区"},{' +
//'                            "name":"郊区"},{' +
//'                            "name":"怀宁县"},{' +
//'                            "name":"枞阳县"},{' +
//'                            "name":"潜山县"},{' +
//'                            "name":"太湖县"},{' +
//'                            "name":"宿松县"},{' +
//'                            "name":"望江县"},{' +
//'                            "name":"岳西县"},{' +
//'                            "name":"桐城市"}]},{' +
//'                    "name":"黄山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"屯溪区"},{' +
//'                            "name":"黄山区"},{' +
//'                            "name":"徽州区"},{' +
//'                            "name":"歙县"},{' +
//'                            "name":"休宁县"},{' +
//'                            "name":"黟县"},{' +
//'                            "name":"祁门县"}]},{' +
//'                    "name":"滁州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"琅琊区"},{' +
//'                            "name":"南谯区"},{' +
//'                            "name":"来安县"},{' +
//'                            "name":"全椒县"},{' +
//'                            "name":"定远县"},{' +
//'                            "name":"凤阳县"},{' +
//'                            "name":"天长市"},{' +
//'                            "name":"明光市"}]},{' +
//'                    "name":"阜阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"颍州区"},{' +
//'                            "name":"颍东区"},{' +
//'                            "name":"颍泉区"},{' +
//'                            "name":"临泉县"},{' +
//'                            "name":"太和县"},{' +
//'                            "name":"阜南县"},{' +
//'                            "name":"颍上县"},{' +
//'                            "name":"界首市"}]},{' +
//'                    "name":"宿州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"墉桥区"},{' +
//'                            "name":"砀山县"},{' +
//'                            "name":"萧县"},{' +
//'                            "name":"灵璧县"},{' +
//'                            "name":"泗县"}]},{' +
//'                    "name":"巢湖市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"居巢区"},{' +
//'                            "name":"庐江县"},{' +
//'                            "name":"无为县"},{' +
//'                            "name":"含山县"},{' +
//'                            "name":"和县"}]},{' +
//'                    "name":"六安市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"金安区"},{' +
//'                            "name":"裕安区"},{' +
//'                            "name":"寿县"},{' +
//'                            "name":"霍邱县"},{' +
//'                            "name":"舒城县"},{' +
//'                            "name":"金寨县"},{' +
//'                            "name":"霍山县"}]},{' +
//'                    "name":"亳州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"谯城区"},{' +
//'                            "name":"涡阳县"},{' +
//'                            "name":"蒙城县"},{' +
//'                            "name":"利辛县"}]},{' +
//'                    "name":"池州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"贵池区"},{' +
//'                            "name":"东至县"},{' +
//'                            "name":"石台县"},{' +
//'                            "name":"青阳县"}]},{' +
//'                    "name":"宣城市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"宣州区"},{' +
//'                            "name":"郎溪县"},{' +
//'                            "name":"广德县"},{' +
//'                            "name":"泾县"},{' +
//'                            "name":"绩溪县"},{' +
//'                            "name":"旌德县"},{' +
//'                            "name":"宁国市"}]}]},{' +
//'            "name":"福建省","cities":[' +
//'                {' +
//'                    "name":"福州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"鼓楼区"},{' +
//'                            "name":"台江区"},{' +
//'                            "name":"仓山区"},{' +
//'                            "name":"马尾区"},{' +
//'                            "name":"晋安区"},{' +
//'                            "name":"闽侯县"},{' +
//'                            "name":"连江县"},{' +
//'                            "name":"罗源县"},{' +
//'                            "name":"闽清县"},{' +
//'                            "name":"永泰县"},{' +
//'                            "name":"平潭县"},{' +
//'                            "name":"福清市"},{' +
//'                            "name":"长乐市"}]},{' +
//'                    "name":"厦门市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"思明区"},{' +
//'                            "name":"海沧区"},{' +
//'                            "name":"湖里区"},{' +
//'                            "name":"集美区"},{' +
//'                            "name":"同安区"},{' +
//'                            "name":"翔安区"}]},{' +
//'                    "name":"莆田市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城厢区"},{' +
//'                            "name":"涵江区"},{' +
//'                            "name":"荔城区"},{' +
//'                            "name":"秀屿区"},{' +
//'                            "name":"仙游县"}]},{' +
//'                    "name":"三明市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"梅列区"},{' +
//'                            "name":"三元区"},{' +
//'                            "name":"明溪县"},{' +
//'                            "name":"清流县"},{' +
//'                            "name":"宁化县"},{' +
//'                            "name":"大田县"},{' +
//'                            "name":"尤溪县"},{' +
//'                            "name":"沙县"},{' +
//'                            "name":"将乐县"},{' +
//'                            "name":"泰宁县"},{' +
//'                            "name":"建宁县"},{' +
//'                            "name":"永安市"}]},{' +
//'                    "name":"泉州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"鲤城区"},{' +
//'                            "name":"丰泽区"},{' +
//'                            "name":"洛江区"},{' +
//'                            "name":"泉港区"},{' +
//'                            "name":"惠安县"},{' +
//'                            "name":"安溪县"},{' +
//'                            "name":"永春县"},{' +
//'                            "name":"德化县"},{' +
//'                            "name":"金门县"},{' +
//'                            "name":"石狮市"},{' +
//'                            "name":"晋江市"},{' +
//'                            "name":"南安市"}]},{' +
//'                    "name":"漳州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"芗城区"},{' +
//'                            "name":"龙文区"},{' +
//'                            "name":"云霄县"},{' +
//'                            "name":"漳浦县"},{' +
//'                            "name":"诏安县"},{' +
//'                            "name":"长泰县"},{' +
//'                            "name":"东山县"},{' +
//'                            "name":"南靖县"},{' +
//'                            "name":"平和县"},{' +
//'                            "name":"华安县"},{' +
//'                            "name":"龙海市"}]},{' +
//'                    "name":"南平市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"延平区"},{' +
//'                            "name":"顺昌县"},{' +
//'                            "name":"浦城县"},{' +
//'                            "name":"光泽县"},{' +
//'                            "name":"松溪县"},{' +
//'                            "name":"政和县"},{' +
//'                            "name":"邵武市"},{' +
//'                            "name":"武夷山市"},{' +
//'                            "name":"建瓯市"},{' +
//'                            "name":"建阳市"}]},{' +
//'                    "name":"龙岩市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"新罗区"},{' +
//'                            "name":"长汀县"},{' +
//'                            "name":"永定县"},{' +
//'                            "name":"上杭县"},{' +
//'                            "name":"武平县"},{' +
//'                            "name":"连城县"},{' +
//'                            "name":"漳平市"}]},{' +
//'                    "name":"宁德市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"蕉城区"},{' +
//'                            "name":"霞浦县"},{' +
//'                            "name":"古田县"},{' +
//'                            "name":"屏南县"},{' +
//'                            "name":"寿宁县"},{' +
//'                            "name":"周宁县"},{' +
//'                            "name":"柘荣县"},{' +
//'                            "name":"福安市"},{' +
//'                            "name":"福鼎市"}]}]},{' +
//'            "name":"江西省","cities":[' +
//'                {' +
//'                    "name":"南昌市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东湖区"},{' +
//'                            "name":"西湖区"},{' +
//'                            "name":"青云谱区"},{' +
//'                            "name":"湾里区"},{' +
//'                            "name":"青山湖区"},{' +
//'                            "name":"南昌县"},{' +
//'                            "name":"新建县"},{' +
//'                            "name":"安义县"},{' +
//'                            "name":"进贤县"}]},{' +
//'                    "name":"景德镇市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"昌江区"},{' +
//'                            "name":"珠山区"},{' +
//'                            "name":"浮梁县"},{' +
//'                            "name":"乐平市"}]},{' +
//'                    "name":"萍乡市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"安源区"},{' +
//'                            "name":"湘东区"},{' +
//'                            "name":"莲花县"},{' +
//'                            "name":"上栗县"},{' +
//'                            "name":"芦溪县"}]},{' +
//'                    "name":"九江市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"庐山区"},{' +
//'                            "name":"浔阳区"},{' +
//'                            "name":"九江县"},{' +
//'                            "name":"武宁县"},{' +
//'                            "name":"修水县"},{' +
//'                            "name":"永修县"},{' +
//'                            "name":"德安县"},{' +
//'                            "name":"星子县"},{' +
//'                            "name":"都昌县"},{' +
//'                            "name":"湖口县"},{' +
//'                            "name":"彭泽县"},{' +
//'                            "name":"瑞昌市"}]},{' +
//'                    "name":"新余市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"渝水区"},{' +
//'                            "name":"分宜县"}]},{' +
//'                    "name":"鹰潭市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"月湖区"},{' +
//'                            "name":"余江县"},{' +
//'                            "name":"贵溪市"}]},{' +
//'                    "name":"赣州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"章贡区"},{' +
//'                            "name":"赣县"},{' +
//'                            "name":"信丰县"},{' +
//'                            "name":"大余县"},{' +
//'                            "name":"上犹县"},{' +
//'                            "name":"崇义县"},{' +
//'                            "name":"安远县"},{' +
//'                            "name":"龙南县"},{' +
//'                            "name":"定南县"},{' +
//'                            "name":"全南县"},{' +
//'                            "name":"宁都县"},{' +
//'                            "name":"于都县"},{' +
//'                            "name":"兴国县"},{' +
//'                            "name":"会昌县"},{' +
//'                            "name":"寻乌县"},{' +
//'                            "name":"石城县"},{' +
//'                            "name":"瑞金市"},{' +
//'                            "name":"南康市"}]},{' +
//'                    "name":"吉安市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"吉州区"},{' +
//'                            "name":"青原区"},{' +
//'                            "name":"吉安县"},{' +
//'                            "name":"吉水县"},{' +
//'                            "name":"峡江县"},{' +
//'                            "name":"新干县"},{' +
//'                            "name":"永丰县"},{' +
//'                            "name":"泰和县"},{' +
//'                            "name":"遂川县"},{' +
//'                            "name":"万安县"},{' +
//'                            "name":"安福县"},{' +
//'                            "name":"永新县"},{' +
//'                            "name":"井冈山市"}]},{' +
//'                    "name":"宜春市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"袁州区"},{' +
//'                            "name":"奉新县"},{' +
//'                            "name":"万载县"},{' +
//'                            "name":"上高县"},{' +
//'                            "name":"宜丰县"},{' +
//'                            "name":"靖安县"},{' +
//'                            "name":"铜鼓县"},{' +
//'                            "name":"丰城市"},{' +
//'                            "name":"樟树市"},{' +
//'                            "name":"高安市"}]},{' +
//'                    "name":"抚州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"临川区"},{' +
//'                            "name":"南城县"},{' +
//'                            "name":"黎川县"},{' +
//'                            "name":"南丰县"},{' +
//'                            "name":"崇仁县"},{' +
//'                            "name":"乐安县"},{' +
//'                            "name":"宜黄县"},{' +
//'                            "name":"金溪县"},{' +
//'                            "name":"资溪县"},{' +
//'                            "name":"东乡县"},{' +
//'                            "name":"广昌县"}]},{' +
//'                    "name":"上饶市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"信州区"},{' +
//'                            "name":"上饶县"},{' +
//'                            "name":"广丰县"},{' +
//'                            "name":"玉山县"},{' +
//'                            "name":"铅山县"},{' +
//'                            "name":"横峰县"},{' +
//'                            "name":"弋阳县"},{' +
//'                            "name":"余干县"},{' +
//'                            "name":"鄱阳县"},{' +
//'                            "name":"万年县"},{' +
//'                            "name":"婺源县"},{' +
//'                            "name":"德兴市"}]}]},{' +
//'            "name":"山东省","cities":[' +
//'                {' +
//'                    "name":"济南市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"历下区"},{' +
//'                            "name":"市中区"},{' +
//'                            "name":"槐荫区"},{' +
//'                            "name":"天桥区"},{' +
//'                            "name":"历城区"},{' +
//'                            "name":"长清区"},{' +
//'                            "name":"平阴县"},{' +
//'                            "name":"济阳县"},{' +
//'                            "name":"商河县"},{' +
//'                            "name":"章丘市"}]},{' +
//'                    "name":"青岛市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"市南区"},{' +
//'                            "name":"市北区"},{' +
//'                            "name":"四方区"},{' +
//'                            "name":"黄岛区"},{' +
//'                            "name":"崂山区"},{' +
//'                            "name":"李沧区"},{' +
//'                            "name":"城阳区"},{' +
//'                            "name":"胶州市"},{' +
//'                            "name":"即墨市"},{' +
//'                            "name":"平度市"},{' +
//'                            "name":"胶南市"},{' +
//'                            "name":"莱西市"}]},{' +
//'                    "name":"淄博市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"淄川区"},{' +
//'                            "name":"张店区"},{' +
//'                            "name":"博山区"},{' +
//'                            "name":"临淄区"},{' +
//'                            "name":"周村区"},{' +
//'                            "name":"桓台县"},{' +
//'                            "name":"高青县"},{' +
//'                            "name":"沂源县"}]},{' +
//'                    "name":"枣庄市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"市中区"},{' +
//'                            "name":"薛城区"},{' +
//'                            "name":"峄城区"},{' +
//'                            "name":"台儿庄区"},{' +
//'                            "name":"山亭区"},{' +
//'                            "name":"滕州市"}]},{' +
//'                    "name":"东营市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东营区"},{' +
//'                            "name":"河口区"},{' +
//'                            "name":"垦利县"},{' +
//'                            "name":"利津县"},{' +
//'                            "name":"广饶县"}]},{' +
//'                    "name":"烟台市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"芝罘区"},{' +
//'                            "name":"福山区"},{' +
//'                            "name":"牟平区"},{' +
//'                            "name":"莱山区"},{' +
//'                            "name":"长岛县"},{' +
//'                            "name":"龙口市"},{' +
//'                            "name":"莱阳市"},{' +
//'                            "name":"莱州市"},{' +
//'                            "name":"蓬莱市"},{' +
//'                            "name":"招远市"},{' +
//'                            "name":"栖霞市"},{' +
//'                            "name":"海阳市"}]},{' +
//'                    "name":"潍坊市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"潍城区"},{' +
//'                            "name":"寒亭区"},{' +
//'                            "name":"坊子区"},{' +
//'                            "name":"奎文区"},{' +
//'                            "name":"临朐县"},{' +
//'                            "name":"昌乐县"},{' +
//'                            "name":"青州市"},{' +
//'                            "name":"诸城市"},{' +
//'                            "name":"寿光市"},{' +
//'                            "name":"安丘市"},{' +
//'                            "name":"高密市"},{' +
//'                            "name":"昌邑市"}]},{' +
//'                    "name":"济宁市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"市中区"},{' +
//'                            "name":"任城区"},{' +
//'                            "name":"微山县"},{' +
//'                            "name":"鱼台县"},{' +
//'                            "name":"金乡县"},{' +
//'                            "name":"嘉祥县"},{' +
//'                            "name":"汶上县"},{' +
//'                            "name":"泗水县"},{' +
//'                            "name":"梁山县"},{' +
//'                            "name":"曲阜市"},{' +
//'                            "name":"兖州市"},{' +
//'                            "name":"邹城市"}]},{' +
//'                    "name":"泰安市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"泰山区"},{' +
//'                            "name":"岱岳区"},{' +
//'                            "name":"宁阳县"},{' +
//'                            "name":"东平县"},{' +
//'                            "name":"新泰市"},{' +
//'                            "name":"肥城市"}]},{' +
//'                    "name":"威海市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"环翠区"},{' +
//'                            "name":"文登市"},{' +
//'                            "name":"荣成市"},{' +
//'                            "name":"乳山市"}]},{' +
//'                    "name":"日照市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东港区"},{' +
//'                            "name":"岚山区"},{' +
//'                            "name":"五莲县"},{' +
//'                            "name":"莒县"}]},{' +
//'                    "name":"莱芜市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"莱城区"},{' +
//'                            "name":"钢城区"}]},{' +
//'                    "name":"临沂市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"兰山区"},{' +
//'                            "name":"罗庄区"},{' +
//'                            "name":"河东区"},{' +
//'                            "name":"沂南县"},{' +
//'                            "name":"郯城县"},{' +
//'                            "name":"沂水县"},{' +
//'                            "name":"苍山县"},{' +
//'                            "name":"费县"},{' +
//'                            "name":"平邑县"},{' +
//'                            "name":"莒南县"},{' +
//'                            "name":"蒙阴县"},{' +
//'                            "name":"临沭县"}]},{' +
//'                    "name":"德州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"德城区"},{' +
//'                            "name":"陵县"},{' +
//'                            "name":"宁津县"},{' +
//'                            "name":"庆云县"},{' +
//'                            "name":"临邑县"},{' +
//'                            "name":"齐河县"},{' +
//'                            "name":"平原县"},{' +
//'                            "name":"夏津县"},{' +
//'                            "name":"武城县"},{' +
//'                            "name":"乐陵市"},{' +
//'                            "name":"禹城市"}]},{' +
//'                    "name":"聊城市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东昌府区"},{' +
//'                            "name":"阳谷县"},{' +
//'                            "name":"莘县"},{' +
//'                            "name":"茌平县"},{' +
//'                            "name":"东阿县"},{' +
//'                            "name":"冠县"},{' +
//'                            "name":"高唐县"},{' +
//'                            "name":"临清市"}]},{' +
//'                    "name":"滨州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"滨城区"},{' +
//'                            "name":"惠民县"},{' +
//'                            "name":"阳信县"},{' +
//'                            "name":"无棣县"},{' +
//'                            "name":"沾化县"},{' +
//'                            "name":"博兴县"},{' +
//'                            "name":"邹平县"}]},{' +
//'                    "name":"荷泽市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"牡丹区"},{' +
//'                            "name":"曹县"},{' +
//'                            "name":"单县"},{' +
//'                            "name":"成武县"},{' +
//'                            "name":"巨野县"},{' +
//'                            "name":"郓城县"},{' +
//'                            "name":"鄄城县"},{' +
//'                            "name":"定陶县"},{' +
//'                            "name":"东明县"}]}]},{' +
//'            "name":"河南省","cities":[' +
//'                {' +
//'                    "name":"郑州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"中原区"},{' +
//'                            "name":"二七区"},{' +
//'                            "name":"管城回族区"},{' +
//'                            "name":"金水区"},{' +
//'                            "name":"上街区"},{' +
//'                            "name":"邙山区"},{' +
//'                            "name":"中牟县"},{' +
//'                            "name":"巩义市"},{' +
//'                            "name":"荥阳市"},{' +
//'                            "name":"新密市"},{' +
//'                            "name":"新郑市"},{' +
//'                            "name":"登封市"}]},{' +
//'                    "name":"开封市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"龙亭区"},{' +
//'                            "name":"顺河回族区"},{' +
//'                            "name":"鼓楼区"},{' +
//'                            "name":"南关区"},{' +
//'                            "name":"郊区"},{' +
//'                            "name":"杞县"},{' +
//'                            "name":"通许县"},{' +
//'                            "name":"尉氏县"},{' +
//'                            "name":"开封县"},{' +
//'                            "name":"兰考县"}]},{' +
//'                    "name":"洛阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"老城区"},{' +
//'                            "name":"西工区"},{' +
//'                            "name":"廛河回族区"},{' +
//'                            "name":"涧西区"},{' +
//'                            "name":"吉利区"},{' +
//'                            "name":"洛龙区"},{' +
//'                            "name":"孟津县"},{' +
//'                            "name":"新安县"},{' +
//'                            "name":"栾川县"},{' +
//'                            "name":"嵩县"},{' +
//'                            "name":"汝阳县"},{' +
//'                            "name":"宜阳县"},{' +
//'                            "name":"洛宁县"},{' +
//'                            "name":"伊川县"},{' +
//'                            "name":"偃师市"}]},{' +
//'                    "name":"平顶山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"新华区"},{' +
//'                            "name":"卫东区"},{' +
//'                            "name":"石龙区"},{' +
//'                            "name":"湛河区"},{' +
//'                            "name":"宝丰县"},{' +
//'                            "name":"叶县"},{' +
//'                            "name":"鲁山县"},{' +
//'                            "name":"郏县"},{' +
//'                            "name":"舞钢市"},{' +
//'                            "name":"汝州市"}]},{' +
//'                    "name":"安阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"文峰区"},{' +
//'                            "name":"北关区"},{' +
//'                            "name":"殷都区"},{' +
//'                            "name":"龙安区"},{' +
//'                            "name":"安阳县"},{' +
//'                            "name":"汤阴县"},{' +
//'                            "name":"滑县"},{' +
//'                            "name":"内黄县"},{' +
//'                            "name":"林州市"}]},{' +
//'                    "name":"鹤壁市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"鹤山区"},{' +
//'                            "name":"山城区"},{' +
//'                            "name":"淇滨区"},{' +
//'                            "name":"浚县"},{' +
//'                            "name":"淇县"}]},{' +
//'                    "name":"新乡市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"红旗区"},{' +
//'                            "name":"卫滨区"},{' +
//'                            "name":"凤泉区"},{' +
//'                            "name":"牧野区"},{' +
//'                            "name":"新乡县"},{' +
//'                            "name":"获嘉县"},{' +
//'                            "name":"原阳县"},{' +
//'                            "name":"延津县"},{' +
//'                            "name":"封丘县"},{' +
//'                            "name":"长垣县"},{' +
//'                            "name":"卫辉市"},{' +
//'                            "name":"辉县市"}]},{' +
//'                    "name":"焦作市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"解放区"},{' +
//'                            "name":"中站区"},{' +
//'                            "name":"马村区"},{' +
//'                            "name":"山阳区"},{' +
//'                            "name":"修武县"},{' +
//'                            "name":"博爱县"},{' +
//'                            "name":"武陟县"},{' +
//'                            "name":"温县"},{' +
//'                            "name":"济源市"},{' +
//'                            "name":"沁阳市"},{' +
//'                            "name":"孟州市"}]},{' +
//'                    "name":"濮阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"华龙区"},{' +
//'                            "name":"清丰县"},{' +
//'                            "name":"南乐县"},{' +
//'                            "name":"范县"},{' +
//'                            "name":"台前县"},{' +
//'                            "name":"濮阳县"}]},{' +
//'                    "name":"许昌市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"魏都区"},{' +
//'                            "name":"许昌县"},{' +
//'                            "name":"鄢陵县"},{' +
//'                            "name":"襄城县"},{' +
//'                            "name":"禹州市"},{' +
//'                            "name":"长葛市"}]},{' +
//'                    "name":"漯河市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"源汇区"},{' +
//'                            "name":"郾城区"},{' +
//'                            "name":"召陵区"},{' +
//'                            "name":"舞阳县"},{' +
//'                            "name":"临颍县"}]},{' +
//'                    "name":"三门峡市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"湖滨区"},{' +
//'                            "name":"渑池县"},{' +
//'                            "name":"陕县"},{' +
//'                            "name":"卢氏县"},{' +
//'                            "name":"义马市"},{' +
//'                            "name":"灵宝市"}]},{' +
//'                    "name":"南阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"宛城区"},{' +
//'                            "name":"卧龙区"},{' +
//'                            "name":"南召县"},{' +
//'                            "name":"方城县"},{' +
//'                            "name":"西峡县"},{' +
//'                            "name":"镇平县"},{' +
//'                            "name":"内乡县"},{' +
//'                            "name":"淅川县"},{' +
//'                            "name":"社旗县"},{' +
//'                            "name":"唐河县"},{' +
//'                            "name":"新野县"},{' +
//'                            "name":"桐柏县"},{' +
//'                            "name":"邓州市"}]},{' +
//'                    "name":"商丘市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"梁园区"},{' +
//'                            "name":"睢阳区"},{' +
//'                            "name":"民权县"},{' +
//'                            "name":"睢县"},{' +
//'                            "name":"宁陵县"},{' +
//'                            "name":"柘城县"},{' +
//'                            "name":"虞城县"},{' +
//'                            "name":"夏邑县"},{' +
//'                            "name":"永城市"}]},{' +
//'                    "name":"信阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"师河区"},{' +
//'                            "name":"平桥区"},{' +
//'                            "name":"罗山县"},{' +
//'                            "name":"光山县"},{' +
//'                            "name":"新县"},{' +
//'                            "name":"商城县"},{' +
//'                            "name":"固始县"},{' +
//'                            "name":"潢川县"},{' +
//'                            "name":"淮滨县"},{' +
//'                            "name":"息县"}]},{' +
//'                    "name":"周口市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"川汇区"},{' +
//'                            "name":"扶沟县"},{' +
//'                            "name":"西华县"},{' +
//'                            "name":"商水县"},{' +
//'                            "name":"沈丘县"},{' +
//'                            "name":"郸城县"},{' +
//'                            "name":"淮阳县"},{' +
//'                            "name":"太康县"},{' +
//'                            "name":"鹿邑县"},{' +
//'                            "name":"项城市"}]},{' +
//'                    "name":"驻马店市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"驿城区"},{' +
//'                            "name":"西平县"},{' +
//'                            "name":"上蔡县"},{' +
//'                            "name":"平舆县"},{' +
//'                            "name":"正阳县"},{' +
//'                            "name":"确山县"},{' +
//'                            "name":"泌阳县"},{' +
//'                            "name":"汝南县"},{' +
//'                            "name":"遂平县"},{' +
//'                            "name":"新蔡县"}]}]},{' +
//'            "name":"湖北省","cities":[' +
//'                {' +
//'                    "name":"武汉市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"江岸区"},{' +
//'                            "name":"江汉区"},{' +
//'                            "name":"乔口区"},{' +
//'                            "name":"汉阳区"},{' +
//'                            "name":"武昌区"},{' +
//'                            "name":"青山区"},{' +
//'                            "name":"洪山区"},{' +
//'                            "name":"东西湖区"},{' +
//'                            "name":"汉南区"},{' +
//'                            "name":"蔡甸区"},{' +
//'                            "name":"江夏区"},{' +
//'                            "name":"黄陂区"},{' +
//'                            "name":"新洲区"}]},{' +
//'                    "name":"黄石市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"黄石港区"},{' +
//'                            "name":"西塞山区"},{' +
//'                            "name":"下陆区"},{' +
//'                            "name":"铁山区"},{' +
//'                            "name":"阳新县"},{' +
//'                            "name":"大冶市"}]},{' +
//'                    "name":"十堰市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"茅箭区"},{' +
//'                            "name":"张湾区"},{' +
//'                            "name":"郧县"},{' +
//'                            "name":"郧西县"},{' +
//'                            "name":"竹山县"},{' +
//'                            "name":"竹溪县"},{' +
//'                            "name":"房县"},{' +
//'                            "name":"丹江口市"}]},{' +
//'                    "name":"宜昌市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"西陵区"},{' +
//'                            "name":"伍家岗区"},{' +
//'                            "name":"点军区"},{' +
//'                            "name":"猇亭区"},{' +
//'                            "name":"夷陵区"},{' +
//'                            "name":"远安县"},{' +
//'                            "name":"兴山县"},{' +
//'                            "name":"秭归县"},{' +
//'                            "name":"长阳土家族自治县"},{' +
//'                            "name":"五峰土家族自治县"},{' +
//'                            "name":"宜都市"},{' +
//'                            "name":"当阳市"},{' +
//'                            "name":"枝江市"}]},{' +
//'                    "name":"襄樊市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"襄城区"},{' +
//'                            "name":"樊城区"},{' +
//'                            "name":"襄阳区"},{' +
//'                            "name":"南漳县"},{' +
//'                            "name":"谷城县"},{' +
//'                            "name":"保康县"},{' +
//'                            "name":"老河口市"},{' +
//'                            "name":"枣阳市"},{' +
//'                            "name":"宜城市"}]},{' +
//'                    "name":"鄂州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"梁子湖区"},{' +
//'                            "name":"华容区"},{' +
//'                            "name":"鄂城区"}]},{' +
//'                    "name":"荆门市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东宝区"},{' +
//'                            "name":"掇刀区"},{' +
//'                            "name":"京山县"},{' +
//'                            "name":"沙洋县"},{' +
//'                            "name":"钟祥市"}]},{' +
//'                    "name":"孝感市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"孝南区"},{' +
//'                            "name":"孝昌县"},{' +
//'                            "name":"大悟县"},{' +
//'                            "name":"云梦县"},{' +
//'                            "name":"应城市"},{' +
//'                            "name":"安陆市"},{' +
//'                            "name":"汉川市"}]},{' +
//'                    "name":"荆州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"沙市区"},{' +
//'                            "name":"荆州区"},{' +
//'                            "name":"公安县"},{' +
//'                            "name":"监利县"},{' +
//'                            "name":"江陵县"},{' +
//'                            "name":"石首市"},{' +
//'                            "name":"洪湖市"},{' +
//'                            "name":"松滋市"}]},{' +
//'                    "name":"黄冈市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"黄州区"},{' +
//'                            "name":"团风县"},{' +
//'                            "name":"红安县"},{' +
//'                            "name":"罗田县"},{' +
//'                            "name":"英山县"},{' +
//'                            "name":"浠水县"},{' +
//'                            "name":"蕲春县"},{' +
//'                            "name":"黄梅县"},{' +
//'                            "name":"麻城市"},{' +
//'                            "name":"武穴市"}]},{' +
//'                    "name":"咸宁市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"咸安区"},{' +
//'                            "name":"嘉鱼县"},{' +
//'                            "name":"通城县"},{' +
//'                            "name":"崇阳县"},{' +
//'                            "name":"通山县"},{' +
//'                            "name":"赤壁市"}]},{' +
//'                    "name":"随州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"曾都区"},{' +
//'                            "name":"广水市"}]},{' +
//'                    "name":"恩施土家族苗族自治州","counties":[' +
//'                        {' +
//'                            "name":"恩施市"},{' +
//'                            "name":"利川市"},{' +
//'                            "name":"建始县"},{' +
//'                            "name":"巴东县"},{' +
//'                            "name":"宣恩县"},{' +
//'                            "name":"咸丰县"},{' +
//'                            "name":"来凤县"},{' +
//'                            "name":"鹤峰县"}]},{' +
//'                    "name":"省直辖行政单位","counties":[' +
//'                        {' +
//'                            "name":"仙桃市"},{' +
//'                            "name":"潜江市"},{' +
//'                            "name":"天门市"},{' +
//'                            "name":"神农架林区"}]}]},{' +
//'            "name":"湖南省","cities":[' +
//'                {' +
//'                    "name":"长沙市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"芙蓉区"},{' +
//'                            "name":"天心区"},{' +
//'                            "name":"岳麓区"},{' +
//'                            "name":"开福区"},{' +
//'                            "name":"雨花区"},{' +
//'                            "name":"长沙县"},{' +
//'                            "name":"望城县"},{' +
//'                            "name":"宁乡县"},{' +
//'                            "name":"浏阳市"}]},{' +
//'                    "name":"株洲市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"荷塘区"},{' +
//'                            "name":"芦淞区"},{' +
//'                            "name":"石峰区"},{' +
//'                            "name":"天元区"},{' +
//'                            "name":"株洲县"},{' +
//'                            "name":"攸县"},{' +
//'                            "name":"茶陵县"},{' +
//'                            "name":"炎陵县"},{' +
//'                            "name":"醴陵市"}]},{' +
//'                    "name":"湘潭市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"雨湖区"},{' +
//'                            "name":"岳塘区"},{' +
//'                            "name":"湘潭县"},{' +
//'                            "name":"湘乡市"},{' +
//'                            "name":"韶山市"}]},{' +
//'                    "name":"衡阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"珠晖区"},{' +
//'                            "name":"雁峰区"},{' +
//'                            "name":"石鼓区"},{' +
//'                            "name":"蒸湘区"},{' +
//'                            "name":"南岳区"},{' +
//'                            "name":"衡阳县"},{' +
//'                            "name":"衡南县"},{' +
//'                            "name":"衡山县"},{' +
//'                            "name":"衡东县"},{' +
//'                            "name":"祁东县"},{' +
//'                            "name":"耒阳市"},{' +
//'                            "name":"常宁市"}]},{' +
//'                    "name":"邵阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"双清区"},{' +
//'                            "name":"大祥区"},{' +
//'                            "name":"北塔区"},{' +
//'                            "name":"邵东县"},{' +
//'                            "name":"新邵县"},{' +
//'                            "name":"邵阳县"},{' +
//'                            "name":"隆回县"},{' +
//'                            "name":"洞口县"},{' +
//'                            "name":"绥宁县"},{' +
//'                            "name":"新宁县"},{' +
//'                            "name":"城步苗族自治县"},{' +
//'                            "name":"武冈市"}]},{' +
//'                    "name":"岳阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"岳阳楼区"},{' +
//'                            "name":"云溪区"},{' +
//'                            "name":"君山区"},{' +
//'                            "name":"岳阳县"},{' +
//'                            "name":"华容县"},{' +
//'                            "name":"湘阴县"},{' +
//'                            "name":"平江县"},{' +
//'                            "name":"汨罗市"},{' +
//'                            "name":"临湘市"}]},{' +
//'                    "name":"常德市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"武陵区"},{' +
//'                            "name":"鼎城区"},{' +
//'                            "name":"安乡县"},{' +
//'                            "name":"汉寿县"},{' +
//'                            "name":"澧县"},{' +
//'                            "name":"临澧县"},{' +
//'                            "name":"桃源县"},{' +
//'                            "name":"石门县"},{' +
//'                            "name":"津市市"}]},{' +
//'                    "name":"张家界市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"永定区"},{' +
//'                            "name":"武陵源区"},{' +
//'                            "name":"慈利县"},{' +
//'                            "name":"桑植县"}]},{' +
//'                    "name":"益阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"资阳区"},{' +
//'                            "name":"赫山区"},{' +
//'                            "name":"南县"},{' +
//'                            "name":"桃江县"},{' +
//'                            "name":"安化县"},{' +
//'                            "name":"沅江市"}]},{' +
//'                    "name":"郴州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"北湖区"},{' +
//'                            "name":"苏仙区"},{' +
//'                            "name":"桂阳县"},{' +
//'                            "name":"宜章县"},{' +
//'                            "name":"永兴县"},{' +
//'                            "name":"嘉禾县"},{' +
//'                            "name":"临武县"},{' +
//'                            "name":"汝城县"},{' +
//'                            "name":"桂东县"},{' +
//'                            "name":"安仁县"},{' +
//'                            "name":"资兴市"}]},{' +
//'                    "name":"永州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"芝山区"},{' +
//'                            "name":"冷水滩区"},{' +
//'                            "name":"祁阳县"},{' +
//'                            "name":"东安县"},{' +
//'                            "name":"双牌县"},{' +
//'                            "name":"道县"},{' +
//'                            "name":"江永县"},{' +
//'                            "name":"宁远县"},{' +
//'                            "name":"蓝山县"},{' +
//'                            "name":"新田县"},{' +
//'                            "name":"江华瑶族自治县"}]},{' +
//'                    "name":"怀化市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"鹤城区"},{' +
//'                            "name":"中方县"},{' +
//'                            "name":"沅陵县"},{' +
//'                            "name":"辰溪县"},{' +
//'                            "name":"溆浦县"},{' +
//'                            "name":"会同县"},{' +
//'                            "name":"麻阳苗族自治县"},{' +
//'                            "name":"新晃侗族自治县"},{' +
//'                            "name":"芷江侗族自治县"},{' +
//'                            "name":"靖州苗族侗族自治县"},{' +
//'                            "name":"通道侗族自治县"},{' +
//'                            "name":"洪江市"}]},{' +
//'                    "name":"娄底市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"娄星区"},{' +
//'                            "name":"双峰县"},{' +
//'                            "name":"新化县"},{' +
//'                            "name":"冷水江市"},{' +
//'                            "name":"涟源市"}]},{' +
//'                    "name":"湘西土家族苗族自治州","counties":[' +
//'                        {' +
//'                            "name":"吉首市"},{' +
//'                            "name":"泸溪县"},{' +
//'                            "name":"凤凰县"},{' +
//'                            "name":"花垣县"},{' +
//'                            "name":"保靖县"},{' +
//'                            "name":"古丈县"},{' +
//'                            "name":"永顺县"},{' +
//'                            "name":"龙山县"}]}]},{' +
//'            "name":"广东省","cities":[' +
//'                {' +
//'                    "name":"广州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东山区"},{' +
//'                            "name":"荔湾区"},{' +
//'                            "name":"越秀区"},{' +
//'                            "name":"海珠区"},{' +
//'                            "name":"天河区"},{' +
//'                            "name":"芳村区"},{' +
//'                            "name":"白云区"},{' +
//'                            "name":"黄埔区"},{' +
//'                            "name":"番禺区"},{' +
//'                            "name":"花都区"},{' +
//'                            "name":"增城市"},{' +
//'                            "name":"从化市"}]},{' +
//'                    "name":"韶关市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"武江区"},{' +
//'                            "name":"浈江区"},{' +
//'                            "name":"曲江区"},{' +
//'                            "name":"始兴县"},{' +
//'                            "name":"仁化县"},{' +
//'                            "name":"翁源县"},{' +
//'                            "name":"乳源瑶族自治县"},{' +
//'                            "name":"新丰县"},{' +
//'                            "name":"乐昌市"},{' +
//'                            "name":"南雄市"}]},{' +
//'                    "name":"深圳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"罗湖区"},{' +
//'                            "name":"福田区"},{' +
//'                            "name":"南山区"},{' +
//'                            "name":"宝安区"},{' +
//'                            "name":"龙岗区"},{' +
//'                            "name":"盐田区"}]},{' +
//'                    "name":"珠海市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"香洲区"},{' +
//'                            "name":"斗门区"},{' +
//'                            "name":"金湾区"}]},{' +
//'                    "name":"汕头市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"龙湖区"},{' +
//'                            "name":"金平区"},{' +
//'                            "name":"濠江区"},{' +
//'                            "name":"潮阳区"},{' +
//'                            "name":"潮南区"},{' +
//'                            "name":"澄海区"},{' +
//'                            "name":"南澳县"}]},{' +
//'                    "name":"佛山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"禅城区"},{' +
//'                            "name":"南海区"},{' +
//'                            "name":"顺德区"},{' +
//'                            "name":"三水区"},{' +
//'                            "name":"高明区"}]},{' +
//'                    "name":"江门市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"蓬江区"},{' +
//'                            "name":"江海区"},{' +
//'                            "name":"新会区"},{' +
//'                            "name":"台山市"},{' +
//'                            "name":"开平市"},{' +
//'                            "name":"鹤山市"},{' +
//'                            "name":"恩平市"}]},{' +
//'                    "name":"湛江市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"赤坎区"},{' +
//'                            "name":"霞山区"},{' +
//'                            "name":"坡头区"},{' +
//'                            "name":"麻章区"},{' +
//'                            "name":"遂溪县"},{' +
//'                            "name":"徐闻县"},{' +
//'                            "name":"廉江市"},{' +
//'                            "name":"雷州市"},{' +
//'                            "name":"吴川市"}]},{' +
//'                    "name":"茂名市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"茂南区"},{' +
//'                            "name":"茂港区"},{' +
//'                            "name":"电白县"},{' +
//'                            "name":"高州市"},{' +
//'                            "name":"化州市"},{' +
//'                            "name":"信宜市"}]},{' +
//'                    "name":"肇庆市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"端州区"},{' +
//'                            "name":"鼎湖区"},{' +
//'                            "name":"广宁县"},{' +
//'                            "name":"怀集县"},{' +
//'                            "name":"封开县"},{' +
//'                            "name":"德庆县"},{' +
//'                            "name":"高要市"},{' +
//'                            "name":"四会市"}]},{' +
//'                    "name":"惠州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"惠城区"},{' +
//'                            "name":"惠阳区"},{' +
//'                            "name":"博罗县"},{' +
//'                            "name":"惠东县"},{' +
//'                            "name":"龙门县"}]},{' +
//'                    "name":"梅州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"梅江区"},{' +
//'                            "name":"梅县"},{' +
//'                            "name":"大埔县"},{' +
//'                            "name":"丰顺县"},{' +
//'                            "name":"五华县"},{' +
//'                            "name":"平远县"},{' +
//'                            "name":"蕉岭县"},{' +
//'                            "name":"兴宁市"}]},{' +
//'                    "name":"汕尾市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城区"},{' +
//'                            "name":"海丰县"},{' +
//'                            "name":"陆河县"},{' +
//'                            "name":"陆丰市"}]},{' +
//'                    "name":"河源市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"源城区"},{' +
//'                            "name":"紫金县"},{' +
//'                            "name":"龙川县"},{' +
//'                            "name":"连平县"},{' +
//'                            "name":"和平县"},{' +
//'                            "name":"东源县"}]},{' +
//'                    "name":"阳江市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"江城区"},{' +
//'                            "name":"阳西县"},{' +
//'                            "name":"阳东县"},{' +
//'                            "name":"阳春市"}]},{' +
//'                    "name":"清远市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"清城区"},{' +
//'                            "name":"佛冈县"},{' +
//'                            "name":"阳山县"},{' +
//'                            "name":"连山壮族瑶族自治县"},{' +
//'                            "name":"连南瑶族自治县"},{' +
//'                            "name":"清新县"},{' +
//'                            "name":"英德市"},{' +
//'                            "name":"连州市"}]},{' +
//'                    "name":"东莞市"},{' +
//'                    "name":"中山市"},{' +
//'                    "name":"潮州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"湘桥区"},{' +
//'                            "name":"潮安县"},{' +
//'                            "name":"饶平县"}]},{' +
//'                    "name":"揭阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"榕城区"},{' +
//'                            "name":"揭东县"},{' +
//'                            "name":"揭西县"},{' +
//'                            "name":"惠来县"},{' +
//'                            "name":"普宁市"}]},{' +
//'                    "name":"云浮市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"云城区"},{' +
//'                            "name":"新兴县"},{' +
//'                            "name":"郁南县"},{' +
//'                            "name":"云安县"},{' +
//'                            "name":"罗定市"}]}]},{' +
//'            "name":"广西壮族自治区","cities":[' +
//'                {' +
//'                    "name":"南宁市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"兴宁区"},{' +
//'                            "name":"青秀区"},{' +
//'                            "name":"江南区"},{' +
//'                            "name":"西乡塘区"},{' +
//'                            "name":"良庆区"},{' +
//'                            "name":"邕宁区"},{' +
//'                            "name":"武鸣县"},{' +
//'                            "name":"隆安县"},{' +
//'                            "name":"马山县"},{' +
//'                            "name":"上林县"},{' +
//'                            "name":"宾阳县"},{' +
//'                            "name":"横县"}]},{' +
//'                    "name":"柳州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城中区"},{' +
//'                            "name":"鱼峰区"},{' +
//'                            "name":"柳南区"},{' +
//'                            "name":"柳北区"},{' +
//'                            "name":"柳江县"},{' +
//'                            "name":"柳城县"},{' +
//'                            "name":"鹿寨县"},{' +
//'                            "name":"融安县"},{' +
//'                            "name":"融水苗族自治县"},{' +
//'                            "name":"三江侗族自治县"}]},{' +
//'                    "name":"桂林市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"秀峰区"},{' +
//'                            "name":"叠彩区"},{' +
//'                            "name":"象山区"},{' +
//'                            "name":"七星区"},{' +
//'                            "name":"雁山区"},{' +
//'                            "name":"阳朔县"},{' +
//'                            "name":"临桂县"},{' +
//'                            "name":"灵川县"},{' +
//'                            "name":"全州县"},{' +
//'                            "name":"兴安县"},{' +
//'                            "name":"永福县"},{' +
//'                            "name":"灌阳县"},{' +
//'                            "name":"龙胜各族自治县"},{' +
//'                            "name":"资源县"},{' +
//'                            "name":"平乐县"},{' +
//'                            "name":"荔蒲县"},{' +
//'                            "name":"恭城瑶族自治县"}]},{' +
//'                    "name":"梧州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"万秀区"},{' +
//'                            "name":"蝶山区"},{' +
//'                            "name":"长洲区"},{' +
//'                            "name":"苍梧县"},{' +
//'                            "name":"藤县"},{' +
//'                            "name":"蒙山县"},{' +
//'                            "name":"岑溪市"}]},{' +
//'                    "name":"北海市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"海城区"},{' +
//'                            "name":"银海区"},{' +
//'                            "name":"铁山港区"},{' +
//'                            "name":"合浦县"}]},{' +
//'                    "name":"防城港市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"港口区"},{' +
//'                            "name":"防城区"},{' +
//'                            "name":"上思县"},{' +
//'                            "name":"东兴市"}]},{' +
//'                    "name":"钦州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"钦南区"},{' +
//'                            "name":"钦北区"},{' +
//'                            "name":"灵山县"},{' +
//'                            "name":"浦北县"}]},{' +
//'                    "name":"贵港市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"港北区"},{' +
//'                            "name":"港南区"},{' +
//'                            "name":"覃塘区"},{' +
//'                            "name":"平南县"},{' +
//'                            "name":"桂平市"}]},{' +
//'                    "name":"玉林市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"玉州区"},{' +
//'                            "name":"容县"},{' +
//'                            "name":"陆川县"},{' +
//'                            "name":"博白县"},{' +
//'                            "name":"兴业县"},{' +
//'                            "name":"北流市"}]},{' +
//'                    "name":"百色市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"右江区"},{' +
//'                            "name":"田阳县"},{' +
//'                            "name":"田东县"},{' +
//'                            "name":"平果县"},{' +
//'                            "name":"德保县"},{' +
//'                            "name":"靖西县"},{' +
//'                            "name":"那坡县"},{' +
//'                            "name":"凌云县"},{' +
//'                            "name":"乐业县"},{' +
//'                            "name":"田林县"},{' +
//'                            "name":"西林县"},{' +
//'                            "name":"隆林各族自治县"}]},{' +
//'                    "name":"贺州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"八步区"},{' +
//'                            "name":"昭平县"},{' +
//'                            "name":"钟山县"},{' +
//'                            "name":"富川瑶族自治县"}]},{' +
//'                    "name":"河池市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"金城江区"},{' +
//'                            "name":"南丹县"},{' +
//'                            "name":"天峨县"},{' +
//'                            "name":"凤山县"},{' +
//'                            "name":"东兰县"},{' +
//'                            "name":"罗城仫佬族自治县"},{' +
//'                            "name":"环江毛南族自治县"},{' +
//'                            "name":"巴马瑶族自治县"},{' +
//'                            "name":"都安瑶族自治县"},{' +
//'                            "name":"大化瑶族自治县"},{' +
//'                            "name":"宜州市"}]},{' +
//'                    "name":"来宾市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"兴宾区"},{' +
//'                            "name":"忻城县"},{' +
//'                            "name":"象州县"},{' +
//'                            "name":"武宣县"},{' +
//'                            "name":"金秀瑶族自治县"},{' +
//'                            "name":"合山市"}]},{' +
//'                    "name":"崇左市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"江洲区"},{' +
//'                            "name":"扶绥县"},{' +
//'                            "name":"宁明县"},{' +
//'                            "name":"龙州县"},{' +
//'                            "name":"大新县"},{' +
//'                            "name":"天等县"},{' +
//'                            "name":"凭祥市"}]}]},{' +
//'            "name":"海南省","cities":[' +
//'                {' +
//'                    "name":"海口市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"秀英区"},{' +
//'                            "name":"龙华区"},{' +
//'                            "name":"琼山区"},{' +
//'                            "name":"美兰区"}]},{' +
//'                    "name":"三亚市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"}]},{' +
//'                    "name":"省直辖县级行政单位","counties":[' +
//'                        {' +
//'                            "name":"五指山市"},{' +
//'                            "name":"琼海市"},{' +
//'                            "name":"儋州市"},{' +
//'                            "name":"文昌市"},{' +
//'                            "name":"万宁市"},{' +
//'                            "name":"东方市"},{' +
//'                            "name":"定安县"},{' +
//'                            "name":"屯昌县"},{' +
//'                            "name":"澄迈县"},{' +
//'                            "name":"临高县"},{' +
//'                            "name":"白沙黎族自治县"},{' +
//'                            "name":"昌江黎族自治县"},{' +
//'                            "name":"乐东黎族自治县"},{' +
//'                            "name":"陵水黎族自治县"},{' +
//'                            "name":"保亭黎族苗族自治县"},{' +
//'                            "name":"琼中黎族苗族自治县"},{' +
//'                            "name":"西沙群岛"},{' +
//'                            "name":"南沙群岛"},{' +
//'                            "name":"中沙群岛的岛礁及其海域"}]}]},{' +
//'            "name":"四川省","cities":[' +
//'                {' +
//'                    "name":"成都市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"锦江区"},{' +
//'                            "name":"青羊区"},{' +
//'                            "name":"金牛区"},{' +
//'                            "name":"武侯区"},{' +
//'                            "name":"成华区"},{' +
//'                            "name":"龙泉驿区"},{' +
//'                            "name":"青白江区"},{' +
//'                            "name":"新都区"},{' +
//'                            "name":"温江区"},{' +
//'                            "name":"金堂县"},{' +
//'                            "name":"双流县"},{' +
//'                            "name":"郫县"},{' +
//'                            "name":"大邑县"},{' +
//'                            "name":"蒲江县"},{' +
//'                            "name":"新津县"},{' +
//'                            "name":"都江堰市"},{' +
//'                            "name":"彭州市"},{' +
//'                            "name":"邛崃市"},{' +
//'                            "name":"崇州市"}]},{' +
//'                    "name":"自贡市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"自流井区"},{' +
//'                            "name":"贡井区"},{' +
//'                            "name":"大安区"},{' +
//'                            "name":"沿滩区"},{' +
//'                            "name":"荣县"},{' +
//'                            "name":"富顺县"}]},{' +
//'                    "name":"攀枝花市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东区"},{' +
//'                            "name":"西区"},{' +
//'                            "name":"仁和区"},{' +
//'                            "name":"米易县"},{' +
//'                            "name":"盐边县"}]},{' +
//'                    "name":"泸州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"江阳区"},{' +
//'                            "name":"纳溪区"},{' +
//'                            "name":"龙马潭区"},{' +
//'                            "name":"泸县"},{' +
//'                            "name":"合江县"},{' +
//'                            "name":"叙永县"},{' +
//'                            "name":"古蔺县"}]},{' +
//'                    "name":"德阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"旌阳区"},{' +
//'                            "name":"中江县"},{' +
//'                            "name":"罗江县"},{' +
//'                            "name":"广汉市"},{' +
//'                            "name":"什邡市"},{' +
//'                            "name":"绵竹市"}]},{' +
//'                    "name":"绵阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"涪城区"},{' +
//'                            "name":"游仙区"},{' +
//'                            "name":"三台县"},{' +
//'                            "name":"盐亭县"},{' +
//'                            "name":"安县"},{' +
//'                            "name":"梓潼县"},{' +
//'                            "name":"北川羌族自治县"},{' +
//'                            "name":"平武县"},{' +
//'                            "name":"江油市"}]},{' +
//'                    "name":"广元市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"市中区"},{' +
//'                            "name":"元坝区"},{' +
//'                            "name":"朝天区"},{' +
//'                            "name":"旺苍县"},{' +
//'                            "name":"青川县"},{' +
//'                            "name":"剑阁县"},{' +
//'                            "name":"苍溪县"}]},{' +
//'                    "name":"遂宁市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"船山区"},{' +
//'                            "name":"安居区"},{' +
//'                            "name":"蓬溪县"},{' +
//'                            "name":"射洪县"},{' +
//'                            "name":"大英县"}]},{' +
//'                    "name":"内江市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"市中区"},{' +
//'                            "name":"东兴区"},{' +
//'                            "name":"威远县"},{' +
//'                            "name":"资中县"},{' +
//'                            "name":"隆昌县"}]},{' +
//'                    "name":"乐山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"市中区"},{' +
//'                            "name":"沙湾区"},{' +
//'                            "name":"五通桥区"},{' +
//'                            "name":"金口河区"},{' +
//'                            "name":"犍为县"},{' +
//'                            "name":"井研县"},{' +
//'                            "name":"夹江县"},{' +
//'                            "name":"沐川县"},{' +
//'                            "name":"峨边彝族自治县"},{' +
//'                            "name":"马边彝族自治县"},{' +
//'                            "name":"峨眉山市"}]},{' +
//'                    "name":"南充市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"顺庆区"},{' +
//'                            "name":"高坪区"},{' +
//'                            "name":"嘉陵区"},{' +
//'                            "name":"南部县"},{' +
//'                            "name":"营山县"},{' +
//'                            "name":"蓬安县"},{' +
//'                            "name":"仪陇县"},{' +
//'                            "name":"西充县"},{' +
//'                            "name":"阆中市"}]},{' +
//'                    "name":"眉山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"东坡区"},{' +
//'                            "name":"仁寿县"},{' +
//'                            "name":"彭山县"},{' +
//'                            "name":"洪雅县"},{' +
//'                            "name":"丹棱县"},{' +
//'                            "name":"青神县"}]},{' +
//'                    "name":"宜宾市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"翠屏区"},{' +
//'                            "name":"宜宾县"},{' +
//'                            "name":"南溪县"},{' +
//'                            "name":"江安县"},{' +
//'                            "name":"长宁县"},{' +
//'                            "name":"高县"},{' +
//'                            "name":"珙县"},{' +
//'                            "name":"筠连县"},{' +
//'                            "name":"兴文县"},{' +
//'                            "name":"屏山县"}]},{' +
//'                    "name":"广安市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"广安区"},{' +
//'                            "name":"岳池县"},{' +
//'                            "name":"武胜县"},{' +
//'                            "name":"邻水县"},{' +
//'                            "name":"华莹市"}]},{' +
//'                    "name":"达州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"通川区"},{' +
//'                            "name":"达县"},{' +
//'                            "name":"宣汉县"},{' +
//'                            "name":"开江县"},{' +
//'                            "name":"大竹县"},{' +
//'                            "name":"渠县"},{' +
//'                            "name":"万源市"}]},{' +
//'                    "name":"雅安市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"雨城区"},{' +
//'                            "name":"名山县"},{' +
//'                            "name":"荥经县"},{' +
//'                            "name":"汉源县"},{' +
//'                            "name":"石棉县"},{' +
//'                            "name":"天全县"},{' +
//'                            "name":"芦山县"},{' +
//'                            "name":"宝兴县"}]},{' +
//'                    "name":"巴中市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"巴州区"},{' +
//'                            "name":"通江县"},{' +
//'                            "name":"南江县"},{' +
//'                            "name":"平昌县"}]},{' +
//'                    "name":"资阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"雁江区"},{' +
//'                            "name":"安岳县"},{' +
//'                            "name":"乐至县"},{' +
//'                            "name":"简阳市"}]},{' +
//'                    "name":"阿坝藏族羌族自治州","counties":[' +
//'                        {' +
//'                            "name":"汶川县"},{' +
//'                            "name":"理县"},{' +
//'                            "name":"茂县"},{' +
//'                            "name":"松潘县"},{' +
//'                            "name":"九寨沟县"},{' +
//'                            "name":"金川县"},{' +
//'                            "name":"小金县"},{' +
//'                            "name":"黑水县"},{' +
//'                            "name":"马尔康县"},{' +
//'                            "name":"壤塘县"},{' +
//'                            "name":"阿坝县"},{' +
//'                            "name":"若尔盖县"},{' +
//'                            "name":"红原县"}]},{' +
//'                    "name":"甘孜藏族自治州","counties":[' +
//'                        {' +
//'                            "name":"康定县"},{' +
//'                            "name":"泸定县"},{' +
//'                            "name":"丹巴县"},{' +
//'                            "name":"九龙县"},{' +
//'                            "name":"雅江县"},{' +
//'                            "name":"道孚县"},{' +
//'                            "name":"炉霍县"},{' +
//'                            "name":"甘孜县"},{' +
//'                            "name":"新龙县"},{' +
//'                            "name":"德格县"},{' +
//'                            "name":"白玉县"},{' +
//'                            "name":"石渠县"},{' +
//'                            "name":"色达县"},{' +
//'                            "name":"理塘县"},{' +
//'                            "name":"巴塘县"},{' +
//'                            "name":"乡城县"},{' +
//'                            "name":"稻城县"},{' +
//'                            "name":"得荣县"}]},{' +
//'                    "name":"凉山彝族自治州","counties":[' +
//'                        {' +
//'                            "name":"西昌市"},{' +
//'                            "name":"木里藏族自治县"},{' +
//'                            "name":"盐源县"},{' +
//'                            "name":"德昌县"},{' +
//'                            "name":"会理县"},{' +
//'                            "name":"会东县"},{' +
//'                            "name":"宁南县"},{' +
//'                            "name":"普格县"},{' +
//'                            "name":"布拖县"},{' +
//'                            "name":"金阳县"},{' +
//'                            "name":"昭觉县"},{' +
//'                            "name":"喜德县"},{' +
//'                            "name":"冕宁县"},{' +
//'                            "name":"越西县"},{' +
//'                            "name":"甘洛县"},{' +
//'                            "name":"美姑县"},{' +
//'                            "name":"雷波县"}]}]},{' +
//'            "name":"贵州省","cities":[' +
//'                {' +
//'                    "name":"贵阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"南明区"},{' +
//'                            "name":"云岩区"},{' +
//'                            "name":"花溪区"},{' +
//'                            "name":"乌当区"},{' +
//'                            "name":"白云区"},{' +
//'                            "name":"小河区"},{' +
//'                            "name":"开阳县"},{' +
//'                            "name":"息烽县"},{' +
//'                            "name":"修文县"},{' +
//'                            "name":"清镇市"}]},{' +
//'                    "name":"六盘水市","counties":[' +
//'                        {' +
//'                            "name":"钟山区"},{' +
//'                            "name":"六枝特区"},{' +
//'                            "name":"水城县"},{' +
//'                            "name":"盘县"}]},{' +
//'                    "name":"遵义市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"红花岗区"},{' +
//'                            "name":"汇川区"},{' +
//'                            "name":"遵义县"},{' +
//'                            "name":"桐梓县"},{' +
//'                            "name":"绥阳县"},{' +
//'                            "name":"正安县"},{' +
//'                            "name":"道真仡佬族苗族自治县"},{' +
//'                            "name":"务川仡佬族苗族自治县"},{' +
//'                            "name":"凤冈县"},{' +
//'                            "name":"湄潭县"},{' +
//'                            "name":"余庆县"},{' +
//'                            "name":"习水县"},{' +
//'                            "name":"赤水市"},{' +
//'                            "name":"仁怀市"}]},{' +
//'                    "name":"安顺市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"西秀区"},{' +
//'                            "name":"平坝县"},{' +
//'                            "name":"普定县"},{' +
//'                            "name":"镇宁布依族苗族自治县"},{' +
//'                            "name":"关岭布依族苗族自治县"},{' +
//'                            "name":"紫云苗族布依族自治县"}]},{' +
//'                    "name":"铜仁地区","counties":[' +
//'                        {' +
//'                            "name":"铜仁市"},{' +
//'                            "name":"江口县"},{' +
//'                            "name":"玉屏侗族自治县"},{' +
//'                            "name":"石阡县"},{' +
//'                            "name":"思南县"},{' +
//'                            "name":"印江土家族苗族自治县"},{' +
//'                            "name":"德江县"},{' +
//'                            "name":"沿河土家族自治县"},{' +
//'                            "name":"松桃苗族自治县"},{' +
//'                            "name":"万山特区"}]},{' +
//'                    "name":"黔西南布依族苗族自治州","counties":[' +
//'                        {' +
//'                            "name":"兴义市"},{' +
//'                            "name":"兴仁县"},{' +
//'                            "name":"普安县"},{' +
//'                            "name":"晴隆县"},{' +
//'                            "name":"贞丰县"},{' +
//'                            "name":"望谟县"},{' +
//'                            "name":"册亨县"},{' +
//'                            "name":"安龙县"}]},{' +
//'                    "name":"毕节地区","counties":[' +
//'                        {' +
//'                            "name":"毕节市"},{' +
//'                            "name":"大方县"},{' +
//'                            "name":"黔西县"},{' +
//'                            "name":"金沙县"},{' +
//'                            "name":"织金县"},{' +
//'                            "name":"纳雍县"},{' +
//'                            "name":"威宁彝族回族苗族自治县"},{' +
//'                            "name":"赫章县"}]},{' +
//'                    "name":"黔东南苗族侗族自治州","counties":[' +
//'                        {' +
//'                            "name":"凯里市"},{' +
//'                            "name":"黄平县"},{' +
//'                            "name":"施秉县"},{' +
//'                            "name":"三穗县"},{' +
//'                            "name":"镇远县"},{' +
//'                            "name":"岑巩县"},{' +
//'                            "name":"天柱县"},{' +
//'                            "name":"锦屏县"},{' +
//'                            "name":"剑河县"},{' +
//'                            "name":"台江县"},{' +
//'                            "name":"黎平县"},{' +
//'                            "name":"榕江县"},{' +
//'                            "name":"从江县"},{' +
//'                            "name":"雷山县"},{' +
//'                            "name":"麻江县"},{' +
//'                            "name":"丹寨县"}]},{' +
//'                    "name":"黔南布依族苗族自治州","counties":[' +
//'                        {' +
//'                            "name":"都匀市"},{' +
//'                            "name":"福泉市"},{' +
//'                            "name":"荔波县"},{' +
//'                            "name":"贵定县"},{' +
//'                            "name":"瓮安县"},{' +
//'                            "name":"独山县"},{' +
//'                            "name":"平塘县"},{' +
//'                            "name":"罗甸县"},{' +
//'                            "name":"长顺县"},{' +
//'                            "name":"龙里县"},{' +
//'                            "name":"惠水县"},{' +
//'                            "name":"三都水族自治县"}]}]},{' +
//'            "name":"云南省","cities":[' +
//'                {' +
//'                    "name":"昆明市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"五华区"},{' +
//'                            "name":"盘龙区"},{' +
//'                            "name":"官渡区"},{' +
//'                            "name":"西山区"},{' +
//'                            "name":"东川区"},{' +
//'                            "name":"呈贡县"},{' +
//'                            "name":"晋宁县"},{' +
//'                            "name":"富民县"},{' +
//'                            "name":"宜良县"},{' +
//'                            "name":"石林彝族自治县"},{' +
//'                            "name":"嵩明县"},{' +
//'                            "name":"禄劝彝族苗族自治县"},{' +
//'                            "name":"寻甸回族彝族自治县"},{' +
//'                            "name":"安宁市"}]},{' +
//'                    "name":"曲靖市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"麒麟区"},{' +
//'                            "name":"马龙县"},{' +
//'                            "name":"陆良县"},{' +
//'                            "name":"师宗县"},{' +
//'                            "name":"罗平县"},{' +
//'                            "name":"富源县"},{' +
//'                            "name":"会泽县"},{' +
//'                            "name":"沾益县"},{' +
//'                            "name":"宣威市"}]},{' +
//'                    "name":"玉溪市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"红塔区"},{' +
//'                            "name":"江川县"},{' +
//'                            "name":"澄江县"},{' +
//'                            "name":"通海县"},{' +
//'                            "name":"华宁县"},{' +
//'                            "name":"易门县"},{' +
//'                            "name":"峨山彝族自治县"},{' +
//'                            "name":"新平彝族傣族自治县"},{' +
//'                            "name":"元江哈尼族彝族傣族自治县"}]},{' +
//'                    "name":"保山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"隆阳区"},{' +
//'                            "name":"施甸县"},{' +
//'                            "name":"腾冲县"},{' +
//'                            "name":"龙陵县"},{' +
//'                            "name":"昌宁县"}]},{' +
//'                    "name":"昭通市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"昭阳区"},{' +
//'                            "name":"鲁甸县"},{' +
//'                            "name":"巧家县"},{' +
//'                            "name":"盐津县"},{' +
//'                            "name":"大关县"},{' +
//'                            "name":"永善县"},{' +
//'                            "name":"绥江县"},{' +
//'                            "name":"镇雄县"},{' +
//'                            "name":"彝良县"},{' +
//'                            "name":"威信县"},{' +
//'                            "name":"水富县"}]},{' +
//'                    "name":"丽江市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"古城区"},{' +
//'                            "name":"玉龙纳西族自治县"},{' +
//'                            "name":"永胜县"},{' +
//'                            "name":"华坪县"},{' +
//'                            "name":"宁蒗彝族自治县"}]},{' +
//'                    "name":"思茅市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"翠云区"},{' +
//'                            "name":"普洱哈尼族彝族自治县"},{' +
//'                            "name":"墨江哈尼族自治县"},{' +
//'                            "name":"景东彝族自治县"},{' +
//'                            "name":"景谷傣族彝族自治县"},{' +
//'                            "name":"镇沅彝族哈尼族拉祜族自治县"},{' +
//'                            "name":"江城哈尼族彝族自治县"},{' +
//'                            "name":"孟连傣族拉祜族佤族自治县"},{' +
//'                            "name":"澜沧拉祜族自治县"},{' +
//'                            "name":"西盟佤族自治县"}]},{' +
//'                    "name":"临沧市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"临翔区"},{' +
//'                            "name":"凤庆县"},{' +
//'                            "name":"云县"},{' +
//'                            "name":"永德县"},{' +
//'                            "name":"镇康县"},{' +
//'                            "name":"双江拉祜族佤族布朗族傣族自治县"},{' +
//'                            "name":"耿马傣族佤族自治县"},{' +
//'                            "name":"沧源佤族自治县"}]},{' +
//'                    "name":"楚雄彝族自治州","counties":[' +
//'                        {' +
//'                            "name":"楚雄市"},{' +
//'                            "name":"双柏县"},{' +
//'                            "name":"牟定县"},{' +
//'                            "name":"南华县"},{' +
//'                            "name":"姚安县"},{' +
//'                            "name":"大姚县"},{' +
//'                            "name":"永仁县"},{' +
//'                            "name":"元谋县"},{' +
//'                            "name":"武定县"},{' +
//'                            "name":"禄丰县"}]},{' +
//'                    "name":"红河哈尼族彝族自治州","counties":[' +
//'                        {' +
//'                            "name":"个旧市"},{' +
//'                            "name":"开远市"},{' +
//'                            "name":"蒙自县"},{' +
//'                            "name":"屏边苗族自治县"},{' +
//'                            "name":"建水县"},{' +
//'                            "name":"石屏县"},{' +
//'                            "name":"弥勒县"},{' +
//'                            "name":"泸西县"},{' +
//'                            "name":"元阳县"},{' +
//'                            "name":"红河县"},{' +
//'                            "name":"金平苗族瑶族傣族自治县"},{' +
//'                            "name":"绿春县"},{' +
//'                            "name":"河口瑶族自治县"}]},{' +
//'                    "name":"文山壮族苗族自治州","counties":[' +
//'                        {' +
//'                            "name":"文山县"},{' +
//'                            "name":"砚山县"},{' +
//'                            "name":"西畴县"},{' +
//'                            "name":"麻栗坡县"},{' +
//'                            "name":"马关县"},{' +
//'                            "name":"丘北县"},{' +
//'                            "name":"广南县"},{' +
//'                            "name":"富宁县"}]},{' +
//'                    "name":"西双版纳傣族自治州","counties":[' +
//'                        {' +
//'                            "name":"景洪市"},{' +
//'                            "name":"勐海县"},{' +
//'                            "name":"勐腊县"}]},{' +
//'                    "name":"大理白族自治州","counties":[' +
//'                        {' +
//'                            "name":"大理市"},{' +
//'                            "name":"漾濞彝族自治县"},{' +
//'                            "name":"祥云县"},{' +
//'                            "name":"宾川县"},{' +
//'                            "name":"弥渡县"},{' +
//'                            "name":"南涧彝族自治县"},{' +
//'                            "name":"巍山彝族回族自治县"},{' +
//'                            "name":"永平县"},{' +
//'                            "name":"云龙县"},{' +
//'                            "name":"洱源县"},{' +
//'                            "name":"剑川县"},{' +
//'                            "name":"鹤庆县"}]},{' +
//'                    "name":"德宏傣族景颇族自治州","counties":[' +
//'                        {' +
//'                            "name":"瑞丽市"},{' +
//'                            "name":"潞西市"},{' +
//'                            "name":"梁河县"},{' +
//'                            "name":"盈江县"},{' +
//'                            "name":"陇川县"}]},{' +
//'                    "name":"怒江傈僳族自治州","counties":[' +
//'                        {' +
//'                            "name":"泸水县"},{' +
//'                            "name":"福贡县"},{' +
//'                            "name":"贡山独龙族怒族自治县"},{' +
//'                            "name":"兰坪白族普米族自治县"}]},{' +
//'                    "name":"迪庆藏族自治州","counties":[' +
//'                        {' +
//'                            "name":"香格里拉县"},{' +
//'                            "name":"德钦县"},{' +
//'                            "name":"维西傈僳族自治县"}]}]},{' +
//'            "name":"西藏自治区","cities":[' +
//'                {' +
//'                    "name":"拉萨市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城关区"},{' +
//'                            "name":"林周县"},{' +
//'                            "name":"当雄县"},{' +
//'                            "name":"尼木县"},{' +
//'                            "name":"曲水县"},{' +
//'                            "name":"堆龙德庆县"},{' +
//'                            "name":"达孜县"},{' +
//'                            "name":"墨竹工卡县"}]},{' +
//'                    "name":"昌都地区","counties":[' +
//'                        {' +
//'                            "name":"昌都县"},{' +
//'                            "name":"江达县"},{' +
//'                            "name":"贡觉县"},{' +
//'                            "name":"类乌齐县"},{' +
//'                            "name":"丁青县"},{' +
//'                            "name":"察雅县"},{' +
//'                            "name":"八宿县"},{' +
//'                            "name":"左贡县"},{' +
//'                            "name":"芒康县"},{' +
//'                            "name":"洛隆县"},{' +
//'                            "name":"边坝县"}]},{' +
//'                    "name":"山南地区","counties":[' +
//'                        {' +
//'                            "name":"乃东县"},{' +
//'                            "name":"扎囊县"},{' +
//'                            "name":"贡嘎县"},{' +
//'                            "name":"桑日县"},{' +
//'                            "name":"琼结县"},{' +
//'                            "name":"曲松县"},{' +
//'                            "name":"措美县"},{' +
//'                            "name":"洛扎县"},{' +
//'                            "name":"加查县"},{' +
//'                            "name":"隆子县"},{' +
//'                            "name":"错那县"},{' +
//'                            "name":"浪卡子县"}]},{' +
//'                    "name":"日喀则地区","counties":[' +
//'                        {' +
//'                            "name":"日喀则市"},{' +
//'                            "name":"南木林县"},{' +
//'                            "name":"江孜县"},{' +
//'                            "name":"定日县"},{' +
//'                            "name":"萨迦县"},{' +
//'                            "name":"拉孜县"},{' +
//'                            "name":"昂仁县"},{' +
//'                            "name":"谢通门县"},{' +
//'                            "name":"白朗县"},{' +
//'                            "name":"仁布县"},{' +
//'                            "name":"康马县"},{' +
//'                            "name":"定结县"},{' +
//'                            "name":"仲巴县"},{' +
//'                            "name":"亚东县"},{' +
//'                            "name":"吉隆县"},{' +
//'                            "name":"聂拉木县"},{' +
//'                            "name":"萨嘎县"},{' +
//'                            "name":"岗巴县"}]},{' +
//'                    "name":"那曲地区","counties":[' +
//'                        {' +
//'                            "name":"那曲县"},{' +
//'                            "name":"嘉黎县"},{' +
//'                            "name":"比如县"},{' +
//'                            "name":"聂荣县"},{' +
//'                            "name":"安多县"},{' +
//'                            "name":"申扎县"},{' +
//'                            "name":"索县"},{' +
//'                            "name":"班戈县"},{' +
//'                            "name":"巴青县"},{' +
//'                            "name":"尼玛县"}]},{' +
//'                    "name":"阿里地区","counties":[' +
//'                        {' +
//'                            "name":"普兰县"},{' +
//'                            "name":"札达县"},{' +
//'                            "name":"噶尔县"},{' +
//'                            "name":"日土县"},{' +
//'                            "name":"革吉县"},{' +
//'                            "name":"改则县"},{' +
//'                            "name":"措勤县"}]},{' +
//'                    "name":"林芝地区","counties":[' +
//'                        {' +
//'                            "name":"林芝县"},{' +
//'                            "name":"工布江达县"},{' +
//'                            "name":"米林县"},{' +
//'                            "name":"墨脱县"},{' +
//'                            "name":"波密县"},{' +
//'                            "name":"察隅县"},{' +
//'                            "name":"朗县"}]}]},{' +
//'            "name":"陕西省","cities":[' +
//'                {' +
//'                    "name":"西安市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"新城区"},{' +
//'                            "name":"碑林区"},{' +
//'                            "name":"莲湖区"},{' +
//'                            "name":"灞桥区"},{' +
//'                            "name":"未央区"},{' +
//'                            "name":"雁塔区"},{' +
//'                            "name":"阎良区"},{' +
//'                            "name":"临潼区"},{' +
//'                            "name":"长安区"},{' +
//'                            "name":"蓝田县"},{' +
//'                            "name":"周至县"},{' +
//'                            "name":"户县"},{' +
//'                            "name":"高陵县"}]},{' +
//'                    "name":"铜川市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"王益区"},{' +
//'                            "name":"印台区"},{' +
//'                            "name":"耀州区"},{' +
//'                            "name":"宜君县"}]},{' +
//'                    "name":"宝鸡市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"渭滨区"},{' +
//'                            "name":"金台区"},{' +
//'                            "name":"陈仓区"},{' +
//'                            "name":"凤翔县"},{' +
//'                            "name":"岐山县"},{' +
//'                            "name":"扶风县"},{' +
//'                            "name":"眉县"},{' +
//'                            "name":"陇县"},{' +
//'                            "name":"千阳县"},{' +
//'                            "name":"麟游县"},{' +
//'                            "name":"凤县"},{' +
//'                            "name":"太白县"}]},{' +
//'                    "name":"咸阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"秦都区"},{' +
//'                            "name":"杨凌区"},{' +
//'                            "name":"渭城区"},{' +
//'                            "name":"三原县"},{' +
//'                            "name":"泾阳县"},{' +
//'                            "name":"乾县"},{' +
//'                            "name":"礼泉县"},{' +
//'                            "name":"永寿县"},{' +
//'                            "name":"彬县"},{' +
//'                            "name":"长武县"},{' +
//'                            "name":"旬邑县"},{' +
//'                            "name":"淳化县"},{' +
//'                            "name":"武功县"},{' +
//'                            "name":"兴平市"}]},{' +
//'                    "name":"渭南市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"临渭区"},{' +
//'                            "name":"华县"},{' +
//'                            "name":"潼关县"},{' +
//'                            "name":"大荔县"},{' +
//'                            "name":"合阳县"},{' +
//'                            "name":"澄城县"},{' +
//'                            "name":"蒲城县"},{' +
//'                            "name":"白水县"},{' +
//'                            "name":"富平县"},{' +
//'                            "name":"韩城市"},{' +
//'                            "name":"华阴市"}]},{' +
//'                    "name":"延安市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"宝塔区"},{' +
//'                            "name":"延长县"},{' +
//'                            "name":"延川县"},{' +
//'                            "name":"子长县"},{' +
//'                            "name":"安塞县"},{' +
//'                            "name":"志丹县"},{' +
//'                            "name":"吴旗县"},{' +
//'                            "name":"甘泉县"},{' +
//'                            "name":"富县"},{' +
//'                            "name":"洛川县"},{' +
//'                            "name":"宜川县"},{' +
//'                            "name":"黄龙县"},{' +
//'                            "name":"黄陵县"}]},{' +
//'                    "name":"汉中市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"汉台区"},{' +
//'                            "name":"南郑县"},{' +
//'                            "name":"城固县"},{' +
//'                            "name":"洋县"},{' +
//'                            "name":"西乡县"},{' +
//'                            "name":"勉县"},{' +
//'                            "name":"宁强县"},{' +
//'                            "name":"略阳县"},{' +
//'                            "name":"镇巴县"},{' +
//'                            "name":"留坝县"},{' +
//'                            "name":"佛坪县"}]},{' +
//'                    "name":"榆林市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"榆阳区"},{' +
//'                            "name":"神木县"},{' +
//'                            "name":"府谷县"},{' +
//'                            "name":"横山县"},{' +
//'                            "name":"靖边县"},{' +
//'                            "name":"定边县"},{' +
//'                            "name":"绥德县"},{' +
//'                            "name":"米脂县"},{' +
//'                            "name":"佳县"},{' +
//'                            "name":"吴堡县"},{' +
//'                            "name":"清涧县"},{' +
//'                            "name":"子洲县"}]},{' +
//'                    "name":"安康市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"汉滨区"},{' +
//'                            "name":"汉阴县"},{' +
//'                            "name":"石泉县"},{' +
//'                            "name":"宁陕县"},{' +
//'                            "name":"紫阳县"},{' +
//'                            "name":"岚皋县"},{' +
//'                            "name":"平利县"},{' +
//'                            "name":"镇坪县"},{' +
//'                            "name":"旬阳县"},{' +
//'                            "name":"白河县"}]},{' +
//'                    "name":"商洛市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"商州区"},{' +
//'                            "name":"洛南县"},{' +
//'                            "name":"丹凤县"},{' +
//'                            "name":"商南县"},{' +
//'                            "name":"山阳县"},{' +
//'                            "name":"镇安县"},{' +
//'                            "name":"柞水县"}]}]},{' +
//'            "name":"甘肃省","cities":[' +
//'                {' +
//'                    "name":"兰州市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城关区"},{' +
//'                            "name":"七里河区"},{' +
//'                            "name":"西固区"},{' +
//'                            "name":"安宁区"},{' +
//'                            "name":"红古区"},{' +
//'                            "name":"永登县"},{' +
//'                            "name":"皋兰县"},{' +
//'                            "name":"榆中县"}]},{' +
//'                    "name":"嘉峪关市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"}]},{' +
//'                    "name":"金昌市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"金川区"},{' +
//'                            "name":"永昌县"}]},{' +
//'                    "name":"白银市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"白银区"},{' +
//'                            "name":"平川区"},{' +
//'                            "name":"靖远县"},{' +
//'                            "name":"会宁县"},{' +
//'                            "name":"景泰县"}]},{' +
//'                    "name":"天水市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"秦城区"},{' +
//'                            "name":"北道区"},{' +
//'                            "name":"清水县"},{' +
//'                            "name":"秦安县"},{' +
//'                            "name":"甘谷县"},{' +
//'                            "name":"武山县"},{' +
//'                            "name":"张家川回族自治县"}]},{' +
//'                    "name":"武威市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"凉州区"},{' +
//'                            "name":"民勤县"},{' +
//'                            "name":"古浪县"},{' +
//'                            "name":"天祝藏族自治县"}]},{' +
//'                    "name":"张掖市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"甘州区"},{' +
//'                            "name":"肃南裕固族自治县"},{' +
//'                            "name":"民乐县"},{' +
//'                            "name":"临泽县"},{' +
//'                            "name":"高台县"},{' +
//'                            "name":"山丹县"}]},{' +
//'                    "name":"平凉市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"崆峒区"},{' +
//'                            "name":"泾川县"},{' +
//'                            "name":"灵台县"},{' +
//'                            "name":"崇信县"},{' +
//'                            "name":"华亭县"},{' +
//'                            "name":"庄浪县"},{' +
//'                            "name":"静宁县"}]},{' +
//'                    "name":"酒泉市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"肃州区"},{' +
//'                            "name":"金塔县"},{' +
//'                            "name":"安西县"},{' +
//'                            "name":"肃北蒙古族自治县"},{' +
//'                            "name":"阿克塞哈萨克族自治县"},{' +
//'                            "name":"玉门市"},{' +
//'                            "name":"敦煌市"}]},{' +
//'                    "name":"庆阳市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"西峰区"},{' +
//'                            "name":"庆城县"},{' +
//'                            "name":"环县"},{' +
//'                            "name":"华池县"},{' +
//'                            "name":"合水县"},{' +
//'                            "name":"正宁县"},{' +
//'                            "name":"宁县"},{' +
//'                            "name":"镇原县"}]},{' +
//'                    "name":"定西市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"安定区"},{' +
//'                            "name":"通渭县"},{' +
//'                            "name":"陇西县"},{' +
//'                            "name":"渭源县"},{' +
//'                            "name":"临洮县"},{' +
//'                            "name":"漳县"},{' +
//'                            "name":"岷县"}]},{' +
//'                    "name":"陇南市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"武都区"},{' +
//'                            "name":"成县"},{' +
//'                            "name":"文县"},{' +
//'                            "name":"宕昌县"},{' +
//'                            "name":"康县"},{' +
//'                            "name":"西和县"},{' +
//'                            "name":"礼县"},{' +
//'                            "name":"徽县"},{' +
//'                            "name":"两当县"}]},{' +
//'                    "name":"临夏回族自治州","counties":[' +
//'                        {' +
//'                            "name":"临夏市"},{' +
//'                            "name":"临夏县"},{' +
//'                            "name":"康乐县"},{' +
//'                            "name":"永靖县"},{' +
//'                            "name":"广河县"},{' +
//'                            "name":"和政县"},{' +
//'                            "name":"东乡族自治县"},{' +
//'                            "name":"积石山保安族东乡族撒拉族自治县"}]},{' +
//'                    "name":"甘南藏族自治州","counties":[' +
//'                        {' +
//'                            "name":"合作市"},{' +
//'                            "name":"临潭县"},{' +
//'                            "name":"卓尼县"},{' +
//'                            "name":"舟曲县"},{' +
//'                            "name":"迭部县"},{' +
//'                            "name":"玛曲县"},{' +
//'                            "name":"碌曲县"},{' +
//'                            "name":"夏河县"}]}]},{' +
//'            "name":"青海省","cities":[' +
//'                {' +
//'                    "name":"西宁市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"城东区"},{' +
//'                            "name":"城中区"},{' +
//'                            "name":"城西区"},{' +
//'                            "name":"城北区"},{' +
//'                            "name":"大通回族土族自治县"},{' +
//'                            "name":"湟中县"},{' +
//'                            "name":"湟源县"}]},{' +
//'                    "name":"海东地区","counties":[' +
//'                        {' +
//'                            "name":"平安县"},{' +
//'                            "name":"民和回族土族自治县"},{' +
//'                            "name":"乐都县"},{' +
//'                            "name":"互助土族自治县"},{' +
//'                            "name":"化隆回族自治县"},{' +
//'                            "name":"循化撒拉族自治县"}]},{' +
//'                    "name":"海北藏族自治州","counties":[' +
//'                        {' +
//'                            "name":"门源回族自治县"},{' +
//'                            "name":"祁连县"},{' +
//'                            "name":"海晏县"},{' +
//'                            "name":"刚察县"}]},{' +
//'                    "name":"黄南藏族自治州","counties":[' +
//'                        {' +
//'                            "name":"同仁县"},{' +
//'                            "name":"尖扎县"},{' +
//'                            "name":"泽库县"},{' +
//'                            "name":"河南蒙古族自治县"}]},{' +
//'                    "name":"海南藏族自治州","counties":[' +
//'                        {' +
//'                            "name":"共和县"},{' +
//'                            "name":"同德县"},{' +
//'                            "name":"贵德县"},{' +
//'                            "name":"兴海县"},{' +
//'                            "name":"贵南县"}]},{' +
//'                    "name":"果洛藏族自治州","counties":[' +
//'                        {' +
//'                            "name":"玛沁县"},{' +
//'                            "name":"班玛县"},{' +
//'                            "name":"甘德县"},{' +
//'                            "name":"达日县"},{' +
//'                            "name":"久治县"},{' +
//'                            "name":"玛多县"}]},{' +
//'                    "name":"玉树藏族自治州","counties":[' +
//'                        {' +
//'                            "name":"玉树县"},{' +
//'                            "name":"杂多县"},{' +
//'                            "name":"称多县"},{' +
//'                            "name":"治多县"},{' +
//'                            "name":"囊谦县"},{' +
//'                            "name":"曲麻莱县"}]},{' +
//'                    "name":"海西蒙古族藏族自治州","counties":[' +
//'                        {' +
//'                            "name":"格尔木市"},{' +
//'                            "name":"德令哈市"},{' +
//'                            "name":"乌兰县"},{' +
//'                            "name":"都兰县"},{' +
//'                            "name":"天峻县"}]}]},{' +
//'            "name":"宁夏回族自治区","cities":[' +
//'                {' +
//'                    "name":"银川市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"兴庆区"},{' +
//'                            "name":"西夏区"},{' +
//'                            "name":"金凤区"},{' +
//'                            "name":"永宁县"},{' +
//'                            "name":"贺兰县"},{' +
//'                            "name":"灵武市"}]},{' +
//'                    "name":"石嘴山市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"大武口区"},{' +
//'                            "name":"惠农区"},{' +
//'                            "name":"平罗县"}]},{' +
//'                    "name":"吴忠市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"利通区"},{' +
//'                            "name":"盐池县"},{' +
//'                            "name":"同心县"},{' +
//'                            "name":"青铜峡市"}]},{' +
//'                    "name":"固原市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"原州区"},{' +
//'                            "name":"西吉县"},{' +
//'                            "name":"隆德县"},{' +
//'                            "name":"泾源县"},{' +
//'                            "name":"彭阳县"}]},{' +
//'                    "name":"中卫市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"沙坡头区"},{' +
//'                            "name":"中宁县"},{' +
//'                            "name":"海原县"}]}]},{' +
//'            "name":"新疆维吾尔自治区","cities":[' +
//'                {' +
//'                    "name":"乌鲁木齐市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"天山区"},{' +
//'                            "name":"沙依巴克区"},{' +
//'                            "name":"新市区"},{' +
//'                            "name":"水磨沟区"},{' +
//'                            "name":"头屯河区"},{' +
//'                            "name":"达坂城区"},{' +
//'                            "name":"东山区"},{' +
//'                            "name":"乌鲁木齐县"}]},{' +
//'                    "name":"克拉玛依市","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"独山子区"},{' +
//'                            "name":"克拉玛依区"},{' +
//'                            "name":"白碱滩区"},{' +
//'                            "name":"乌尔禾区"}]},{' +
//'                    "name":"吐鲁番地区","counties":[' +
//'                        {' +
//'                            "name":"吐鲁番市"},{' +
//'                            "name":"鄯善县"},{' +
//'                            "name":"托克逊县"}]},{' +
//'                    "name":"哈密地区","counties":[' +
//'                        {' +
//'                            "name":"哈密市"},{' +
//'                            "name":"巴里坤哈萨克自治县"},{' +
//'                            "name":"伊吾县"}]},{' +
//'                    "name":"昌吉回族自治州","counties":[' +
//'                        {' +
//'                            "name":"昌吉市"},{' +
//'                            "name":"阜康市"},{' +
//'                            "name":"米泉市"},{' +
//'                            "name":"呼图壁县"},{' +
//'                            "name":"玛纳斯县"},{' +
//'                            "name":"奇台县"},{' +
//'                            "name":"吉木萨尔县"},{' +
//'                            "name":"木垒哈萨克自治县"}]},{' +
//'                    "name":"博尔塔拉蒙古自治州","counties":[' +
//'                        {' +
//'                            "name":"博乐市"},{' +
//'                            "name":"精河县"},{' +
//'                            "name":"温泉县"}]},{' +
//'                    "name":"巴音郭楞蒙古自治州","counties":[' +
//'                        {' +
//'                            "name":"库尔勒市"},{' +
//'                            "name":"轮台县"},{' +
//'                            "name":"尉犁县"},{' +
//'                            "name":"若羌县"},{' +
//'                            "name":"且末县"},{' +
//'                            "name":"焉耆回族自治县"},{' +
//'                            "name":"和静县"},{' +
//'                            "name":"和硕县"},{' +
//'                            "name":"博湖县"}]},{' +
//'                    "name":"阿克苏地区","counties":[' +
//'                        {' +
//'                            "name":"阿克苏市"},{' +
//'                            "name":"温宿县"},{' +
//'                            "name":"库车县"},{' +
//'                            "name":"沙雅县"},{' +
//'                            "name":"新和县"},{' +
//'                            "name":"拜城县"},{' +
//'                            "name":"乌什县"},{' +
//'                            "name":"阿瓦提县"},{' +
//'                            "name":"柯坪县"}]},{' +
//'                    "name":"克孜勒苏柯尔克孜自治州","counties":[' +
//'                        {' +
//'                            "name":"阿图什市"},{' +
//'                            "name":"阿克陶县"},{' +
//'                            "name":"阿合奇县"},{' +
//'                            "name":"乌恰县"}]},{' +
//'                    "name":"喀什地区","counties":[' +
//'                        {' +
//'                            "name":"喀什市"},{' +
//'                            "name":"疏附县"},{' +
//'                            "name":"疏勒县"},{' +
//'                            "name":"英吉沙县"},{' +
//'                            "name":"泽普县"},{' +
//'                            "name":"莎车县"},{' +
//'                            "name":"叶城县"},{' +
//'                            "name":"麦盖提县"},{' +
//'                            "name":"岳普湖县"},{' +
//'                            "name":"伽师县"},{' +
//'                            "name":"巴楚县"},{' +
//'                            "name":"塔什库尔干塔吉克自治县"}]},{' +
//'                    "name":"和田地区","counties":[' +
//'                        {' +
//'                            "name":"和田市"},{' +
//'                            "name":"和田县"},{' +
//'                            "name":"墨玉县"},{' +
//'                            "name":"皮山县"},{' +
//'                            "name":"洛浦县"},{' +
//'                            "name":"策勒县"},{' +
//'                            "name":"于田县"},{' +
//'                            "name":"民丰县"}]},{' +
//'                    "name":"伊犁哈萨克自治州","counties":[' +
//'                        {' +
//'                            "name":"伊宁市"},{' +
//'                            "name":"奎屯市"},{' +
//'                            "name":"伊宁县"},{' +
//'                            "name":"察布查尔锡伯自治县"},{' +
//'                            "name":"霍城县"},{' +
//'                            "name":"巩留县"},{' +
//'                            "name":"新源县"},{' +
//'                            "name":"昭苏县"},{' +
//'                            "name":"特克斯县"},{' +
//'                            "name":"尼勒克县"}]},{' +
//'                    "name":"塔城地区","counties":[' +
//'                        {' +
//'                            "name":"塔城市"},{' +
//'                            "name":"乌苏市"},{' +
//'                            "name":"额敏县"},{' +
//'                            "name":"沙湾县"},{' +
//'                            "name":"托里县"},{' +
//'                            "name":"裕民县"},{' +
//'                            "name":"和布克赛尔蒙古自治县"}]},{' +
//'                    "name":"阿勒泰地区","counties":[' +
//'                        {' +
//'                            "name":"阿勒泰市"},{' +
//'                            "name":"布尔津县"},{' +
//'                            "name":"富蕴县"},{' +
//'                            "name":"福海县"},{' +
//'                            "name":"哈巴河县"},{' +
//'                            "name":"青河县"},{' +
//'                            "name":"吉木乃县"}]},{' +
//'                    "name":"省直辖行政单位","counties":[' +
//'                        {' +
//'                            "name":"石河子市"},{' +
//'                            "name":"阿拉尔市"},{' +
//'                            "name":"图木舒克市"},{' +
//'                            "name":"五家渠市"}]}]},{' +
//'            "name":"台湾省","cities":[' +
//'                {' +
//'                    "name":"台湾省","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"台北市"},{' +
//'                            "name":"高雄市"},{' +
//'                            "name":"台北县"},{' +
//'                            "name":"桃园县"},{' +
//'                            "name":"新竹县"},{' +
//'                            "name":"苗栗县"},{' +
//'                            "name":"台中县"},{' +
//'                            "name":"彰化县"},{' +
//'                            "name":"南投县"},{' +
//'                            "name":"云林县"},{' +
//'                            "name":"嘉义县"},{' +
//'                            "name":"台南县"},{' +
//'                            "name":"高雄县"},{' +
//'                            "name":"屏东县"},{' +
//'                            "name":"宜兰县"},{' +
//'                            "name":"花莲县"},{' +
//'                            "name":"台东县"},{' +
//'                            "name":"澎湖县"},{' +
//'                            "name":"基隆市"},{' +
//'                            "name":"新竹市"},{' +
//'                            "name":"台中市"},{' +
//'                            "name":"嘉义市"},{' +
//'                            "name":"台南市"}]}]},{' +
//'            "name":"香港","cities":[' +
//'                {' +
//'                    "name":"香港","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"中西区"},{' +
//'                            "name":"湾仔区"},{' +
//'                            "name":"东区"},{' +
//'                            "name":"南区"},{' +
//'                            "name":"深水埗区"},{' +
//'                            "name":"油尖旺区"},{' +
//'                            "name":"九龙城区"},{' +
//'                            "name":"黄大仙区"},{' +
//'                            "name":"观塘区"},{' +
//'                            "name":"北区"},{' +
//'                            "name":"大埔区"},{' +
//'                            "name":"沙田区"},{' +
//'                            "name":"西贡区"},{' +
//'                            "name":"元朗区"},{' +
//'                            "name":"屯门区"},{' +
//'                            "name":"荃湾区"},{' +
//'                            "name":"葵青区"},{' +
//'                            "name":"离岛区"}]}]},{' +
//'            "name":"澳门","cities":[' +
//'                {' +
//'                    "name":"澳门","counties":[' +
//'                        {' +
//'                            "name":"市辖区"},{' +
//'                            "name":"花地玛堂区"},{' +
//'                            "name":"圣安多尼堂区"},{' +
//'                            "name":"大堂区"},{' +
//'                            "name":"望德堂区"},{' +
//'                            "name":"风顺堂区"},{' +
//'                            "name":"嘉模堂区"},{' +
//'                            "name":"圣方济各堂区"},{' +
//'                            "name":"路凼"}]' +
//'}]}]' +
//'}';
  {$ENDREGION 'JSON'}

//  dataObject:=TSuperObject.Create(jsonData);

  FState.ParseProvinceListFromCommaText(Const_Provinces,Const_City_Array,Const_Area_Array);
//  FState.ParseProvinceListFromJson(dataObject.A['data']);

  FIsDataLoaded:=True;

  FrameResize(nil);
end;

procedure TFrameSelectArea.LoadDataFromWeb(ARestUrl:String;AStateNameEn:String='China');
begin
  if Not FIsDataLoaded then
  begin
    ShowWaitingFrame(Self,'正在加载...');
    FRestStateNameEn:=AStateNameEn;
    FRestUrl:=ARestUrl;
    Self.tteGetArea.Run;
  end;
end;

destructor TFrameSelectArea.Destroy;
begin
  FreeAndNil(FState);
  inherited;
end;

procedure TFrameSelectArea.FrameResize(Sender: TObject);
var
  AVisibleListBoxCount:Integer;
begin
  if FState<>nil then
  begin
    Self.lbProvience.Visible:=(Self.FState.ProvinceList.Count>1);
    Self.lbCity.Visible:=GlobalIsStateHasCity;
    Self.lbCounty.Visible:=GlobalIsStateHasArea and FIsNeedArea;

    AVisibleListBoxCount:=Ord(Self.lbProvience.Visible)
                          +Ord(Self.lbCity.Visible)
                          +Ord(Self.lbCounty.Visible);

    if AVisibleListBoxCount>0 then
    begin

      //平分三个ListBox
      Self.lbProvience.Width:=Self.Width/AVisibleListBoxCount;
      Self.lbCity.Width:=Self.Width/AVisibleListBoxCount;
      Self.lbCounty.Width:=Self.Width/AVisibleListBoxCount;

    end;
  end;
end;

procedure TFrameSelectArea.SetGPSLocation(AProvince, ACity, AArea: String);
begin

  FGPSProvince:=AProvince;
  FGPSCity:=ACity;
  FGPSArea:=AArea;

  Self.pnlDevide2.Visible:=(AProvince<>'');
  if Self.FIsNeedArea then
  begin
    //需要区域S
    Self.btnPosition.Caption:=AArea;
  end
  else
  begin
    //只需要城市
    Self.btnPosition.Caption:=ACity;
  end;
end;

procedure TFrameSelectArea.ShowDefaultData;
begin
  // 设置默认选中数据
  if FIsDataLoaded then
  begin
    Self.GetAllProvience();

    Self.lbProvience.Prop.Items[FProvienceIndex].Selected:=True;
    FSelectedProvince:=Self.lbProvience.Prop.Items[FProvienceIndex].Caption;

    Self.lbCity.Prop.Items[FCityIndex].Selected:=True;
    FSelectedCity:= Self.lbCity.Prop.Items[FCityIndex].Caption;

    if FAreaIndex>=0 then
    begin
      Self.lbCounty.Prop.Items[FAreaIndex].Selected:=True;
      FSelectedArea:=Self.lbCounty.Prop.Items[FAreaIndex].Caption;
    end
    else
    begin
      FSelectedArea:='';
    end;

  end;

end;

procedure TFrameSelectArea.tteGetAreaExecute(Sender: TTimerTask);
var
  ASuperObject:ISuperObject;
begin
  Sender.TaskTag:=1;
  try
    //从接口返回数据
    Sender.TaskDesc:=//'';
          SimpleCallAPI(
                      'get_state_area',
                      nil,
                      FRestUrl,
                      ['state_name_en'],
                      [FRestStateNameEn],
                      '',
                      ''
                      );

    if Sender.TaskDesc<>'' then
    begin
        ASuperObject:=TSuperObject.Create(Sender.TaskDesc);
        if ASuperObject.I['Code']=200 then
        begin
          //在线程中就解析好,防止界面卡顿
          FState.ParseProvinceListFromWeb(ASuperObject.O['Data']);
          FIsDataLoaded:=True;
        end
        else
        begin
          //接口返回失败
        end;
        Sender.TaskTag:=0;
    end
    else
    begin
        Sender.TaskDesc:='数据获取失败';
    end;
  except
    on E:Exception do
    begin
      //异常
      Sender.TaskDesc:=E.Message;
    end;
  end;
end;

procedure TFrameSelectArea.tteGetAreaExecuteEnd(Sender: TTimerTask);
begin
  try
    if Sender.TaskTag=0 then
    begin

      Init(Self.FDelayLoadProvinceName,
                  Self.FDelayLoadCityName,
                  Self.FDelayLoadAreaName,
                  False,
                  FIsEnglish,
                  FIsNeedArea);

      FrameResize(nil);
    end
    else
    begin
      ShowMessageBoxFrame(Self,Sender.TaskDesc,'',TMsgDlgType.mtInformation,['确定'],nil);
    end;
  finally
    HideWaitingFrame;
  end;
end;

// 根据省市县各自段返回定位下标
procedure TFrameSelectArea.Init(AProvinceName,ACityName,AAreaName: String;
      AIsLoadDataFromConst:Boolean;
      AIsEnglish:Boolean;
      AIsNeedArea:Boolean);
var
  I,J,K:Integer;
  AProvince:TProvince;
  ACity:TCity;
  AArea:TArea;
begin

  //延迟加载,因为一开始地区并没有加载好
  FDelayLoadProvinceName:=AProvinceName;
  FDelayLoadCityName:=ACityName;
  FDelayLoadAreaName:=AAreaName;

  //是否是英文版的
  FIsEnglish:=AIsEnglish;
  //是否需要区域
  FIsNeedArea:=AIsNeedArea;


  //没有加载过就加载
  if AIsLoadDataFromConst and Not Self.FIsDataLoaded then
  begin
    //从常量中加载
    Self.LoadData;
  end;


  FProvienceIndex:=0;
  FCityIndex:=0;
  FAreaIndex:=-1;

  if (AProvinceName='') and (ACityName='') and (AAreaName='') then
  begin
      //初始定位的省市区
      FProvienceIndex:=0;
      FCityIndex:=0;
      FAreaIndex:=-1;

  end
  else
  begin

      for I := 0 to Self.FState.ProvinceList.Count-1 do
      begin
        AProvince:=TProvince(Self.FState.ProvinceList[I]);
        if (AProvince.name_zh=AProvinceName)
          or (ReplaceStr(AProvince.name_en,'/','-')=AProvinceName)
          or (AProvince.name_en=AProvinceName)
          //浙江,浙江省
          or (AProvince.name_zh+'省'=AProvinceName)
          or (AProvince.name_zh=AProvinceName+'省')
          //上海,上海市
          or (AProvince.name_zh+'市'=AProvinceName)
          or (AProvince.name_zh=AProvinceName+'市')
          then
        begin

            //找到省
            FProvienceIndex:=I;
            for J := 0 to AProvince.CityList.Count-1 do
            begin

                ACity:=TCity(AProvince.CityList[J]);

                if (ACity.name_zh=ACityName)
                  or (ACity.name_en=ACityName)
                  //金华,金华市
                  or (ACity.name_zh+'市'=ACityName)
                  or (ACity.name_zh=ACityName+'市')
                then
                begin
                    //找到市
                    FCityIndex:=J;

                    for K := 0 to ACity.AreaList.Count-1 do
                    begin
                      AArea:=TArea(ACity.AreaList[K]);
                      if (AArea.name_zh=AAreaName)
                        or (AArea.name_en=AAreaName)
                        //婺城,婺城区
                        or (AArea.name_zh+'区'=AAreaName)
                        or (AArea.name_zh=AAreaName+'区')
                      then
                      begin
                        //找到区
                        FAreaIndex:=K;

                        Break;
                      end;
                    end;

                    //找到市
                    Break;

                end;
            end;

            //找到省
            Break;

        end;

      end;
  end;


  ShowDefaultData();

  FrameResize(nil);
end;



// 确认按钮事件
procedure TFrameSelectArea.btnOKClick(Sender: TObject);
begin

  //选择的省份
  FSelectedProvince:='';
  if Self.lbProvience.Prop.SelectedItem<>nil then
  begin
    FSelectedProvince:=Self.lbProvience.Prop.SelectedItem.Caption;
  end;

  //选择的城市
  FSelectedCity:='';
  if Self.lbCity.Prop.SelectedItem<>nil then
  begin
    FSelectedCity:=Self.lbCity.Prop.SelectedItem.Caption;
  end;

  //选择的区域
  FSelectedArea:='';
  if Self.lbCounty.Prop.SelectedItem<>nil then
  begin
    FSelectedArea:=Self.lbCounty.Prop.SelectedItem.Caption;
  end;


  Self.pnlDevide2.Visible:=False;

  HideFrame;//();
  ReturnFrame();

end;

procedure TFrameSelectArea.btnPositionClick(Sender: TObject);
begin
//  FSelectedProvince:=FGPSProvince;
//  FSelectedCity:=FGPSCity;
//  FSelectedArea:='';


  Init(Self.FGPSProvince,
              Self.FGPSCity,
              Self.FGPSArea,
              False,
              FIsEnglish,
              Self.FIsNeedArea);


  if FIsClickGPSAddrThenOK then
  begin
    Self.btnOKClick(Sender);
  end;

end;

procedure TFrameSelectArea.btnReturnClick(Sender: TObject);
begin
  Self.pnlDevide2.Visible:=False;

  if GetFrameHistory(Self)<>nil then GetFrameHistory(Self).OnReturnFrame:=nil;

  HideFrame;//(Self);
  ReturnFrame;//(Self);
end;

// 获取省
procedure TFrameSelectArea.GetAllProvience;
var
  provienceListBoxItem:TSkinListBoxItem;
  I: Integer;
  AProvince:TProvince;
begin

  Self.lbProvience.Prop.Items.BeginUpdate;
  try
    Self.lbProvience.Prop.Items.Clear(True);
    for I := 0 to Self.FState.ProvinceList.Count-1 do
    begin
      AProvince:=TProvince(Self.FState.ProvinceList[I]);
      provienceListBoxItem:=Self.lbProvience.Prop.Items.Add;
      if Self.FIsEnglish then
      begin
        provienceListBoxItem.Caption:=AProvince.name_en;
      end
      else
      begin
        provienceListBoxItem.Caption:=AProvince.name_zh;
      end;
      provienceListBoxItem.Data:=Self.FState.ProvinceList[I];
    end;
    Self.lbProvience.Prop.Items[0].Selected:=True;
  finally
    Self.lbProvience.Prop.Items.EndUpdate;
  end;

end;

// 获取城市
procedure TFrameSelectArea.GetAllCity;
var
  cityListBoxItem:TSkinListBoxItem;
  AProvince:TProvince;
  ACity:TCity;
  I,temp,J: Integer;
begin
  Self.lbCity.Prop.Items.BeginUpdate;
  try
    Self.lbCity.Prop.Items.Clear(True);
    if Self.lbProvience.Prop.SelectedItem<>nil then
    begin

      //获取当前选择的省份
      temp:=Self.lbProvience.Prop.SelectedItem.Index;

      AProvince:=TProvince(Self.FState.ProvinceList[temp]);
      for I := 0 to AProvince.CityList.Count-1 do
      begin
        ACity:=TCity(AProvince.CityList[I]);
        cityListBoxItem:=Self.lbCity.Prop.Items.Add;
        if Self.FIsEnglish then
        begin
          cityListBoxItem.Caption:=ACity.name_en;
        end
        else
        begin
          cityListBoxItem.Caption:=ACity.name_zh;
        end;
        cityListBoxItem.Data:=AProvince.CityList[I];
      end;

      //选中第一个城市
      Self.lbCity.Prop.Items[0].Selected:=True;

    end;
  finally
    Self.lbCity.Prop.Items.EndUpdate;
  end;

end;

// 获取区县
procedure TFrameSelectArea.GetAllCounty;
var
  countyListBoxItem:TSkinListBoxItem;
  I,tempP,tempC:Integer;
  AProvince:TProvince;
  ACity:TCity;
begin
  Self.lbCounty.Prop.Items.BeginUpdate;
  try
    Self.lbCounty.Prop.Items.Clear(True);
    if Self.lbProvience.Prop.SelectedItem<>nil then
    begin
      tempP:=Self.lbProvience.Prop.SelectedItem.Index;
      tempC:=Self.lbCity.Prop.SelectedItem.Index;

      AProvince:=TProvince(Self.FState.ProvinceList[tempP]);
      ACity:=TCity(AProvince.CityList[tempC]);

      for I := 0 to ACity.AreaList.Count-1 do
      begin
        countyListBoxItem:=Self.lbCounty.Prop.Items.Add;
        if Self.FIsEnglish then
        begin
          countyListBoxItem.Caption:=TArea(ACity.AreaList[I]).name_en;
        end
        else
        begin
          countyListBoxItem.Caption:=TArea(ACity.AreaList[I]).name_zh;
        end;
      end;

      if ACity.AreaList.Count>0 then
      begin
        Self.lbCounty.Prop.Items[0].Selected:=True;
      end;

//      for I := 1 to dataObject.A['data'].O[tempP].A['cities'].O[tempC].A['counties'].Length-1 do
//      begin
//        if (tempP>3) and (tempP<31) then
//        begin
//          countyListBoxItem:=Self.lbCounty.Prop.Items.Add;
//          countyListBoxItem.Caption:=dataObject.A['data'].O[tempP].A['cities'].O[tempC].A['counties'].O[I].S['name'];
//        end;
//      end;
//      if (tempP>3) and (tempP<31) then
//      begin
//        Self.lbCounty.Prop.Items[0].Selected:=True;
//      end

    end;
  finally
    Self.lbCounty.Prop.Items.EndUpdate;
  end;
end;

procedure TFrameSelectArea.lbProvienceSelectedItem(Sender: TObject; AItem: TSkinItem);
begin
  //获取省份对应的城市
  GetAllCity();
end;

procedure TFrameSelectArea.lbCitySelectedItem(Sender: TObject; AItem: TSkinItem);
begin
  GetAllCounty();
end;

{ TCity }

constructor TCity.Create;
begin
  AreaList:=TBaseList.Create();
end;

destructor TCity.Destroy;
begin
  FreeAndNil(AreaList);
  inherited;
end;

function TCity.ParseAreaListFromCommaText(ACommaText: String): Boolean;
var
  I: Integer;
  AArea:TArea;
  AStringList:TStringList;
begin
  Self.AreaList.Clear(True);
  AStringList:=TStringList.Create;
  try
    AStringList.CommaText:=ACommaText;
    for I := 0 to AStringList.Count-1 do
    begin
      if AStringList[I]<>'' then
      begin
        GlobalIsStateHasArea:=True;
        AArea:=TArea.Create;
        AArea.name_zh:=AStringList[I];
        AArea.name_en:=AStringList[I];
        Self.AreaList.Add(AArea);
      end;
    end;
  finally
    FreeAndNil(AStringList);
  end;

end;

function TCity.ParseAreaListFromJson(ASuperArray: ISuperArray): Boolean;
var
  I: Integer;
  AArea:TArea;
begin
  Self.AreaList.Clear(True);
  for I := 0 to ASuperArray.Length-1 do
  begin
    GlobalIsStateHasArea:=True;
    AArea:=TArea.Create;
    AArea.name_zh:=ASuperArray.O[I].S['name'];
    AArea.name_en:=ASuperArray.O[I].S['name'];
    Self.AreaList.Add(AArea);
  end;

end;

function TCity.SaveAsCommaText: String;
var
  I: Integer;
begin
  Result:='';
  for I := 0 to Self.AreaList.Count-1 do
  begin
    Result:=Result+TArea(Self.AreaList[I]).name_zh+',';
  end;

  //补齐
  for I := 0 to MaxCount-Self.AreaList.Count-1 do
  begin
    Result:=Result+',';
  end;

  Result:=''''+Result+''',';
end;

{ TProvince }

constructor TProvince.Create;
begin
  CityList:=TBaseList.Create;
end;

destructor TProvince.Destroy;
begin
  FreeAndNil(CityList);
  inherited;
end;

function TProvince.ParseCityListFromJson(ASuperArray: ISuperArray): Boolean;
var
  I: Integer;
  ACity:TCity;
begin
  Self.CityList.Clear(True);
  for I := 0 to ASuperArray.Length-1 do
  begin
    GlobalIsStateHasCity:=True;
    ACity:=TCity.Create;
    ACity.name_zh:=ASuperArray.O[I].S['name'];
    ACity.name_en:=ASuperArray.O[I].S['name'];
    Self.CityList.Add(ACity);
    ACity.ParseAreaListFromJson(ASuperArray.O[I].A['counties']);
  end;

end;

function TProvince.ParseCityListFromCommaText(ACommaText:String;
                                              AAreaArray:Array of String):Boolean;
var
  I: Integer;
  ACity:TCity;
  AStringList:TStringList;
begin
  Self.CityList.Clear();
  AStringList:=TStringList.Create;
  AStringList.CommaText:=ACommaText;
  try
    for I := 0 to AStringList.Count-1 do
    begin
      if AStringList[I]<>'' then
      begin
        GlobalIsStateHasCity:=True;
        ACity:=TCity.Create;
        ACity.name_zh:=AStringList[I];
        ACity.name_en:=AStringList[I];
        Self.CityList.Add(ACity);

        ACity.ParseAreaListFromCommaText(AAreaArray[I]);
      end;
    end;
  finally
    FreeAndNil(AStringList);
  end;
end;

function TProvince.SaveAsCommaText: String;
var
  I: Integer;
begin
  Result:='';
  for I := 0 to Self.CityList.Count-1 do
  begin
    Result:=Result+TCity(Self.CityList[I]).name_zh+',';
  end;

  //补齐
  for I := 0 to MaxCount-Self.CityList.Count-1 do
  begin
    Result:=Result+',';
  end;

  Result:='    '+''''+Result+''',';
end;

{ TState }

constructor TState.Create;
begin
  ProvinceList:=TBaseList.Create;

end;

destructor TState.Destroy;
begin
  FreeAndNil(ProvinceList);
  inherited;
end;

function TState.ParseProvinceListFromCommaText(ACommaText: String;
                                              ACityArray:Array of String;
                                              AAreaArray:Array of TAreaStringArray): Boolean;
var
  I: Integer;
  AProvince:TProvince;
  AStringList:TStringList;
begin
  GlobalIsStateHasCity:=False;
  GlobalIsStateHasArea:=False;

  Self.ProvinceList.Clear(True);
  AStringList:=TStringList.Create;
  try
    AStringList.CommaText:=ACommaText;
    for I := 0 to AStringList.Count-1 do
    begin
      if AStringList[I]<>'' then
      begin
        AProvince:=TProvince.Create;
        AProvince.name_zh:=AStringList[I];
        AProvince.name_en:=AStringList[I];
        Self.ProvinceList.Add(AProvince);

        //每个省包含多少城市
        AProvince.ParseCityListFromCommaText(ACityArray[I],AAreaArray[I]);

      end;
    end;
  finally
    FreeAndNil(AStringList)
  end;
end;

function TState.ParseProvinceListFromJson(ASuperArray: ISuperArray): Boolean;
var
  I: Integer;
  AProvince:TProvince;
begin
  GlobalIsStateHasCity:=False;
  GlobalIsStateHasArea:=False;

  Self.ProvinceList.Clear(True);
  for I := 0 to ASuperArray.Length-1 do
  begin
    AProvince:=TProvince.Create;
    AProvince.name_zh:=ASuperArray.O[I].S['name'];
    AProvince.name_en:=ASuperArray.O[I].S['name'];
    Self.ProvinceList.Add(AProvince);
    AProvince.ParseCityListFromJson(ASuperArray.O[I].A['cities']);
  end;
end;

function TState.ParseProvinceListFromWeb(ASuperObject: ISuperObject): Boolean;
var
  I: Integer;
  J:Integer;
  AProvince:TProvince;
  AProvinceFID:Integer;
  ACityObject:ISuperObject;
  ACity:TCity;
  K: Integer;
  AAreaObject:ISuperObject;
  AArea:TArea;

  AIsCityFound:Boolean;
  AIsAreaFound:Boolean;

  ACityList:TBaseList;
  AAreaList:TBaseList;
begin
  GlobalIsStateHasCity:=False;
  GlobalIsStateHasArea:=False;

  ACityList:=TBaseList.Create(ooReference);
  AAreaList:=TBaseList.Create(ooReference);
  try
    Self.ProvinceList.Clear();


    //先取出来,遍历会比较快
    for J := 0 to ASuperObject.A['CityList'].Length-1 do
    begin
      ACityObject:=ASuperObject.A['CityList'].O[J];
      ACity:=TCity.Create;
      ACity.fid:=ACityObject.I['fid'];
      ACity.province_fid:=ACityObject.I['province_fid'];
      ACity.name_zh:=ACityObject.S['name_zh'];
      ACity.name_en:=ACityObject.S['name_en'];
      ACityList.Add(ACity);
    end;

    //先取出来,遍历会比较快
    for K := 0 to ASuperObject.A['AreaList'].Length-1 do
    begin
      AAreaObject:=ASuperObject.A['AreaList'].O[K];
      AArea:=TArea.Create;
      AArea.fid:=AAreaObject.I['fid'];
      AArea.province_fid:=AAreaObject.I['province_fid'];
      AArea.city_fid:=AAreaObject.I['city_fid'];
      AArea.name_zh:=AAreaObject.S['name_zh'];
      AArea.name_en:=AAreaObject.S['name_en'];
      AAreaList.Add(AArea);
    end;


    for I := 0 to ASuperObject.A['ProvinceList'].Length-1 do
    begin
      AProvince:=TProvince.Create;
      AProvince.fid:=ASuperObject.A['ProvinceList'].O[I].I['fid'];
      AProvince.name_zh:=ASuperObject.A['ProvinceList'].O[I].S['name_zh'];
      AProvince.name_en:=ASuperObject.A['ProvinceList'].O[I].S['name_en'];
      Self.ProvinceList.Add(AProvince);


      AIsCityFound:=False;
      for J := 0 to ACityList.Count-1 do
      begin
        if TCity(ACityList[J]).province_fid=AProvince.fid then
        begin

          ACity:=TCity(ACityList[J]);
          AIsCityFound:=True;
          GlobalIsStateHasCity:=True;
          //属于当前省的城市
          AProvince.CityList.Add(ACity);


          //属于当前城市的区域
          AIsAreaFound:=False;
          for K := 0 to AAreaList.Count-1 do
          begin
            if TArea(AAreaList[K]).city_fid=ACity.fid then
            begin
              AIsAreaFound:=True;
              GlobalIsStateHasArea:=True;
              ACity.AreaList.Add(AAreaList[K]);
            end
            else
            begin
              if AIsAreaFound then
              begin
                Break;
              end;
            end;
          end;

        end
        else
        begin
          if AIsCityFound then
          begin
            Break;
          end;
        end;
      end;


    end;




  finally
    FreeAndNil(ACityList);
    FreeAndNil(AAreaList);
  end;

end;

function TState.SaveAsCommaText: String;
var
  I: Integer;
begin
  Result:='';
  for I := 0 to Self.ProvinceList.Count-1 do
  begin
    Result:=Result+TProvince(Self.ProvinceList[I]).name_zh+',';
  end;

  //补齐
  for I := 0 to MaxCount-Self.ProvinceList.Count-1 do
  begin
    Result:=Result+',';
  end;

end;

end.











